
&НаКлиенте
Процедура SourceПриИзменении(Элемент)
	
	Элементы.CREW.Видимость = (Объект.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.HOBs"));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.CREW.Видимость = (Объект.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.HOBs"));
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		
		// значения наследуются из основания
		Элементы.AgreementCode.ТолькоПросмотр = Истина;
		Элементы.AgreementType.ТолькоПросмотр = Истина;
		Элементы.Agreement.ТолькоПросмотр = Истина;
		Элементы.AgreementStatus.ТолькоПросмотр = Истина;
		
		Элементы.AgreementCode.ПутьКДанным = "Объект.Основание.AgreementCode";
		Элементы.AgreementType.ТолькоПросмотр = "Объект.Основание.AgreementType";
		Элементы.Agreement.ТолькоПросмотр = "Объект.Основание.Agreement";
		Элементы.AgreementStatus.ТолькоПросмотр = "Объект.Основание.AgreementStatus";
		
	КонецЕсли;
	
КонецПроцедуры
