
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТранзакцияHOB") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТранзакцияOracle") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроводкаDSS") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	РеквизитыТранзакции = Документы.КорректировкаТранзакции.ПолучитьРеквизитыТранзакции(ДокументОснование);
	Если РеквизитыТранзакции.Source = Перечисления.ТипыСоответствий.OracleSmith ИЛИ РеквизитыТранзакции.Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
		Если РеквизитыТранзакции.ТранзакцияClient = Client И
				РеквизитыТранзакции.ТранзакцияAccount = Account И
				РеквизитыТранзакции.ТранзакцияCompany = Company И
				РеквизитыТранзакции.ТранзакцияLocation = Location И
				РеквизитыТранзакции.ТранзакцияSubSubSegment = SubSubSegment И
				РеквизитыТранзакции.ТранзакцияCurrency = Currency И
				РеквизитыТранзакции.ТранзакцияLegalEntity = LegalEntity Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Attributes not changed");
		КонецЕсли;
	ИначеЕсли РеквизитыТранзакции.ТранзакцияClient = Client И
				РеквизитыТранзакции.ТранзакцияAccount = Account И
				РеквизитыТранзакции.ТранзакцияCompany = Company И
				РеквизитыТранзакции.ТранзакцияLocation = Location И
				РеквизитыТранзакции.ТранзакцияSubSubSegment = SubSubSegment И
				РеквизитыТранзакции.ТранзакцияCurrency = Currency И
				РеквизитыТранзакции.ТранзакцияLegalEntity = LegalEntity И
				РеквизитыТранзакции.ТранзакцияAU = AU Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Attributes not changed");
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ТранзакцияОбъект = ДокументОснование.ПолучитьОбъект();
	
	НЗ_BilledAR = РегистрыНакопления.BilledAR.СоздатьНаборЗаписей();
	НЗ_BilledAR.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_BilledAR.Прочитать();
	
	Если НЗ_BilledAR.Количество() > 0 Тогда
		
		ДвиженияBilledAR = Движения.BilledAR;
		
		Для Каждого Запись Из НЗ_BilledAR Цикл
			НовоеДвижениеСторно = ДвиженияBilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияBilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.Invoice = Запись.Invoice;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияBilledAR.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_UnbilledAR = РегистрыНакопления.UnbilledAR.СоздатьНаборЗаписей();
	НЗ_UnbilledAR.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_UnbilledAR.Прочитать();
	
	Если НЗ_UnbilledAR.Количество() > 0 Тогда
		
		ДвиженияUnbilledAR = Движения.UnbilledAR;
		
		Для Каждого Запись Из НЗ_UnbilledAR Цикл
			НовоеДвижениеСторно = ДвиженияUnbilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияUnbilledAR.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.SalesOrder = Запись.SalesOrder;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияUnbilledAR.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_UnallocatedCash = РегистрыНакопления.UnallocatedCash.СоздатьНаборЗаписей();
	НЗ_UnallocatedCash.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_UnallocatedCash.Прочитать();
	
	Если НЗ_UnallocatedCash.Количество() > 0 Тогда
		
		ДвиженияUnallocatedCash = Движения.UnallocatedCash;
		
		Для Каждого Запись Из НЗ_UnallocatedCash Цикл
			НовоеДвижениеСторно = ДвиженияUnallocatedCash.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияUnallocatedCash.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.CashBatch = Запись.CashBatch;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияUnallocatedCash.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_UnallocatedMemo = РегистрыНакопления.UnallocatedMemo.СоздатьНаборЗаписей();
	НЗ_UnallocatedMemo.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_UnallocatedMemo.Прочитать();
	
	Если НЗ_UnallocatedMemo.Количество() > 0 Тогда
		
		ДвиженияUnallocatedMemo = Движения.UnallocatedMemo;
		
		Для Каждого Запись Из НЗ_UnallocatedMemo Цикл
			НовоеДвижениеСторно = ДвиженияUnallocatedMemo.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияUnallocatedMemo.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.Memo = Запись.Memo;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияUnallocatedMemo.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_ManualTransactions = РегистрыНакопления.ManualTransactions.СоздатьНаборЗаписей();
	НЗ_ManualTransactions.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_ManualTransactions.Прочитать();
	
	Если НЗ_ManualTransactions.Количество() > 0 Тогда
		
		ДвиженияManualTransactions = Движения.ManualTransactions;
		
		Для Каждого Запись Из НЗ_ManualTransactions Цикл
			НовоеДвижениеСторно = ДвиженияManualTransactions.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			НовоеДвижениеСторно.BaseAmount = -Запись.BaseAmount;
			
			НовоеДвижение = ДвиженияManualTransactions.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.РучнаяКорректировка = Запись.РучнаяКорректировка;
			НовоеДвижение.Amount = Запись.Amount;
			НовоеДвижение.BaseAmount = Запись.BaseAmount;
		КонецЦикла;
		
		ДвиженияManualTransactions.Записывать = Истина;
		
	КонецЕсли;
	
	НЗ_Payments = РегистрыНакопления.Payments.СоздатьНаборЗаписей();
	НЗ_Payments.Отбор.Регистратор.Установить(ДокументОснование);
	НЗ_Payments.Прочитать();
	
	Если НЗ_Payments.Количество() > 0 Тогда
		
		ДвиженияPayments = Движения.Payments;
		
		Для Каждого Запись Из НЗ_Payments Цикл
			НовоеДвижениеСторно = ДвиженияPayments.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижениеСторно,Запись);
			НовоеДвижениеСторно.Период = Дата;
			НовоеДвижениеСторно.Amount = -Запись.Amount;
			
			НовоеДвижение = ДвиженияPayments.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, ЭтотОбъект);
			НовоеДвижение.Период = Дата;
			НовоеДвижение.ВидДвижения = Запись.ВидДвижения;
			НовоеДвижение.Source = Запись.Source;
			НовоеДвижение.Invoice = Запись.Invoice;
			НовоеДвижение.CashBatch = Запись.CashBatch;
			НовоеДвижение.Amount = Запись.Amount;
		КонецЦикла;
		
		ДвиженияPayments.Записывать = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
