
&НаКлиенте
Процедура SourceПриИзменении(Элемент)
	
	Элементы.CREW.Видимость = (Объект.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.HOBs"));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.CREW.Видимость = (Объект.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.HOBs"));
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		
		// значения наследуются из основания
		//Элементы.Удалить(Элементы.AgreementCode);
		//Элементы.Удалить(Элементы.AgreementType);
		//Элементы.Удалить(Элементы.Agreement);
		//Элементы.Удалить(Элементы.AgreementStatus);
		
		Элемент = Элементы.Добавить("AgreementCode", Тип("ПолеФормы"), Элементы.ГруппаAgreementЛевая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Основание.AgreementCode";
		Элемент.ТолькоПросмотр = Истина;
		
		Элемент = Элементы.Добавить("AgreementType", Тип("ПолеФормы"), Элементы.ГруппаAgreementЛевая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Основание.AgreementType";
		Элемент.ТолькоПросмотр = Истина;
		
		Элемент = Элементы.Добавить("Agreement", Тип("ПолеФормы"), Элементы.ГруппаAgreementПравая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Основание.Agreement";
		Элемент.ТолькоПросмотр = Истина;
		
		Элемент = Элементы.Добавить("AgreementStatus", Тип("ПолеФормы"), Элементы.ГруппаAgreementПравая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Основание.AgreementStatus";
		Элемент.ТолькоПросмотр = Истина;
		
	Иначе
		
		Элемент = Элементы.Добавить("AgreementCode", Тип("ПолеФормы"), Элементы.ГруппаAgreementЛевая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.AgreementCode";
		Элемент.ТолькоПросмотр = Ложь;
		
		Элемент = Элементы.Добавить("AgreementType", Тип("ПолеФормы"), Элементы.ГруппаAgreementЛевая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.AgreementType";
		Элемент.ТолькоПросмотр = Ложь;
		
		Элемент = Элементы.Добавить("Agreement", Тип("ПолеФормы"), Элементы.ГруппаAgreementПравая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.Agreement";
		Элемент.ТолькоПросмотр = Ложь;
		
		Элемент = Элементы.Добавить("AgreementStatus", Тип("ПолеФормы"), Элементы.ГруппаAgreementПравая);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.AgreementStatus";
		Элемент.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
