
&НаСервере
Процедура ВыполнитьОчисткуДанныхНаСервере()
	
	НачатьТранзакцию();
	
	НЗ_DSSSourceData = РегистрыСведений.OracleSourceData.СоздатьНаборЗаписей();
	НЗ_DSSСформированныеПриЗагрузке = РегистрыСведений.DSSСформированныеПриЗагрузке.СоздатьНаборЗаписей();
	
	ВыборкаДокументовЗагрузки = Документы.ЗагрузкаДанныхOracle.Выбрать();
	
	Пока ВыборкаДокументовЗагрузки.Следующий() Цикл
		
		НЗ_DSSSourceData.Отбор.ДокументЗагрузки.Установить(ВыборкаДокументовЗагрузки.Ссылка);
		НЗ_DSSSourceData.Записать(Истина);
		
		НЗ_DSSСформированныеПриЗагрузке.Отбор.ДокументЗагрузки.Установить(ВыборкаДокументовЗагрузки.Ссылка);
		НЗ_DSSСформированныеПриЗагрузке.Записать(Истина);
		
		ТекОбъект = ВыборкаДокументовЗагрузки.ПолучитьОбъект();
		ТекОбъект.Удалить();
		
	КонецЦикла;
	
	НЗ_DSSСвязанныеДокументы = РегистрыСведений.DSSСвязанныеДокументы.СоздатьНаборЗаписей();
	
	ВыборкаТранзакций = Документы.ТранзакцияOracle.Выбрать();
	
	Пока ВыборкаТранзакций.Следующий() Цикл
		
		НЗ_DSSСвязанныеДокументы.Отбор.ПроводкаDSS.Установить(ВыборкаТранзакций.Ссылка);
		НЗ_DSSСвязанныеДокументы.Записать(Истина);
		
		ТекОбъект = ВыборкаТранзакций.ПолучитьОбъект();
		
		Если ТекОбъект.Проведен Тогда
			ТекОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		ТекОбъект.Удалить();
		
	КонецЦикла;
	
	ВыборкаSO = Документы.SalesOrder.Выбрать();
	
	Пока ВыборкаSO.Следующий() Цикл
		
		Если ВыборкаSO.Source <> Перечисления.ТипыСоответствий.OracleMI Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОбъект = ВыборкаSO.ПолучитьОбъект();
		ТекОбъект.Удалить();
		
	КонецЦикла;
	
	ВыборкаИнвойсов = Документы.Invoice.Выбрать();
	
	Пока ВыборкаИнвойсов.Следующий() Цикл
		
		Если ВыборкаИнвойсов.Source <> Перечисления.ТипыСоответствий.OracleMI Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОбъект = ВыборкаИнвойсов.ПолучитьОбъект();
		ТекОбъект.Удалить();
		
	КонецЦикла;
	
	ВыборкаРучныхКорректировок = Документы.РучнаяКорректировка.Выбрать();
	
	Пока ВыборкаРучныхКорректировок.Следующий() Цикл
		
		Если ВыборкаРучныхКорректировок.Source <> Перечисления.ТипыСоответствий.OracleMI Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОбъект = ВыборкаРучныхКорректировок.ПолучитьОбъект();
		ТекОбъект.Удалить();
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчисткуДанных(Команда)
	
	ВыполнитьОчисткуДанныхНаСервере();
	
КонецПроцедуры
