
&НаСервере
Процедура ЗаписатьВБезопасноеХранилищеНаСервере()
	ПараметрыПодключенияВИД = Новый Структура;
	ПараметрыПодключенияВИД.Вставить("АутентификицияОС", Элементы.АутентификацияОС);
	ПараметрыПодключенияВИД.Вставить("СтандартнаяАутентифкация", Элементы.АутентификацияСтандартаня);
	ПараметрыПодключенияВИД.Вставить("ИмяПользователя", Элементы.ИмяПользователя);
	ПараметрыПодключенияВИД.Вставить("Пароль", Элементы.Пароль);
	ПараметрыПодключенияВИД.Вставить("СтрокаСоединения", Элементы.СтрокаСоединения);
	ПараметрыПодключенияВИД.Вставить("БазаДанных", Элементы.БазаДанных);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВБезопасноеХранилище(Команда)
	ЗаписатьВБезопасноеХранилищеНаСервере();
КонецПроцедуры
