Перем ТаблицаСтрокRevenue Экспорт;
Перем НужнаСинхронизация;

Перем мМассивСтрокRevenueДоЗаписи;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ТаблицаСтрокRevenue = Неопределено Тогда
		ТаблицаСтрокRevenue = Документы.ЗагрузкаДанныхRevenue.ПолучитьТаблицуRevenueLines(Ссылка);
	КонецЕсли;
	
	ДвиженияRevenueByClients = Движения.RevenueByClients;
	ДвиженияRevenueByClients.Записывать = Истина;
	
	Для каждого ТекСтрокаRevenue Из ТаблицаСтрокRevenue Цикл
		Движение = ДвиженияRevenueByClients.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаRevenue);
		Движение.Период = Дата;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаСтрокRevenue = Неопределено Тогда
		ТаблицаСтрокRevenue = Документы.ЗагрузкаДанныхRevenue.ПолучитьТаблицуRevenueLines(Ссылка);
		НужнаСинхронизация = Ложь;
	Иначе
		НужнаСинхронизация = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НужнаСинхронизация Тогда
		
		ДобавитьДополнительныеКолонкиВТаблицуСтрокRevenue(ТаблицаСтрокRevenue);
		
		// получим таблицу строк revenue из базы
		ТаблицаСтрокRevenueБазы = Документы.ЗагрузкаДанныхRevenue.ПолучитьТаблицуRevenueLines(Ссылка);
		
		// Синхронизируем таблицу строк revenue со строками в базе данных
		РГСофт.СинхронизироватьСтрокиТаблицыСБазойДанных(ТаблицаСтрокRevenueБазы, ТаблицаСтрокRevenue, Справочники.СтрокиRevenue, Отказ);
				
	КонецЕсли;
	
	ТаблицаСтрокRevenue = Неопределено;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеКолонкиВТаблицуСтрокRevenue(ТаблицаСтрокRevenue)
	
	КолонкиТаблицы = ТаблицаСтрокRevenue.Колонки;
	
	Если КолонкиТаблицы.Найти("ЗагрузкаДанных") = Неопределено Тогда
		КолонкиТаблицы.Добавить("ЗагрузкаДанных", Новый ОписаниеТипов("ДокументСсылка.ЗагрузкаДанныхRevenue"));
	КонецЕсли;
	ТаблицаСтрокRevenue.ЗаполнитьЗначения(Ссылка, "ЗагрузкаДанных");
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ДвиженияRevenueByClients = Движения.RevenueByClients;
	ДвиженияRevenueByClients.Записывать = Истина;
	ДвиженияRevenueByClients.Очистить();
	ДвиженияRevenueByClients.Записать(Истина);
	
	
КонецПроцедуры
