
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = РГСофт.ПолучитьДатуСервера();
	Если Не ЗначениеЗаполнено(User) Тогда
		User = Пользователи.ТекущийПользователь();
	КонецЕсли;

	СписокИнвойсов = Параметры.СписокИнвойсов;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура SaveНаСервере()
	
	НЗ = РегистрыСведений.InvoiceComments.СоздатьНаборЗаписей();
	НЗ.Отбор.Период.Установить(Период);
	
	Для каждого ЭлементСписка Из СписокИнвойсов Цикл
		
		НЗ.Очистить();
		НЗ.Отбор.Invoice.Установить(ЭлементСписка.Значение);
		
		Запись = НЗ.Добавить();
		Запись.Период = Период;
		Запись.Invoice = ЭлементСписка.Значение;
		Запись.User = User;
		Запись.Status = Status;
		Запись.ConfirmedBy = ConfirmedBy;
		Запись.Comment = Comment;
		Запись.ForecastDate = ForecastDate;
		Запись.CustInputDate = CustInputDate;
		Запись.CustomerRepresentative = CustomerRepresentative;
		Запись.CustomerInputDetails = CustomerInputDetails;
		Запись.SLBAssignedTo = SLBAssignedTo;
		Запись.RemedialWorkPlan = RemedialWorkPlan;
		Запись.RWDTargetDate = RWDTargetDate;
		
		НЗ.Записать(Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Save(Команда)
	
	SaveНаСервере();
	
	Закрыть();
	
КонецПроцедуры
