
Процедура ПриЗаписи(Отказ, Замещение)
	
	СписокКлиентов = ЭтотОбъект.ВыгрузитьКолонку("Client");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Collectors.ManagementGeomarket) КАК КоличествоЗаписейПоКлиенту,
		|	Collectors.Client,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА Collectors.ManagementGeomarket = ЗНАЧЕНИЕ(Справочник.ManagementGeography.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ЕстьПустойManagementGeomarket
		|ИЗ
		|	РегистрСведений.Collectors КАК Collectors
		|ГДЕ
		|	Collectors.Client В (&Clients)
		|СГРУППИРОВАТЬ ПО
		|	Collectors.Client";
	
	Запрос.УстановитьПараметр("Clients", СписокКлиентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.КоличествоЗаписейПоКлиенту > 1 И ВыборкаДетальныеЗаписи.ЕстьПустойManagementGeomarket Тогда
			Отказ = Истина;
			Сообщить("Error writing. Select Management Geomarket for each collector.");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
