
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = Документы.ПроводкаDSS.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если System = "BL" Тогда
		
		Если SourceCode = "DM" ИЛИ SourceCode = "CM" Тогда
			
			// Инвойс
			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
