#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если НЕ ДополнительныеСвойства.Свойство("РазрешитьСозданиеЗаписи") Тогда
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			Если (ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson ИЛИ 
				ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI ИЛИ
				ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith) И
				ЗаписьНабора.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client Тогда
					
					РеквизитыКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьНабора.ОбъектПриемника,"Предопределенный, Intercompany");
				
					Если НЕ РеквизитыКлиента.Предопределенный И НЕ РеквизитыКлиента.Intercompany Тогда
				
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("For " + ЗаписьНабора.ТипСоответствия +" the mapping is filled automatically.",,,,Отказ);
					
					КонецЕсли;
					
			// { RGS DShvarcman 07.06.2019 11:57:01 - S-E-0001252  
			ИначеЕсли ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs И //Запись mapping для HOBs только для клиентов с типом Billing account        
				ЗаписьНабора.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client И
				ТипЗнч(ЗаписьНабора.ОбъектПриемника) = Тип("СправочникСсылка.Контрагенты") И НЕ 
				ЗаписьНабора.ОбъектПриемника.AccountType = Перечисления.ТипыКлиентов.BillingAccount Тогда	
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("No billing client selected.",,,,Отказ);
			// } RGS DShvarcman 07.06.2019 11:57:13 - S-E-0001252	
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МассивУзлов = rgsОбменКлиентамиERMПовтИспСеанс.ПолучитьУзлыПланаОбмена();
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		
		Если ЗаписьНабора.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ЗаписьНабора.ОбъектПриемника);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

