
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если НЕ ДополнительныеСвойства.Свойство("РазрешитьСозданиеЗаписи") Тогда
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			Если ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson ИЛИ 
				ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI ИЛИ
				ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("For " + ЗаписьНабора.ТипСоответствия +" the mapping is filled automatically.",,,,Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МассивУзлов = rgsОбменКлиентамиERMПовтИспСеанс.ПолучитьУзлыПланаОбмена();
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		
		Если ЗаписьНабора.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ЗаписьНабора.ОбъектПриемника);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
