#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если НЕ ДополнительныеСвойства.Свойство("РазрешитьСозданиеЗаписи") Тогда
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			Если (ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson ИЛИ 
				ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI ИЛИ
				ЗаписьНабора.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith) И
				ЗаписьНабора.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client Тогда
					
					РеквизитыКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаписьНабора.ОбъектПриемника,"Предопределенный, Intercompany");
				
					Если НЕ РеквизитыКлиента.Предопределенный И НЕ РеквизитыКлиента.Intercompany Тогда
				
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("For " + ЗаписьНабора.ТипСоответствия +" the mapping is filled automatically.",,,,Отказ);
					
					КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МассивУзлов = rgsОбменКлиентамиERMПовтИспСеанс.ПолучитьУзлыПланаОбмена();
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		
		Если ЗаписьНабора.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ЗаписьНабора.ОбъектПриемника);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

