#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма",
	             Новый Структура("ОтображаемыеЗадания", ПолучитьИменаРегламентныхЗаданийПодсистемы()),
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаРегламентныхЗаданийПодсистемы()

	ИменаРегламентныхЗаданий = Новый Массив;
	
	Для каждого ОбъектМетаданных Из Метаданные.Подсистемы.PowerBI.Состав Цикл
		Если ОбщегоНазначения.ЭтоРегламентноеЗадание(ОбъектМетаданных) Тогда
			ИменаРегламентныхЗаданий.Добавить(ОбъектМетаданных.Имя);
		КонецЕсли;
	КонецЦикла;

	Возврат ИменаРегламентныхЗаданий;
	
КонецФункции // ()


#КонецОбласти