#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения            = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаПарамтерыПроведения(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	ПараметрыПроведения.Вставить("Реквизиты", ТаблицаРеквизиты);
	
	ТаблицаСвязанныеДокументы = Результат[НомераТаблиц["СвязанныеДокументы"]].Выгрузить();
	
	ПараметрыПроведения.Вставить("СвязанныеДокументы", Новый Структура("SalesOrder, Invoice, CashBatch, BatchAllocation, РучнаяКорректировка, Memo"));
	
	Для каждого СтрокаСвязанногоДокумента Из ТаблицаСвязанныеДокументы Цикл
		Если СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.SalesOrder Тогда
			ПараметрыПроведения.СвязанныеДокументы.SalesOrder = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.Invoice Тогда
			ПараметрыПроведения.СвязанныеДокументы.Invoice = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.CashBatch Тогда
			ПараметрыПроведения.СвязанныеДокументы.CashBatch = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.BatchAllocation Тогда
			ПараметрыПроведения.СвязанныеДокументы.BatchAllocation = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.РучнаяКорректировка Тогда
			ПараметрыПроведения.СвязанныеДокументы.РучнаяКорректировка = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.Memo Тогда
			ПараметрыПроведения.СвязанныеДокументы.Memo = СтрокаСвязанногоДокумента.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаПарамтерыПроведения(НомераТаблиц)
	
	НомераТаблиц.Вставить("Реквизиты",                       НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СвязанныеДокументы",              НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТранзакцияOracle.Номер,
	|	ТранзакцияOracle.Дата,
	|	ТранзакцияOracle.GlSourceType,
	|	ТранзакцияOracle.Company,
	|	ТранзакцияOracle.Account,
	|	ТранзакцияOracle.Location,
	|	ТранзакцияOracle.SubSubSegment,
	|	ТранзакцияOracle.Currency,
	|	ТранзакцияOracle.ExchangeRate,
	|	ТранзакцияOracle.GL_Account,
	|	ТранзакцияOracle.Client,
	|	ТранзакцияOracle.Contract,
	|	ТранзакцияOracle.DocType,
	|	ТранзакцияOracle.Description,
	|	ТранзакцияOracle.TransType,
	|	ТранзакцияOracle.SONum,
	|	ТранзакцияOracle.SODate,
	|	ТранзакцияOracle.ShipDateActual,
	|	ТранзакцияOracle.CreationDate,
	|	ТранзакцияOracle.CreatedBy,
	|	ТранзакцияOracle.DocID,
	|	ТранзакцияOracle.LineID,
	|	ТранзакцияOracle.Amount,
	|	ТранзакцияOracle.BaseAmount,
	|	ТранзакцияOracle.Source,
	|	ТранзакцияOracle.AU,
	|	ТранзакцияOracle.Account.БазовыйЭлемент КАК HFMAccount,
	|	ТранзакцияOracle.LegalEntity
	|ИЗ
	|	Документ.ТранзакцияOracle КАК ТранзакцияOracle
	|ГДЕ
	|	ТранзакцияOracle.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	DSSСвязанныеДокументы.ТипСвязанногоОбъекта,
	|	DSSСвязанныеДокументы.СвязанныйОбъект КАК Ссылка
	|ИЗ
	|	РегистрСведений.DSSСвязанныеДокументы КАК DSSСвязанныеДокументы
	|ГДЕ
	|	DSSСвязанныеДокументы.ПроводкаDSS = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьСуммыДляПроводки(Реквизиты, СчетВыручкиHFM, ВалютаUSD, Отказ) Экспорт
	
	СуммыДляПроводки = Новый Структура("Amount,BaseAmount");	

	Если Реквизиты.HFMAccount.ПринадлежитЭлементу(СчетВыручкиHFM) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиОтображенияВалютнойСуммыВОтчетах.ИспользоватьUSDСуммуИзТранзакции
			|ИЗ
			|	РегистрСведений.НастройкиОтображенияВалютнойСуммыВОтчетах КАК НастройкиОтображенияВалютнойСуммыВОтчетах
			|ГДЕ
			|	НастройкиОтображенияВалютнойСуммыВОтчетах.Source = &Source
			|	И НастройкиОтображенияВалютнойСуммыВОтчетах.Company = &Company
			|	И НастройкиОтображенияВалютнойСуммыВОтчетах.TypeAccount = &TypeAccount
			|	И НастройкиОтображенияВалютнойСуммыВОтчетах.ИспользоватьUSDСуммуИзТранзакции";
		
		Запрос.УстановитьПараметр("Company", Реквизиты.Company);
		Запрос.УстановитьПараметр("Source", Реквизиты.Source);
		Запрос.УстановитьПараметр("TypeAccount", Перечисления.ТипСчета.Revenue);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		// { RGS TAlmazova 13.04.2018 17:12:47 - используется в двух местах, вытащила в начало
		СтруктураКурсаВалюты = РаботаСКурсамиВалют.ПолучитьВнутреннийКурсВалюты(Реквизиты.Currency, Реквизиты.Дата);
		Если Не ЗначениеЗаполнено(СтруктураКурсаВалюты.Курс) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("No exchange rate " + Реквизиты.Currency, , , , Отказ);
		КонецЕсли;
		// } RGS TAlmazova 13.04.2018 17:13:13 - используется в двух местах, вытащила в начало
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 ИЛИ Реквизиты.Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
			СуммыДляПроводки.BaseAmount = Реквизиты.BaseAmount;
		ИначеЕсли Реквизиты.Currency = ВалютаUSD Тогда
			СуммыДляПроводки.BaseAmount = Реквизиты.Amount;
		Иначе
			СуммыДляПроводки.BaseAmount = Реквизиты.Amount / СтруктураКурсаВалюты.Курс * ?(СтруктураКурсаВалюты.Кратность = 0, 1, СтруктураКурсаВалюты.Кратность);
		КонецЕсли;
		// { RGS TAlmazova 13.04.2018 17:05:50 - для смитов пересчитываем сумму в валюте транзакции из суммы USD
		Если Реквизиты.Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
			Если Реквизиты.Currency = ВалютаUSD Тогда
				СуммыДляПроводки.Amount = СуммыДляПроводки.BaseAmount;
			Иначе
				СуммыДляПроводки.Amount = СуммыДляПроводки.BaseAmount * СтруктураКурсаВалюты.Курс / ?(СтруктураКурсаВалюты.Кратность = 0, 1, СтруктураКурсаВалюты.Кратность);
			КонецЕсли;
		Иначе
			СуммыДляПроводки.Amount = Реквизиты.Amount;
		КонецЕсли;
		// } RGS TAlmazova 13.04.2018 17:06:12 - для смитов пересчитываем сумму в валюте транзакции из суммы USD
		
	Иначе
	
		СуммыДляПроводки.Amount = Реквизиты.Amount;
		СуммыДляПроводки.BaseAmount = Реквизиты.BaseAmount;
		
	КонецЕсли;

	Возврат СуммыДляПроводки;
	
КонецФункции

#КонецЕсли