#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения            = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаПарамтерыПроведения(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	ПараметрыПроведения.Вставить("Реквизиты", ТаблицаРеквизиты);
	
	ТаблицаСвязанныеДокументы = Результат[НомераТаблиц["СвязанныеДокументы"]].Выгрузить();
	
	ПараметрыПроведения.Вставить("СвязанныеДокументы", Новый Структура("SalesOrder, Invoice, CashBatch, BatchAllocation, РучнаяКорректировка, Memo"));
	
	Для каждого СтрокаСвязанногоДокумента Из ТаблицаСвязанныеДокументы Цикл
		Если СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.SalesOrder Тогда
			ПараметрыПроведения.СвязанныеДокументы.SalesOrder = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.Invoice Тогда
			ПараметрыПроведения.СвязанныеДокументы.Invoice = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.CashBatch Тогда
			ПараметрыПроведения.СвязанныеДокументы.CashBatch = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.BatchAllocation Тогда
			ПараметрыПроведения.СвязанныеДокументы.BatchAllocation = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.РучнаяКорректировка Тогда
			ПараметрыПроведения.СвязанныеДокументы.РучнаяКорректировка = СтрокаСвязанногоДокумента.Ссылка;
		ИначеЕсли СтрокаСвязанногоДокумента.ТипСвязанногоОбъекта = Перечисления.ТипыОбъектовСвязанныхСПроводкойDSS.Memo Тогда
			ПараметрыПроведения.СвязанныеДокументы.Memo = СтрокаСвязанногоДокумента.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаПарамтерыПроведения(НомераТаблиц)
	
	НомераТаблиц.Вставить("Реквизиты",                       НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СвязанныеДокументы",              НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПроводкаDSS.ПометкаУдаления,
	|	ПроводкаDSS.Номер,
	|	ПроводкаDSS.Дата,
	|	ПроводкаDSS.Проведен,
	|	ПроводкаDSS.System,
	|	ПроводкаDSS.Документ,
	|	ПроводкаDSS.Модуль,
	|	ПроводкаDSS.SourceCode,
	|	ПроводкаDSS.AccountLawson,
	|	ПроводкаDSS.AU,
	|	ПроводкаDSS.Location,
	|	ПроводкаDSS.BaseAmount,
	|	ПроводкаDSS.DateLawson,
	|	ПроводкаDSS.Reference,
	|	ПроводкаDSS.Description,
	|	ПроводкаDSS.TranAmount,
	|	ПроводкаDSS.Currency,
	|	ПроводкаDSS.GUID,
	|	ПроводкаDSS.PeriodLawson,
	|	ПроводкаDSS.Company,
	|	ПроводкаDSS.UpdateDateLawson,
	|	ПроводкаDSS.SeqTrnsNbrLawson,
	|	ПроводкаDSS.OrigCompanyLawson,
	|	ПроводкаDSS.Activity,
	|	ПроводкаDSS.JeTypeLawson,
	|	ПроводкаDSS.JournalLawson,
	|	ПроводкаDSS.LineNbrLawson,
	|	ПроводкаDSS.AutoRevLawson,
	|	ПроводкаDSS.Operator,
	|	ПроводкаDSS.LegalFiscalFlagLawson,
	|	ПроводкаDSS.Vendor,
	|	ПроводкаDSS.VendorVname,
	|	ПроводкаDSS.ApInvoice,
	|	ПроводкаDSS.TransNbr,
	|	ПроводкаDSS.OrigOperatorId,
	|	ПроводкаDSS.ProcessLevel,
	|	ПроводкаDSS.CashCode,
	|	ПроводкаDSS.PoNumber,
	|	ПроводкаDSS.LineNbrIc,
	|	ПроводкаDSS.PoCode,
	|	ПроводкаDSS.ItemDescription,
	|	ПроводкаDSS.CustomerNumber,
	|	ПроводкаDSS.CustomerName,
	|	ПроводкаDSS.ArInvoice,
	|	ПроводкаDSS.TaxCode,
	|	ПроводкаDSS.Item,
	|	ПроводкаDSS.DocumentNbr,
	|	ПроводкаDSS.ContractNumber,
	|	ПроводкаDSS.AktOfAcceptance,
	|	ПроводкаDSS.AktDateLawson,
	|	ПроводкаDSS.ApTransFormId,
	|	ПроводкаDSS.КонтрагентLawson,
	|	ПроводкаDSS.Deferred,
	|	ПроводкаDSS.Ответственный,
	|	ПроводкаDSS.Комментарий,
	|	ПроводкаDSS.RubAmount,
	|	ПроводкаDSS.FiscAmount,
	|	ПроводкаDSS.TempDiff,
	|	ПроводкаDSS.PermDiff,
	|	ПроводкаDSS.ExchDiff,
	|	ПроводкаDSS.ТипПроводки,
	|	ПроводкаDSS.Ваучер,
	|	ПроводкаDSS.FiscalDate,
	|	ПроводкаDSS.Urn,
	|	ПроводкаDSS.SubSubSegment,
	|	ПроводкаDSS.AccountingPeriod,
	|	ПроводкаDSS.AccountLawson.БазовыйЭлемент КАК HFMAccount,
	|	ПроводкаDSS.LegalEntity
	|ИЗ
	|	Документ.ПроводкаDSS КАК ПроводкаDSS
	|ГДЕ
	|	ПроводкаDSS.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	DSSСвязанныеДокументы.ТипСвязанногоОбъекта,
	|	DSSСвязанныеДокументы.СвязанныйОбъект КАК Ссылка
	|ИЗ
	|	РегистрСведений.DSSСвязанныеДокументы КАК DSSСвязанныеДокументы
	|ГДЕ
	|	DSSСвязанныеДокументы.ПроводкаDSS = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьСуммыДляПроводки(Реквизиты, СвязанныеДокументы, СчетВыручкиHFM, ВалютаUSD, Отказ)
	
	СуммыДляПроводки = Новый Структура("Amount,BaseAmount");
	
	Если НЕ Реквизиты.HFMAccount.ПринадлежитЭлементу(СчетВыручкиHFM) И
		Реквизиты.System = "AR" И
		(Реквизиты.SourceCode = "RL" ИЛИ Реквизиты.SourceCode = "RY") И
		 Реквизиты.AccountLawson = ПланыСчетов.Lawson.TradeReceivables Тогда

		ДокументРасчетов = ?(ЗначениеЗаполнено(СвязанныеДокументы.Invoice), СвязанныеДокументы.Invoice, СвязанныеДокументы.Memo);
		// { RGS TAlmazova 11.08.2016 16:41:21 - может не найти инвойс
		//ВалютаИнвойса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРасчетов, "Currency");
		Если НЕ ЗначениеЗаполнено(ДокументРасчетов) И Реквизиты.BaseAmount = 0 Тогда
			ДокументРасчетов = Документы.Invoice.ПустаяСсылка();
			ВалютаИнвойса = Реквизиты.Currency;
		Иначе
			ВалютаИнвойса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРасчетов, "Currency");
		КонецЕсли;
		// } RGS TAlmazova 11.08.2016 16:41:27 - может не найти инвойс
		//ВалютаРазнесенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПроведения.СвязанныеДокументы.BatchAllocation, "Currency");
		ВалютаРазнесенияПлатежа = Реквизиты.Currency;
		// { RGS TAlmazova 01.08.2017 17:59:47 - изменение алгоритма при различных валютах транзакции и инвойса
		Если ВалютаИнвойса = ВалютаUSD И ВалютаРазнесенияПлатежа <> ВалютаUSD Тогда

			СуммыДляПроводки.Amount = Реквизиты.BaseAmount;
			СуммыДляПроводки.BaseAmount = Реквизиты.BaseAmount;
			
		Иначе
			
			СуммыДляПроводки.Amount = Реквизиты.TranAmount;
			СуммыДляПроводки.BaseAmount = Реквизиты.BaseAmount;
			
		КонецЕсли;
		// } RGS TAlmazova 01.08.2017 18:00:17 - изменение алгоритма при различных валютах транзакции и инвойса
	Иначе
	
		СуммыДляПроводки.Amount = Реквизиты.TranAmount;
		СуммыДляПроводки.BaseAmount = Реквизиты.BaseAmount;

	КонецЕсли;

	Возврат СуммыДляПроводки;
	
КонецФункции
#КонецЕсли