#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьТаблицуФильтра(Source) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФильтрНезагружаемыхДанных.Company,
		|	ФильтрНезагружаемыхДанных.AU,
		|	ФильтрНезагружаемыхДанных.AR,
		|	ФильтрНезагружаемыхДанных.Revenue
		|ИЗ
		|	РегистрСведений.ФильтрНезагружаемыхДанных КАК ФильтрНезагружаемыхДанных
		|ГДЕ
		|	ФильтрНезагружаемыхДанных.Source = &Source";
	
	Запрос.УстановитьПараметр("Source", Source);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаФильтра = РезультатЗапроса.Выгрузить();
	//// { RGS TAlmazova 29.10.2017 15:59:02 - ДобавлениеПризнаков AR, Revenue
	//ТаблицаФильтра.Индексы.Добавить("Company, AU, AR, Revenue");
	//// } RGS TAlmazova 29.10.2017 15:59:23 - ДобавлениеПризнаков AR, Revenue
	ТаблицаФильтра.Индексы.Добавить("Company, AU");
	ТаблицаФильтра.Индексы.Добавить("AU");
	
	Возврат ТаблицаФильтра;
	
КонецФункции

Функция ЭтоНезагружаемыеДанные(ТаблицаФильтра, СтрокаДанных, Account) Экспорт
	
	Если ТаблицаФильтра.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоПроводкаПоСчетуВыручки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Account, "БазовыйЭлемент").ПринадлежитЭлементу(rgsНастройкаКонфигурации.ЗначениеНастройки("СчетВыручкиВерхнегоУровня"));
	
	СтруктураПоискаCompanyAU = Новый Структура("Company, AU");
	СтруктураПоискаCompanyAU.Company = СтрокаДанных.Company;
	СтруктураПоискаCompanyAU.AU = СтрокаДанных.AU;
	
	МассивФильтра = ТаблицаФильтра.НайтиСтроки(СтруктураПоискаCompanyAU);
	Если МассивФильтра.Количество() > 0 Тогда
		Если ЭтоПроводкаПоСчетуВыручки И МассивФильтра[0].Revenue ИЛИ НЕ ЭтоПроводкаПоСчетуВыручки И МассивФильтра[0].AR Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПоискаCompanyAU.Company = Справочники.Организации.ПустаяСсылка();
	МассивФильтра = ТаблицаФильтра.НайтиСтроки(СтруктураПоискаCompanyAU);
	Если МассивФильтра.Количество() > 0 Тогда
		Если ЭтоПроводкаПоСчетуВыручки И МассивФильтра[0].Revenue ИЛИ НЕ ЭтоПроводкаПоСчетуВыручки И МассивФильтра[0].AR Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПоискаCompanyAU.Company = СтрокаДанных.Company;
	СтруктураПоискаCompanyAU.AU = Справочники.КостЦентры.ПустаяСсылка();
	МассивФильтра = ТаблицаФильтра.НайтиСтроки(СтруктураПоискаCompanyAU);
	Если МассивФильтра.Количество() > 0 Тогда
		Если ЭтоПроводкаПоСчетуВыручки И МассивФильтра[0].Revenue ИЛИ НЕ ЭтоПроводкаПоСчетуВыручки И МассивФильтра[0].AR Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецЕсли
