#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	PenaltyCalculation.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.PenaltyCalculation КАК PenaltyCalculation
		|ГДЕ
		|	PenaltyCalculation.Дата = &Дата
		|	И НЕ PenaltyCalculation.ПометкаУдаления
		|	И PenaltyCalculation.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 И НЕ ПометкаУдаления Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("There is already a document in the selected period.");
	КонецЕсли;;
	
	Если ЭтоНовый() Тогда
		
		CreatedBy = Пользователи.ТекущийПользователь();
		CreationDate = ТекущаяДата();
		
	Иначе
		
		ModifiedBy = Пользователи.ТекущийПользователь();
		ModificationDate = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Penalties.Записывать = Истина;
	
	ТЗ_CalculationPenalty = CalculationPenalty.Выгрузить();
	ТЗ_CalculationBenefit = CalculationBenefit.Выгрузить();
	ТЗ_CalculationOnTime = CalculationOnTime.Выгрузить();
	
	Для Каждого СтрокаТЧ Из ТЗ_CalculationPenalty Цикл
		Если СтрокаТЧ.PenaltyAmount = 0 И СтрокаТЧ.PenaltyAmountUSD = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДвижения = Движения.Penalties.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТЧ);
		СтрокаДвижения.Период = Дата;
		СтрокаДвижения.PenaltyType = Перечисления.PenaltyTypes.Penalty;
		СтрокаДвижения.Amount = СтрокаТЧ.PenaltyAmount;
		СтрокаДвижения.USDAmount = СтрокаТЧ.PenaltyAmountUSD;
	КонецЦикла;

	Для Каждого СтрокаТЧ Из ТЗ_CalculationBenefit Цикл
		Если СтрокаТЧ.PenaltyAmount = 0 И СтрокаТЧ.PenaltyAmountUSD = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДвижения = Движения.Penalties.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТЧ);
		СтрокаДвижения.Период = Дата;
		СтрокаДвижения.PenaltyType = Перечисления.PenaltyTypes.Benefit;
		СтрокаДвижения.Amount = СтрокаТЧ.PenaltyAmount;
		СтрокаДвижения.USDAmount = СтрокаТЧ.PenaltyAmountUSD;
	КонецЦикла;

	Для Каждого СтрокаТЧ Из ТЗ_CalculationOnTime Цикл
//		Если СтрокаТЧ.PenaltyAmount = 0 И СтрокаТЧ.PenaltyAmountUSD = 0 Тогда
//			Продолжить;
//		КонецЕсли;
		СтрокаДвижения = Движения.Penalties.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТЧ);
		СтрокаДвижения.Период = Дата;
		СтрокаДвижения.PenaltyType = Перечисления.PenaltyTypes.OnTime;
		СтрокаДвижения.Amount = СтрокаТЧ.PenaltyAmount;
		СтрокаДвижения.USDAmount = СтрокаТЧ.PenaltyAmountUSD;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли