#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		
		CreatedBy = Пользователи.ТекущийПользователь();
		CreationDate = ТекущаяДата();
		
	Иначе
		
		ModifiedBy = Пользователи.ТекущийПользователь();
		ModificationDate = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Penalties.Записывать = Истина;
	
	ТЗ_Calculation = Calculation.Выгрузить();
	
	Для Каждого СтрокаТЧ Из ТЗ_Calculation Цикл
		Если СтрокаТЧ.PenaltyAmount = 0 И СтрокаТЧ.PenaltyAmountUSD = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДвижения = Движения.Penalties.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения, СтрокаТЧ);
		СтрокаДвижения.Период = Дата;
		СтрокаДвижения.Amount = СтрокаТЧ.PenaltyAmount;
		СтрокаДвижения.USDAmount = СтрокаТЧ.PenaltyAmountUSD;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли