#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЗаписьЕстьВРегистре(Реквизиты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыDIRИзГИС.Company КАК Company,
		|	ДатыDIRИзГИС.LegalEntity КАК LegalEntity
		|ИЗ
		|	РегистрСведений.ДатыDIRИзГИС КАК ДатыDIRИзГИС
		|ГДЕ
		|	ДатыDIRИзГИС.Company = &Company
		|	И (ДатыDIRИзГИС.LegalEntity = &LegalEntity
		|			ИЛИ ДатыDIRИзГИС.LegalEntity = ЗНАЧЕНИЕ(Справочник.LegalEntiites.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Company", Реквизиты.Company);
	Запрос.УстановитьПараметр("LegalEntity", Реквизиты.LegalEntity);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Результат = РезультатЗапроса.Выгрузить();
	
	Возврат  ТЗ_Результат.Количество() > 0
	
КонецФункции

#КонецЕсли
	