
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() И Source <> Перечисления.ТипыСоответствий.Lawson Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"Source, Company, Client, Location, SubSubSegment, AU, Account, Currency"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Source = Перечисления.ТипыСоответствий.Lawson Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.Source <> Source ИЛИ СтарыеЗначенияКлючей.Company <> Company
			ИЛИ СтарыеЗначенияКлючей.Client <> Client ИЛИ СтарыеЗначенияКлючей.Location <> Location
			ИЛИ СтарыеЗначенияКлючей.SubSubSegment <> SubSubSegment
			ИЛИ СтарыеЗначенияКлючей.AU <> AU ИЛИ СтарыеЗначенияКлючей.Account <> Account ИЛИ СтарыеЗначенияКлючей.Currency <> Currency Тогда
			
			НЗ = РегистрыСведений.КлючиBatchAllocation.СоздатьНаборЗаписей();
			НЗ.Отбор.Source.Установить(СтарыеЗначенияКлючей.Source);
			НЗ.Отбор.Company.Установить(СтарыеЗначенияКлючей.Company);
			НЗ.Отбор.Client.Установить(СтарыеЗначенияКлючей.Client);
			НЗ.Отбор.Location.Установить(СтарыеЗначенияКлючей.Location);
			НЗ.Отбор.SubSubSegment.Установить(СтарыеЗначенияКлючей.SubSubSegment);
			НЗ.Отбор.AU.Установить(СтарыеЗначенияКлючей.AU);
			НЗ.Отбор.Account.Установить(СтарыеЗначенияКлючей.Account);
			НЗ.Отбор.Currency.Установить(СтарыеЗначенияКлючей.Currency);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.Source.Установить(Source);
			НЗ.Отбор.Company.Установить(Company);
			НЗ.Отбор.Client.Установить(Client);
			НЗ.Отбор.Location.Установить(Location);
			НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
			НЗ.Отбор.AU.Установить(AU);
			НЗ.Отбор.Account.Установить(Account);
			НЗ.Отбор.Currency.Установить(Currency);
			ЗаписьНабора = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
			ЗаписьНабора.BatchAllocation = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиBatchAllocation.СоздатьНаборЗаписей();
		НЗ.Отбор.Source.Установить(Source);
		НЗ.Отбор.Company.Установить(Company);
		НЗ.Отбор.Client.Установить(Client);
		НЗ.Отбор.Location.Установить(Location);
		НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
		НЗ.Отбор.AU.Установить(AU);
		НЗ.Отбор.Account.Установить(Account);
		НЗ.Отбор.Currency.Установить(Currency);
		ЗаписьНабора = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
		ЗаписьНабора.BatchAllocation = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если Source = Перечисления.ТипыСоответствий.Lawson Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.КлючиBatchAllocation.СоздатьНаборЗаписей();
	НЗ.Отбор.Source.Установить(Source);
	НЗ.Отбор.Company.Установить(Company);
	НЗ.Отбор.Client.Установить(Client);
	НЗ.Отбор.Location.Установить(Location);
	НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
	НЗ.Отбор.AU.Установить(AU);
	НЗ.Отбор.Account.Установить(Account);
	НЗ.Отбор.Currency.Установить(Currency);
	НЗ.Записать(Истина);
	
КонецПроцедуры
