&НаСервере
Процедура ЗаполнитьСтатусInvoiceNotDue(ДатаОстатков = '00010101',ДатаКомментария = '00010101') Экспорт 
	
	Если ДатаОстатков = '00010101' Тогда
		ДатаОстатков = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если ДатаКомментария = '00010101' Тогда
		ДатаКомментария = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BilledARОстатки.Invoice КАК Invoice,
		|	BilledARОстатки.Invoice.Дата как InvoiceДата
		|ИЗ
		|	РегистрНакопления.BilledAR.Остатки(&Дата, ) КАК BilledARОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.InvoiceComments КАК InvoiceComments
		|		ПО BilledARОстатки.Invoice = InvoiceComments.Invoice
		|ГДЕ
		|	InvoiceComments.Invoice ЕСТЬ NULL 
		|	И BilledARОстатки.Invoice.DueDateTo > &Дата";
	
	Запрос.УстановитьПараметр("Дата", ДатаОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	User = ПараметрыСеанса.ТекущийПользователь;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НаборЗаписей = РегистрыСведений.InvoiceComments.СоздатьНаборЗаписей();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей.Очистить();
		НаборЗаписей.Отбор.Invoice.Установить(ВыборкаДетальныеЗаписи.Invoice);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Invoice = ВыборкаДетальныеЗаписи.Invoice;
		НоваяЗапись.Status = Перечисления.InvoiceStatus.InvoiceNotDue;
		НоваяЗапись.Период = ДатаКомментария;
		НоваяЗапись.User = User;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры
