
&НаКлиенте
Процедура Загрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаЗавершить", ЭтотОбъект);
	ОткрытьФорму("Справочник.crmContracts.Форма.ФормаЗагрузки",,ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаЗавершить(Результат, допПараметры) Экспорт
	
	Элементы.Список.Обновить();	
	
КонецПроцедуры

//-> RG-Soft VIvanov 2016/09/08
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
КонецПроцедуры
//<- RG-Soft VIvanov 2016/09/08