
Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.ArInvoice <> ArInvoice ИЛИ СтарыеЗначенияКлючей.Company <> Company Тогда
			
			НЗ = РегистрыСведений.КлючиSalesOrders.СоздатьНаборЗаписей();
			НЗ.Отбор.ArInvoice.Установить(СтарыеЗначенияКлючей.ArInvoice);
			НЗ.Отбор.Company.Установить(СтарыеЗначенияКлючей.Company);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.ArInvoice.Установить(ArInvoice);
			НЗ.Отбор.Company.Установить(Company);
			ЗаписьНабора = НЗ.Добавить();
			ЗаписьНабора.ArInvoice = ArInvoice;
			ЗаписьНабора.Company = Company;
			ЗаписьНабора.SalesOrder = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиSalesOrders.СоздатьНаборЗаписей();
		НЗ.Отбор.ArInvoice.Установить(ArInvoice);
		НЗ.Отбор.Company.Установить(Company);
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.ArInvoice = ArInvoice;
		ЗаписьНабора.Company = Company;
		ЗаписьНабора.SalesOrder = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ArInvoice, Company"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	НЗ = РегистрыСведений.КлючиSalesOrders.СоздатьНаборЗаписей();
	НЗ.Отбор.ArInvoice.Установить(ArInvoice);
	НЗ.Отбор.Company.Установить(Company);
	НЗ.Записать(Истина);
	
КонецПроцедуры
