
Процедура ПриЗаписи(Отказ)
	
	НЗ_КлючиНотификаций = РегистрыСведений.ИдентификаторыДляНотификацийSO.СоздатьНаборЗаписей();
	НЗ_КлючиНотификаций.Отбор.SalesOrder.Установить(Ссылка);
	
	ЗаписьКлючейНотификаций = НЗ_КлючиНотификаций.Добавить();
	ЗаписьКлючейНотификаций.Source = Source;
	ЗаписьКлючейНотификаций.SalesOrder = Ссылка;
	
	Если Source = Перечисления.ТипыСоответствий.Lawson Тогда
		ЗаписьКлючейНотификаций.Идентификатор1 = AU;
	ИначеЕсли Source = Перечисления.ТипыСоответствий.OracleMI Тогда
		ЗаписьКлючейНотификаций.Идентификатор1 = Location;
		ЗаписьКлючейНотификаций.Идентификатор2 = Client;
	ИначеЕсли Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
		ЗаписьКлючейНотификаций.Идентификатор1 = Location;
	ИначеЕсли Source = Перечисления.ТипыСоответствий.HOBs Тогда
		ЗаписьКлючейНотификаций.Идентификатор1 = Company;
		ЗаписьКлючейНотификаций.Идентификатор2 = CREW;
	КонецЕсли;
	
	НЗ_КлючиНотификаций.Записать();
	
	Если Source <> Перечисления.ТипыСоответствий.Lawson И Source <> Перечисления.ТипыСоответствий.Radius Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.ArInvoice <> ArInvoice ИЛИ СтарыеЗначенияКлючей.Company <> Company Тогда
			
			НЗ = РегистрыСведений.КлючиSalesOrders.СоздатьНаборЗаписей();
			НЗ.Отбор.ArInvoice.Установить(СтарыеЗначенияКлючей.ArInvoice);
			НЗ.Отбор.Company.Установить(СтарыеЗначенияКлючей.Company);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.ArInvoice.Установить(ArInvoice);
			НЗ.Отбор.Company.Установить(Company);
			ЗаписьНабора = НЗ.Добавить();
			ЗаписьНабора.ArInvoice = ArInvoice;
			ЗаписьНабора.Company = Company;
			ЗаписьНабора.SalesOrder = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиSalesOrders.СоздатьНаборЗаписей();
		НЗ.Отбор.ArInvoice.Установить(ArInvoice);
		НЗ.Отбор.Company.Установить(Company);
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.ArInvoice = ArInvoice;
		ЗаписьНабора.Company = Company;
		ЗаписьНабора.SalesOrder = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Source <> Перечисления.ТипыСоответствий.Lawson Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ArInvoice, Company"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если Source <> Перечисления.ТипыСоответствий.Lawson Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.КлючиSalesOrders.СоздатьНаборЗаписей();
	НЗ.Отбор.ArInvoice.Установить(ArInvoice);
	НЗ.Отбор.Company.Установить(Company);
	НЗ.Записать(Истина);
	
КонецПроцедуры
