#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьДанныеПоБиллингу(СтруктураПараметров, АдресХранилища) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура();
	
	ДанныеПоБиллингу = Новый Структура;
	ДанныеПоБиллингу.Вставить("LawsonBilling", РассчитатьLawsonBilling(СтруктураПараметров));
	ДанныеПоБиллингу.Вставить("HOBBilling", РассчитатьHOBBilling(СтруктураПараметров));
	
	ДанныеДляЗаполнения.Вставить("ДанныеПоБиллингу", ДанныеПоБиллингу);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

Функция РассчитатьLawsonBilling(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкаDSS.Ссылка КАК Ссылка,
		|	ПроводкаDSS.Company КАК Company,
		|	ПроводкаDSS.LegalEntity КАК LegalEntity,
		|	ПроводкаDSS.AU КАК AU,
		|	ПроводкаDSS.КонтрагентLawson КАК Client,
		|	ПроводкаDSS.Currency КАК Currency,
		|	ПроводкаDSS.TranAmount КАК Amount
		|ПОМЕСТИТЬ ВТ_ДанныеТранзакций
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|	ПроводкаDSS.Проведен
		|	И ПроводкаDSS.AccountingPeriod >= &НачалоПериода
		|	И ПроводкаDSS.AccountingPeriod <= &КонецПериода
		|	И (ПроводкаDSS.AccountLawson = &Счет120101
		|				И (ПроводкаDSS.System = ""AR""
		|						И ПроводкаDSS.SourceCode В (""SA"", ""DM"", ""CM"", ""RI"", ""RM"")
		|					ИЛИ ПроводкаDSS.System = ""BL""
		|						И ПроводкаDSS.SourceCode В (""SA"", ""DM"", ""CM"", ""RI"", ""RM""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120104
		|				И (ПроводкаDSS.System = ""AR""
		|						И ПроводкаDSS.SourceCode В (""RI"", ""RM"")
		|					ИЛИ ПроводкаDSS.System = ""BL""
		|						И (ПроводкаDSS.SourceCode В (""CM"", ""DM"")
		|							ИЛИ ПроводкаDSS.SourceCode = ""JE"")
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120201
		|				И (ПроводкаDSS.System = ""BL""
		|						И ПроводкаDSS.SourceCode = ""JE""
		|						И ПроводкаDSS.Description = ""A/R ACCRUAL""
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120205
		|				И (ПроводкаDSS.System = ""BL""
		|						И ПроводкаDSS.SourceCode = ""JE""
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120206
		|				И (ПроводкаDSS.System = ""AR""
		|						И ПроводкаDSS.SourceCode В (""RI"", ""RM"")
		|					ИЛИ ПроводкаDSS.System = ""BL""
		|						И (ПроводкаDSS.SourceCode В (""CM"", ""DM"")
		|							ИЛИ ПроводкаDSS.SourceCode = ""JE"")
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3"")))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроводкаDSS.Ссылка,
		|	ПроводкаDSS.Company,
		|	ПроводкаDSS.LegalEntity,
		|	ПроводкаDSS.AU,
		|	ПроводкаDSS.КонтрагентLawson,
		|	ПроводкаDSS.Currency,
		|	ПроводкаDSS.TranAmount
		|
		|ИМЕЮЩИЕ
		|	СУММА(ПроводкаDSS.TranAmount) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеТранзакций.Company КАК Company,
		|	ВТ_ДанныеТранзакций.LegalEntity КАК LegalEntity,
		|	ВТ_ДанныеТранзакций.AU КАК AU,
		|	ВТ_ДанныеТранзакций.Client КАК Client,
		|	ВТ_ДанныеТранзакций.Currency КАК Currency,
		|	СУММА(ВТ_ДанныеТранзакций.Amount) КАК Amount,
		|	СУММА(ВЫРАЗИТЬ(ВТ_ДанныеТранзакций.Amount / ЕСТЬNULL(ВнутренниеКурсыВалютСрезПоследних.Курс, 1) * ЕСТЬNULL(ВнутренниеКурсыВалютСрезПоследних.Кратность, 1) КАК ЧИСЛО(15, 2))) КАК USDAmount
		|ИЗ
		|	ВТ_ДанныеТранзакций КАК ВТ_ДанныеТранзакций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренниеКурсыВалют.СрезПоследних(
		|				ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1),
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДанныеТранзакций.Currency
		|					ИЗ
		|						ВТ_ДанныеТранзакций КАК ВТ_ДанныеТранзакций)) КАК ВнутренниеКурсыВалютСрезПоследних
		|		ПО ВТ_ДанныеТранзакций.Currency = ВнутренниеКурсыВалютСрезПоследних.Валюта
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеТранзакций.Company,
		|	ВТ_ДанныеТранзакций.LegalEntity,
		|	ВТ_ДанныеТранзакций.AU,
		|	ВТ_ДанныеТранзакций.Client,
		|	ВТ_ДанныеТранзакций.Currency";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(СтруктураПараметров.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураПараметров.Дата));
	Запрос.УстановитьПараметр("Счет120101", ПланыСчетов.Lawson.НайтиПоКоду("120101"));
	Запрос.УстановитьПараметр("Счет120104", ПланыСчетов.Lawson.НайтиПоКоду("120104"));
	Запрос.УстановитьПараметр("Счет120201", ПланыСчетов.Lawson.НайтиПоКоду("120201"));
	Запрос.УстановитьПараметр("Счет120205", ПланыСчетов.Lawson.НайтиПоКоду("120205"));
	Запрос.УстановитьПараметр("Счет120206", ПланыСчетов.Lawson.НайтиПоКоду("120206"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция РассчитатьHOBBilling(СтруктураПараметров)
	
КонецФункции

#КонецЕсли