#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПерезаполнитьРеквизитыInvoiceProblem(Проблема, СтруктураРеквизитовПроблемы) Экспорт
	
	ТекОбъект = Проблема.ПолучитьОбъект();
	ЗаполнитьРеквизитыПроблемы(ТекОбъект, СтруктураРеквизитовПроблемы);
	ТекОбъект.Записать();
	
КонецПроцедуры

Функция СоздатьInvoiceProblem(СтруктураРеквизитовПроблемы) Экспорт
	
	ТекОбъект = Документы.InvoiceProblem.СоздатьДокумент();
	ЗаполнитьРеквизитыПроблемы(ТекОбъект, СтруктураРеквизитовПроблемы);
	ТекОбъект.Записать();
	
	Возврат ТекОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьРеквизитыПроблемы(ПроблемаОбъект, СтруктураРеквизитовПроблемы)
	
	ЗаполнитьЗначенияСвойств(ПроблемаОбъект, СтруктураРеквизитовПроблемы);
	
	Если СтруктураРеквизитовПроблемы.SLBAssignedTo <> Неопределено Тогда
		Для каждого СтрокаТЧ Из СтруктураРеквизитовПроблемы.SLBAssignedTo Цикл
			ЗаполнитьЗначенияСвойств(ПроблемаОбъект.SLBAssignedTo.Добавить(), СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
