
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИменаКолонокВПервойСтроке = Параметры.ИменаКолонокВПервойСтроке;
	ПерваяСтрокаДанных = Параметры.ПерваяСтрокаДанных;
	ПоследняяСтрокаДанных = Параметры.ПоследняяСтрокаДанных;
	СтруктураКолонок.Загрузить(Параметры.СтруктураКолонок.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ИменаКолонокВПервойСтроке", ИменаКолонокВПервойСтроке);
	СтруктураВозврата.Вставить("ПерваяСтрокаДанных", ПерваяСтрокаДанных);
	СтруктураВозврата.Вставить("ПоследняяСтрокаДанных", ПоследняяСтрокаДанных);
	СтруктураВозврата.Вставить("СтруктураКолонок", СтруктураКолонок);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры
