
Функция ПолучитьУзелLogelco() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	rgsОбменДокументамиLogelcoERM.Ссылка
		|ИЗ
		|	ПланОбмена.rgsОбменДокументамиLogelcoERM КАК rgsОбменДокументамиLogelcoERM
		|ГДЕ
		|	НЕ rgsОбменДокументамиLogelcoERM.ЭтотУзел
		|	И НЕ rgsОбменДокументамиLogelcoERM.ПометкаУдаления
		|	И rgsОбменДокументамиLogelcoERM.Код = ""SL""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Функция ПолучитьУзелBilling() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	rgsОбменДокументамиLogelcoERM.Ссылка
		|ИЗ
		|	ПланОбмена.rgsОбменДокументамиLogelcoERM КАК rgsОбменДокументамиLogelcoERM
		|ГДЕ
		|	НЕ rgsОбменДокументамиLogelcoERM.ЭтотУзел
		|	И НЕ rgsОбменДокументамиLogelcoERM.ПометкаУдаления
		|	И rgsОбменДокументамиLogelcoERM.Код = ""BL""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Функция ДанныеОбмена() Экспорт
	
	ЗапросЭлементОбмена = Новый Запрос;
	ЗапросЭлементОбмена.Текст = "ВЫБРАТЬ
	|	ОбъектыОбмена.Ссылка
	|ИЗ
	|	РегистрСведений.ОбъектыОбмена КАК ОбъектыОбмена";
	Результат = ЗапросЭлементОбмена.Выполнить().Выгрузить();
	Возврат Результат
	
КонецФункции


