
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("РазрешитьРедактирование") Тогда
		Возврат;	
	КонецЕсли;
	
	Если Количество() = 0 И Замещение Тогда
		Прочитать();
		Отказ =  Количество() > 0;
	КонецЕсли;
	
	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		
		АвтоматическоеЗаполнениеСтатуса = Ложь;
		
		SourceInvoice = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьРегистра.Invoice,"Source");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсточникиСАвтоматичекимЗаполнениемСтатусов.Source
			|ИЗ
			|	РегистрСведений.ИсточникиСАвтоматичекимЗаполнениемСтатусов КАК ИсточникиСАвтоматичекимЗаполнениемСтатусов
			|ГДЕ
			|	ИсточникиСАвтоматичекимЗаполнениемСтатусов.Source.Ссылка = &Source";
		
		Запрос.УстановитьПараметр("Source", SourceInvoice);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
			АвтоматическоеЗаполнениеСтатуса = Истина
		КонецЕсли;
		
		Назначаемыйстатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьРегистра.Problem, "Status");
		
		Если АвтоматическоеЗаполнениеСтатуса И (НазначаемыйСтатус = Перечисления.InvoiceStatus.InvoicePaid ИЛИ Назначаемыйстатус = Перечисления.InvoiceStatus.InvoiceNotDue) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("For " + SourceInvoice +" source, the status " + НазначаемыйСтатус + " is filled automatically.",,,,Отказ);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
