
//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	
//	СтруктураРеквизитовПроблемы = Новый Структура("Дата, SalesOrder, User, Reason, Billed, ExpectedDateForInvoice, EscalateTo, Details, Responsibles");
//	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовПроблемы, ЭтотОбъект);
//	СтруктураРеквизитовПроблемы.Дата = ТекущийОбъект.Период;
//	СтруктураРеквизитовПроблемы.SalesOrder = ТекущийОбъект.SalesOrder;
//	
//	Если ЗначениеЗаполнено(ТекущийОбъект.Problem) Тогда
//		РегистрыСведений.SalesOrdersComments.ПерезаполнитьРеквизитыSalesOrderProblem(ТекущийОбъект.Problem, СтруктураРеквизитовПроблемы);
//	Иначе
//		ТекущийОбъект.Problem = РегистрыСведений.SalesOrdersComments.СоздатьSalesOrderProblem(СтруктураРеквизитовПроблемы);
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = РГСофт.ПолучитьДатуСервера();
	Если Не ЗначениеЗаполнено(User) Тогда
		User = Пользователи.ТекущийПользователь();
	КонецЕсли;

	СписокSalesOrders = Параметры.СписокSalesOrders;
	ДоступностьBilled = Истина;
	Для Индекс = 0 По СписокSalesOrders.Количество() - 1 Цикл
		Если СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.Lawson ИЛИ СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.OracleMI ИЛИ
			СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.OracleSmith ИЛИ СписокSalesOrders[Индекс].Значение.Source = Перечисления.ТипыСоответствий.HOBs И СписокSalesOrders[Индекс].Значение.Company = Справочники.Организации.НайтиПоКоду("385") Тогда
			ДоступностьBilled = Ложь;
		КонецЕсли;
	КонецЦикла;
	Элементы.Billed.Доступность = ДоступностьBilled;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура SaveНаСервере(СообщениеОбОшибке)
	
	НЗ = РегистрыСведений.SalesOrdersComments.СоздатьНаборЗаписей();
	НЗ.Отбор.Период.Установить(Период);
	
	СтатусBilledИзКомментария = Ложь;
	Если Billed = Перечисления.SalesOrderBilledStatus.ПустаяСсылка() Тогда
		СтатусBilledИзКомментария = Истина;
		//Запрос
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	SalesOrdersCommentsСрезПоследних.Problem.Billed КАК Billed,
			|	SalesOrdersCommentsСрезПоследних.SalesOrder
			|ИЗ
			|	РегистрСведений.SalesOrdersComments.СрезПоследних(, SalesOrder В (&СписокSalesOrders)) КАК SalesOrdersCommentsСрезПоследних";
		
		Запрос.УстановитьПараметр("СписокSalesOrders", СписокSalesOrders);
		
		НачатьТранзакцию();
		КэшBilled = Запрос.Выполнить().Выгрузить();
		КэшBilled.Индексы.Добавить("SalesOrder");
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	Для каждого ЭлементСписка Из СписокSalesOrders Цикл
		
		СтруктураРеквизитовПроблемы = Новый Структура("Дата, SalesOrder, User, Reason, Billed, ExpectedDateForInvoice, EscalateTo, Details, Responsibles");
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовПроблемы, ЭтотОбъект);
		
		СтруктураРеквизитовПроблемы.Дата = Период;
		СтруктураРеквизитовПроблемы.SalesOrder = ЭлементСписка.Значение;
		
		Если СтатусBilledИзКомментария Тогда
			НайденныйSalesOrder = КэшBilled.Найти(ЭлементСписка.Значение, "SalesOrder");
			Если НайденныйSalesOrder = Неопределено Тогда
				СообщениеОбОшибке = "For the selected Sales Order is not status";
				Прервать;
			Иначе
			СтруктураРеквизитовПроблемы.Billed = НайденныйSalesOrder.Billed;
			КонецЕсли;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Problem = РегистрыСведений.SalesOrdersComments.СоздатьSalesOrderProblem(СтруктураРеквизитовПроблемы);

		НЗ.Очистить();
		НЗ.Отбор.SalesOrder.Установить(ЭлементСписка.Значение);

		Запись = НЗ.Добавить();
		Запись.Период = Период;
		Запись.SalesOrder = ЭлементСписка.Значение;
		Запись.Problem = Problem;
		НЗ.Записать(Ложь);
		
		ЗафиксироватьТранзакцию();
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Save(Команда)
	СообщениеОбОшибке = "";
	SaveНаСервере(СообщениеОбОшибке);
	Закрыть();
	Если СообщениеОбОшибке <> "" Тогда
		Сообщить(СообщениеОбОшибке);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ResponsiblesПриИзменении(Элемент)
КонецПроцедуры






