
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Lawson.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Lawson КАК Lawson
		|ГДЕ
		|	Lawson.КодЧислом = &КодЧислом
		|	И Lawson.Ссылка <> &Ссылка
		|   И Lawson.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("КодЧислом", КодЧислом);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет с таким реквизитом КодЧислом " + КодЧислом + " уже существует.", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры
