
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|Lawson.Ссылка КАК Ссылка,
	|1 КАК Количество
	|	ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ПланСчетов.Lawson КАК Lawson
	|ГДЕ
	|Lawson.КодЧислом = &КодЧислом
	|И Lawson.ПометкаУдаления = ЛОЖЬ
	|	СГРУППИРОВАТЬ ПО
	|Lawson.Ссылка;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|СУММА(ВременнаяТаблица.Количество) КАК Количество
	|	ПОМЕСТИТЬ КоличествоЗаписей
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|КоличествоЗаписей.Количество КАК Количество
	|ИЗ
	|	КоличествоЗаписей КАК КоличествоЗаписей
	|ГДЕ
	|	КоличествоЗаписей.Количество > 0";	
	
	Запрос.УстановитьПараметр("КодЧислом", КодЧислом);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() И ЭтоНовый() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет с таким реквизитом КодЧислом " + КодЧислом + " уже существует.", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры
