
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Lawson.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Lawson КАК Lawson
		|ГДЕ
		|	Lawson.КодЧислом = &КодЧислом
		|   И Lawson.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("КодЧислом", КодЧислом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() <> 0 Тогда
		ВызватьИсключение "План счетов Lawson с таким реквизитом КодЧислом "+КодЧислом+" уже существует";
	КонецЕсли;
	
КонецПроцедуры
