
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() ИЛИ ОбменДанными.Загрузка Тогда
		
		ResponsiblesСтрокой = "";
		
		Если Responsibles.Количество() > 0 Тогда
			Для каждого СтрокаТЧ Из Responsibles Цикл
				ResponsiblesСтрокой = ResponsiblesСтрокой + СтрокаТЧ.Responsible + ", ";
			КонецЦикла;
			ResponsiblesСтрокой = Лев(ResponsiblesСтрокой, СтрДлина(ResponsiblesСтрокой) - 2);
		КонецЕсли;
		
		Если ResponsiblesList <> ResponsiblesСтрокой Тогда
			ResponsiblesList = ResponsiblesСтрокой;
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(EscalateTo) Тогда
		
		ДобавитьВОчередьУведомлений();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВОчередьУведомлений()
	
	НЗ = РегистрыСведений.ОчередьУведомлений.СоздатьНаборЗаписей();
	НЗ.Отбор.Проблема.Установить(Ссылка);
	
	ЗаписьРегистра = НЗ.Добавить();
	ЗаписьРегистра.Проблема = Ссылка;
	ЗаписьРегистра.ДатаУведомления = FollowUpDate;
	
	ТаблицаУровней = Справочники.EscalationLevels.ПолучитьВышестоящиеУровни(EscalateTo, Истина);
	
	Для каждого СтрокаУровня Из ТаблицаУровней Цикл
		
		ЗаписьРегистра = НЗ.Добавить();
		ЗаписьРегистра.Проблема = Ссылка;
		ЗаписьРегистра.Уровень = СтрокаУровня.Ссылка;
		ЗаписьРегистра.ДатаУведомления = FollowUpDate + СтрокаУровня.DaysFromTheStartingDate * 24 * 60 * 60;
		
	КонецЦикла;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры
