

&НаКлиенте
Процедура ReceiveEmails(Команда)
	ReceiveEmailsНаСервере();
КонецПроцедуры

&НаСервере
Процедура ReceiveEmailsНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИнтернетПочтовыйПрофиль = ImportExportСерверПовтИспСеанс.ПолучитьИнтернетПочтовыйПрофиль();
 	ИнтернетПочта = ImportExportСервер.ПодключитьсяКИнтернетПочте(ИнтернетПочтовыйПрофиль);
	
	ОписаниеОшибки = Неопределено;
	Попытка
		UnprocessedEmails = ImportExportСервер.ПолучитьUnprocessedEmails(ИнтернетПочта, ИнтернетПочтовыйПрофиль.ПользовательIMAP);
	Исключение
		ОписаниеОшибки = "Failed to get unprocessed emails:
			|" + ОписаниеОшибки();
	КонецПопытки;
	
	ИнтернетПочта.Отключиться();
	
	Если ОписаниеОшибки <> Неопределено Тогда
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Load(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

