
&НаКлиенте
Процедура ReceiveEmails(Команда)
	ReceiveEmailsНаСервере();
КонецПроцедуры

&НаСервере
Процедура ReceiveEmailsНаСервере()
	
	Unprocessed.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеУчетнойЗаписи = rgsУправлениеЭлектроннойПочтой.ПолучитьДанныеУчетнойЗаписи(rgsНастройкаКонфигурации.ЗначениеНастройки("УчетнаяЗаписьЭП_DisputeNotifications"));
	
	Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(ДанныеУчетнойЗаписи.Ссылка, Истина);
	Протокол = ПротоколИнтернетПочты.POP3;
	Если ДанныеУчетнойЗаписи.ПротоколВходящейПочты = "IMAP" Тогда
		Протокол = ПротоколИнтернетПочты.IMAP;
	КонецЕсли;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль, Протокол);
	Исключение
		
		ЕстьОшибки = Истина;
		
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Во время подключения к учетной записи %1 произошла ошибка
				|%2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				ДанныеУчетнойЗаписи.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(rgsУправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Ошибка, , ,
			                         ТекстСообщенияОбОшибке);
		
		Возврат;
		
	КонецПопытки;

	ПолученныеСообщения = Новый Массив;

	Если Протокол = ПротоколИнтернетПочты.POP3 Тогда
		ВызватьИсключение "Протокол POP3 не поддерживается"
	Иначе
		ФильтрПоЗаголовкам = Новый Соответствие;
		ПолученныеСообщения = rgsУправлениеЭлектроннойПочтой.ПолучитьПочтуПоПроколуIMAP(ДанныеУчетнойЗаписи, Почта, ФильтрПоЗаголовкам);
		//СинхронизироватьПризнакРассмотреноССервером(Почта, ДанныеУчетнойЗаписи, СтруктураМассивовСозданныхПисем.ВсеПолученныеПисьма);
	КонецЕсли;
	
	Почта.Отключиться();
	
	Если ТекстСообщенияОбОшибке <> Неопределено Тогда
		ВызватьИсключение ТекстСообщенияОбОшибке;	
	КонецЕсли;
	
	Для Каждого ПолученноеСообщение Из ПолученныеСообщения Цикл
		СтрокаТЗ = Unprocessed.Добавить();
		СтрокаТЗ.UID = ?(ПолученноеСообщение.Идентификатор.Количество() = 0, "", ПолученноеСообщение.Идентификатор[0]);
		СтрокаТЗ.SentDate = ПолученноеСообщение.ДатаОтправления;
		СтрокаТЗ.From = ПолученноеСообщение.Отправитель.Адрес;
		СтрокаТЗ.Subject = ПолученноеСообщение.Тема;
		СтруктураПисьма = Новый Структура("ТипТекста, Текст, ТекстHTML");
		УправлениеЭлектроннойПочтой.УстановитьТекстПисьма(СтруктураПисьма, ПолученноеСообщение);
		СтрокаТЗ.Body = СтруктураПисьма.Текст;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Load(Команда)

	ИДВыделенныхСтрок = Элементы.Unprocessed.ВыделенныеСтроки;
	Если НЕ ИДВыделенныхСтрок.Количество() Тогда
		Сообщить("Select at least one not processed e-mail!");
		Возврат;
	КонецЕсли;
	
	МассивUIDs = Новый Массив;
	Для Каждого ИДВыделеннойСтроки Из ИДВыделенныхСтрок Цикл
		
		СтрокаТЧ = Unprocessed.НайтиПоИдентификатору(ИДВыделеннойСтроки);
		МассивUIDs.Добавить(СтрокаТЧ.UID);
		
	КонецЦикла;

	ЗагрузитьНаСервере(МассивUIDs);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(МассивUIDs)
	
	УстановитьПривилегированныйРежим(Истина);

	ДанныеУчетнойЗаписи = rgsУправлениеЭлектроннойПочтой.ПолучитьДанныеУчетнойЗаписи(rgsНастройкаКонфигурации.ЗначениеНастройки("УчетнаяЗаписьЭП_DisputeNotifications"));

	Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(ДанныеУчетнойЗаписи.Ссылка, Истина);
	Протокол = ПротоколИнтернетПочты.POP3;
	Если ДанныеУчетнойЗаписи.ПротоколВходящейПочты = "IMAP" Тогда
		Протокол = ПротоколИнтернетПочты.IMAP;
	КонецЕсли;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль, Протокол);
	Исключение
		
		ЕстьОшибки = Истина;
		
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Во время подключения к учетной записи %1 произошла ошибка
				|%2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				ДанныеУчетнойЗаписи.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(rgsУправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Ошибка, , ,
			                         ТекстСообщенияОбОшибке);
		
		Возврат;
		
	КонецПопытки;
	
	ОписаниеОшибки = Неопределено;
	Попытка
		Письма = Почта.Выбрать(Ложь, МассивUIDs);
	Исключение
		ОписаниеОшибки = "Failed to load data from selected e-mails:
			|" + ОписаниеОшибки();
	КонецПопытки;
	
	Почта.Отключиться();
	
	Если ОписаниеОшибки <> Неопределено Тогда
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
	Обработки.PullDisputeNotificationEmails.ОбработатьПисьма(Письма, ДанныеУчетнойЗаписи);
	
КонецПроцедуры
