

&НаКлиенте
Процедура ReceiveEmails(Команда)
	ReceiveEmailsНаСервере();
КонецПроцедуры

&НаСервере
Процедура ReceiveEmailsНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеУчетнойЗаписи = rgsУправлениеЭлектроннойПочтой.ПолучитьДанныеУчетнойЗаписи(rgsНастройкаКонфигурации.ЗначениеНастройки("УчетнаяЗаписьЭП_DisputeNotifications"));
	
	Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(ДанныеУчетнойЗаписи.Ссылка, Истина);
	Протокол = ПротоколИнтернетПочты.POP3;
	Если ДанныеУчетнойЗаписи.ПротоколВходящейПочты = "IMAP" Тогда
		Протокол = ПротоколИнтернетПочты.IMAP;
	КонецЕсли;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль, Протокол);
	Исключение
		
		ЕстьОшибки = Истина;
		
		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Во время подключения к учетной записи %1 произошла ошибка
				|%2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				ДанныеУчетнойЗаписи.Ссылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(rgsУправлениеЭлектроннойПочтой.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Ошибка, , ,
			                         ТекстСообщенияОбОшибке);
		
		Возврат;
		
	КонецПопытки;
	
	Почта.Отключиться();
	
	Если ТекстСообщенияОбОшибке <> Неопределено Тогда
		ВызватьИсключение ТекстСообщенияОбОшибке;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Load(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

