
Процедура УстановитьЗначение(Реквизит, Значение) Экспорт

	// Процедура устанавливает новое значение для переданного реквизита.
	// Если новое значение совпадает со старым, то флаг модифицированности не взводится.
	//
	// Параметры
	//  Реквизит  – Произвольный – Реквизит, для которого надо установить новое значение
	//  Значение  – Произвольный – Новое значение для реквизита
	//
	
	Если Реквизит <> Значение Тогда
		Реквизит = Значение;
	КонецЕсли;

КонецПроцедуры // УстановитьЗначение(Реквизит, Значение)

Функция ФайлДоступенДляЗагрузки(Знач ПолноеИмя, ИмяЭлементаУправления = "") Экспорт
	
	ПолноеИмя = СокрЛП(ПолноеИмя);
	Если НЕ ЗначениеЗаполнено(ПолноеИмя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Выберите файл!",
			, ИмяЭлементаУправления);
		Возврат Ложь;
	КонецЕсли; 
	
	Файл = Новый Файл(ПолноеИмя);
	Если НЕ Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Файл """ + ПолноеИмя + """ не существует!",
			, ИмяЭлементаУправления);
		Возврат Ложь;
	КонецЕсли; 
	
	Если НЕ Файл.ЭтоФайл() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Файл """ + ПолноеИмя + """ не является файлом!",
			, ИмяЭлементаУправления);
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

Процедура СокрЛПКолонокВТаблице(Таблица, СтрокаИменКолонок) Экспорт
	
	МассивИменКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаИменКолонок);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Для Каждого ИмяКолонки Из МассивИменКолонок Цикл
			УстановитьЗначение(СтрокаТаблицы[ИмяКолонки], СокрЛП(СтрокаТаблицы[ИмяКолонки]));			 
		КонецЦикла; 			 
	КонецЦикла; 
	
КонецПроцедуры 
