
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() ИЛИ НЕ ResponsibleAR Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолучателиУведомленийUnbilled.Source КАК Source,
		|	ПолучателиУведомленийUnbilled.Идентификатор1 КАК Идентификатор1,
		|	ПолучателиУведомленийUnbilled.Идентификатор2
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|ГДЕ
		|	ПолучателиУведомленийUnbilled.Уровень = ЗНАЧЕНИЕ(Справочник.EscalationLevels.Level1)
		|	И ПолучателиУведомленийUnbilled.Получатель = &Получатель
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Source,
		|	Идентификатор1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ
		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО ПолучателиУведомленийUnbilled.Source = ВТ.Source
		|			И ПолучателиУведомленийUnbilled.Идентификатор1 = ВТ.Идентификатор1
		|			И ПолучателиУведомленийUnbilled.Идентификатор2 = ВТ.Идентификатор2
		|			И (ПолучателиУведомленийUnbilled.Уровень = ЗНАЧЕНИЕ(Справочник.EscalationLevels.Level1))
		|			И (ПолучателиУведомленийUnbilled.Получатель <> &Получатель
		|				И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR)";
	
	Запрос.УстановитьПараметр("Получатель", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("You can not specify more than one responsible in the Unbilled notification settings!", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры
