
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОтработкаКоллизии");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередЗаписьюНаСервере(КодЧислом, Отказ)
	СовпадениеLawson = ПланыСчетов.Lawson.НайтиПоРеквизиту("КодЧислом",КодЧислом);
	Если СовпадениеLawson <> ПланыСчетов.Lawson.ПустаяСсылка() Тогда
		Отказ = Истина;
		Сообщить("Счёт с таким же реквизитом КодЧислом "+Строка(КодЧислом)+" уже создан "+ОписаниеОшибки());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере(Объект.КодЧислом, Отказ);
КонецПроцедуры
