
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если ЗаписьНабора.ResponsibleAR И ЗаписьНабора.Уровень <> Справочники.EscalationLevels.Level1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Responsible AR is only available for Level 1", , , , Отказ);
		КонецЕсли;
		Если Не Отказ Тогда
			РегистрыСведений.ОчередьОбновленияSalesOrderResponsibles.Добавить(ЗаписьНабора.Source, ЗаписьНабора.Идентификатор1, ЗаписьНабора.Идентификатор2);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
