Функция ПредставлениеПустойГиперссылки() Экспорт

	Возврат НСтр("ru='Заполнить'");

КонецФункции

Процедура УстановитьПустоеПредставлениеАдреса(Форма) Экспорт
	
	Для Каждого Реквизит ИЗ Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		Если ПустаяСтрока(Форма[Реквизит.ИмяРеквизита]) Тогда
			Элемент = Форма.Элементы[Реквизит.ИмяРеквизита];
			Если Элемент.Вид = ВидПоляФормы.ПолеНадписи И Элемент.Гиперссылка Тогда
				Форма[Реквизит.ИмяРеквизита] = ПредставлениеПустойГиперссылки();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
