
#Область ТаможенныйСоюз

// Определяет, является ли страна мира государством-членом таможенного союза (ЕвразЭС)
// Параметры
// СтранаРегистрацииКонтрагента - Справочники.СтраныМира - страна мира
//
// Возвращаемое значение:
//  Булево - Истина, если переданная страна является государством-членом таможенного союза (ЕвразЭС)
//
Функция ГосударствоЧленТаможенногоСоюза(СтранаРегистрацииКонтрагента) Экспорт

	Если ЗначениеЗаполнено(СтранаРегистрацииКонтрагента)
		И ТипЗнч(СтранаРегистрацииКонтрагента) = Тип("СправочникСсылка.СтраныМира")
		И СтранаРегистрацииКонтрагента <> Справочники.СтраныМира.Россия Тогда
		
		СтраныТаможенногоСоюза = Новый Массив();
		СтраныТаможенногоСоюза.Добавить(Справочники.СтраныМира.НайтиПоКоду("112")); // Беларусь
		СтраныТаможенногоСоюза.Добавить(Справочники.СтраныМира.НайтиПоКоду("398")); // Казахстан
		СтраныТаможенногоСоюза.Добавить(Справочники.СтраныМира.НайтиПоКоду("051")); // Армения
		СтраныТаможенногоСоюза.Добавить(Справочники.СтраныМира.НайтиПоКоду("417")); // Киргизия
		
		Возврат СтраныТаможенногоСоюза.Найти(СтранаРегистрацииКонтрагента) <> Неопределено;
		
	Иначе
		
		Возврат Ложь;
	
	КонецЕсли;

КонецФункции

Функция КонтрагентРезидентТаможенногоСоюза(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		СтранаРегистрацииКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "СтранаРегистрации");
		Возврат ГосударствоЧленТаможенногоСоюза(СтранаРегистрацииКонтрагента);
			
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
