#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область PowerBI

// Описание
// Выполняет выгрузку данных в Power BI
// Параметры:
// 	Ссылка - Ссылка на данные, которые нужно выгрузить
// 	Операция - вид операции с данными
// Возвращаемое значение:
// 	Структура - включает поля Результат, Сообщение.
Функция ВыгрузитьДанныеДляPowerBI(Ссылка, Операция, ПараметрыЛогирования) Экспорт
	
	СтруктураРезультата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	ТекОбъект = PowerBIРегламенты.ПолучитьОбъектИзВнешнегоИсточника("dbo_AccountingUnits", Операция, Ссылка, ПараметрыЛогирования);
	
	ЗаполнитьОбъект(ТекОбъект, Ссылка);
	
	PowerBIРегламенты.ЗаписатьОбъектВоВнешнийИсточник(ТекОбъект, ПараметрыЛогирования, СтруктураРезультата);
	
	Если НЕ ЗначениеЗаполнено(СтруктураРезультата.Сообщение) Тогда
		СтруктураРезультата.Результат = Истина;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура ЗаполнитьОбъект(Объект, Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КостЦентры.Код,
		|	КостЦентры.Наименование,
		|	КостЦентры.ПометкаУдаления,
		|	ПРЕДСТАВЛЕНИЕ(КостЦентры.Source) КАК Source,
		|	КостЦентры.Сегмент.БазовыйЭлемент КАК SubSubSegment,
		|	КостЦентры.ПодразделениеОрганизации.БазовыйЭлемент.GeoMarket КАК SubGeomarket
		|ИЗ
		|	Справочник.КостЦентры КАК КостЦентры
		|ГДЕ
		|	КостЦентры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Объект.DeletionMark = ВыборкаДетальныеЗаписи.ПометкаУдаления;
	Объект.Description = ВыборкаДетальныеЗаписи.Наименование;
	Объект.Code = ВыборкаДетальныеЗаписи.Код;
	Объект.Source = ВыборкаДетальныеЗаписи.Source;
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.SubSubSegment) Тогда
		Объект.SubSubSegmentID = Строка(ВыборкаДетальныеЗаписи.SubSubSegment.УникальныйИдентификатор());
	Иначе
		Объект.SubSubSegmentID = NULL;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.SubGeomarket) Тогда
		Объект.SubGeomarketID = Строка(ВыборкаДетальныеЗаписи.SubGeomarket.УникальныйИдентификатор());
	Иначе
		Объект.SubGeomarketID = NULL;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли