
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ОпределитьСхемуКомпоновки("ОсновнаяСхемаКомпоновкиДанныхAR");
	ЗначениеВДанныеФормы(ОтчетОбъект, Отчет);
	//Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ОтчетОбъект.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	СхемаКД = ОтчетОбъект.СхемаКомпоновкиДанных;
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКД, УникальныйИдентификатор);
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	//Настройки = ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию();
	
	//Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
	
	Если Параметры.Отбор.Свойство("AccountHFM") Тогда
		
		Параметр = ОтчетыКлиентСервер.НайтиПараметр(Отчет.КомпоновщикНастроек.Настройки, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "AccountHFM");
		
		Если Параметр <> Неопределено Тогда
			Параметр.Использование = Истина;
			Параметр.Значение      = Параметры.Отбор.AccountHFM;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("НачалоПериода") Тогда
		
		Параметр = ОтчетыКлиентСервер.НайтиПараметр(Отчет.КомпоновщикНастроек.Настройки, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "НачалоПериода");
		
		Если Параметр <> Неопределено Тогда
			Параметр.Использование = Истина;
			Параметр.Значение      = Параметры.Отбор.НачалоПериода;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("КонецПериода") Тогда
		
		Параметр = ОтчетыКлиентСервер.НайтиПараметр(Отчет.КомпоновщикНастроек.Настройки, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "КонецПериода");
		
		Если Параметр <> Неопределено Тогда
			Параметр.Использование = Истина;
			Параметр.Значение      = Параметры.Отбор.КонецПериода;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ЛокацияHFM") Тогда
		
		Параметр = ОтчетыКлиентСервер.НайтиПараметр(Отчет.КомпоновщикНастроек.Настройки, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "ЛокацияHFM");
		
		Если Параметр <> Неопределено Тогда
			Параметр.Использование = Истина;
			Параметр.Значение      = Параметры.Отбор.ЛокацияHFM;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("СегментHFM") Тогда
		
		Параметр = ОтчетыКлиентСервер.НайтиПараметр(Отчет.КомпоновщикНастроек.Настройки, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "СегментHFM");
		
		Если Параметр <> Неопределено Тогда
			Параметр.Использование = Истина;
			Параметр.Значение      = Параметры.Отбор.СегментHFM;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
