////////////////////////////////////////////////////////////////////////////////
///ФУНКЦИИ, ПРОЦЕДУРЫ RGS ОБЩЕГО НАЗНАЧЕНИЯ
////////////////////////////////////////////////////////////////////////////////

Функция ЗначениеНастройки(Настройка, ВызыватьИсключение = Истина) Экспорт
	
	Возврат rgsНастройкаКонфигурацииПовтИсп.ПолучитьЗначениеНастройки(Настройка, ВызыватьИсключение);

КонецФункции

Процедура ЗначениеНастройкиУстановить(Настройка, Значение, ОбновлятьЗначения = Ложь) Экспорт
	
	Если ОбновлятьЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	УстановитьЗначениеНастройки(Настройка, Значение);
	
КонецПроцедуры

Процедура УстановитьЗначениеНастройки(ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ВызватьИсключение "УстановитьЗначениеНастройки(ИмяПараметра, ЗначениеПараметра) не активирована.";
	
КонецПроцедуры
