

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПроект = Параметры.Проект;
	
	Администратор = Параметры.Администратор;
	
	ЗакрыватьПриВыборе = Истина;

	ПолучитьНастройкиФормы();
	
	ОчиститьСписокВыбора();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДеревоЗначений = ЗначениеИзСтрокиВнутр(Параметры.ДеревоТемСтрокой);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "СписокТемСИерархией");
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиФормы()
	
	СтруктураНастроекФормы = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаФорм");
	Если СтруктураНастроекФормы <> Неопределено Тогда
		ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиФормы",,СтруктураНастроекФормы);
	КонецЕсли;
	
	СтруктураНастроекОкна = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "НастройкаОкна");
	Если СтруктураНастроекФормы <> Неопределено Тогда
		ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы + "/НастройкиОкна",,СтруктураНастроекОкна);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьСписокВыбора()
	
    Дерево = РеквизитФормыВЗначение("СписокТемСИерархией", Тип("ДеревоЗначений"));
	Дерево.Строки.Очистить();
	ЗначениеВРеквизитФормы(Дерево, "СписокТемСИерархией");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТемСИерархиейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		Закрыть();
		Оповестить("ОбработкаВыбора", Новый Структура("РезультатЗакрытия", Элемент.ТекущиеДанные.ТекстТемы), ЭтаФорма.ВладелецФормы);
	Иначе
		ОповеститьОВыборе(Элемент.ТекущиеДанные.ТекстТемы);
	КонецЕсли;
	
КонецПроцедуры 

