
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("ДанныеПроблем") Тогда
		
		ТаблицаДанныхПроблем = ДополнительныеСвойства.ДанныеПроблем;
		
		СтруктураПоиска = Новый Структура("Период, SalesOrder");
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ЗаписьНабора);
			СтрокаДанных = ТаблицаДанныхПроблем.НайтиСтроки(СтруктураПоиска);
			
			Если СтрокаДанных.Количество() > 0 Тогда
				
				СтруктураРеквизитовПроблемы = СтрокаДанных[0].СтруктураРеквизитов;
				
				Если ЗначениеЗаполнено(ЗаписьНабора.Problem) Тогда
					РегистрыСведений.SalesOrdersComments.ПерезаполнитьРеквизитыSalesOrderProblem(ЗаписьНабора.Problem, СтруктураРеквизитовПроблемы);
				Иначе
					ЗаписьНабора.Problem = РегистрыСведений.SalesOrdersComments.СоздатьSalesOrderProblem(СтруктураРеквизитовПроблемы);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Количество() = 0 И Замещение Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
