
Функция ПолучитьУзелBilling() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	rgsОбменКлиентамиЧерезУниверсальныйФормат.Ссылка
		|ИЗ
		|	ПланОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат КАК rgsОбменКлиентамиЧерезУниверсальныйФормат
		|ГДЕ
		|	НЕ rgsОбменКлиентамиЧерезУниверсальныйФормат.ЭтотУзел
		|	И НЕ rgsОбменКлиентамиЧерезУниверсальныйФормат.ПометкаУдаления
		|	И rgsОбменКлиентамиЧерезУниверсальныйФормат.Код = ""BL""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Функция ПолучитьУзлыПланаОбмена() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	rgsОбменКлиентамиЧерезУниверсальныйФормат.Ссылка
		|ИЗ
		|	ПланОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат КАК rgsОбменКлиентамиЧерезУниверсальныйФормат
		|ГДЕ
		|	НЕ rgsОбменКлиентамиЧерезУниверсальныйФормат.ЭтотУзел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивУзлов = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МассивУзлов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции