
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.ПроверятьСуществованиеФайла	= Истина;
	ДиалогОткрытияФайла.Заголовок = "Select a file to loading";
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ИмяФайлаНачалоВыбораЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ИмяФайла = ВыбранныеФайлы[0];
	КонецЕсли;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла), УникальныйИдентификатор);


КонецПроцедуры


&НаСервере
Процедура ПрочитатьФайлНаСервере()
	
	
	Если Объект.ИмяФайла = "" Тогда
		Сообщить("The file is not selected");
	ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.ПустаяСсылка() Тогда
		Сообщить("The Transaction Type is not selected");
	ИначеЕсли Период = Дата(1,1,1) Тогда
		Сообщить("Specify the period downloaded balances");
	Иначе
		
		ЗаполнитьСтруктуруФайлаПоУмолчанию();
		
		ТаблицаКоллизий.Очистить();
		
		ДанныеДляЗаполнения = Новый Структура();
		ТекстОшибки = "";
		
		ДД = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ИмяФайла = ПолучитьИмяВременногоФайла("csv");
		ДД.Записать(ИмяФайла);
		Разделитель = "\";
		Строки = СтрЗаменить(ИмяФайла, Разделитель, Символы.ПС);
		Путь = "";
		ТолькоИмяФайла = СтрПолучитьСтроку(Строки, СтрЧислоСтрок(Строки));
		Для Индекс = 1 По СтрЧислоСтрок(Строки)-1 Цикл
			Путь = Путь + СтрПолучитьСтроку(Строки, Индекс) + "\";
		КонецЦикла;
		ИмяКаталога = Лев(Путь, СтрДлина(Путь)-1);
		
		//ИмяКаталога = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор());
		//СоздатьКаталог(ИмяКаталога);
		
		ПутьСхемы = ИмяКаталога+"\schema.ini";
		ФайлСхемы = Новый ТекстовыйДокумент;
		//ФайлСхемы.ДобавитьСтроку("["+ ТолькоИмяФайла +"]" + Символы.ПС + "DecimalSymbol=.");
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		Если ТипТранзакций = Перечисления.HOBTransactionType.Accrual Тогда
			ФайлСхемы.УстановитьТекст("["+ ТолькоИмяФайла +"]" + Символы.ПС + ТекОбъект.ПолучитьМакет("AccrualsSchema").ПолучитьТекст());
		ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.JV Тогда
			ФайлСхемы.УстановитьТекст("["+ ТолькоИмяФайла +"]" + Символы.ПС + ТекОбъект.ПолучитьМакет("JVSchema").ПолучитьТекст());
		ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.Receivables Тогда
			ФайлСхемы.УстановитьТекст("["+ ТолькоИмяФайла +"]" + Символы.ПС + ТекОбъект.ПолучитьМакет("ReceivablesSchema").ПолучитьТекст());
		КонецЕсли;
		ФайлСхемы.Записать(ПутьСхемы, КодировкаТекста.OEM);
		

		Connection = Новый COMОбъект("ADODB.Connection");
		
		Попытка
			СтрокаПодключения = "Provider=Microsoft.ACE.OLEDB.12.0;Data Source=" + ИмяКаталога + ";Extended Properties=""text;HDR=NO;IMEX=1;""";
			Connection.Open(СтрокаПодключения);
		Исключение
			Попытка
				СтрокаПодключения = "Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + ИмяКаталога + ";Extended Properties=""text;HDR=NO;IMEX=1""";
				Connection.Open(СтрокаПодключения);
			Исключение
				ВызватьИсключение "Can't open connection! " + ОписаниеОшибки();
			КонецПопытки;		
		КонецПопытки;
		
		rs = Новый COMObject("ADODB.RecordSet");
		
		//Если ТипТранзакций = Перечисления.HOBTransactionType.Accrual Тогда
		//	Стр_SQL = "Select * FROM HOB_accruals.csv";
		//ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.JV Тогда
		//	Стр_SQL = "Select * FROM HOB_JV.csv";
		//ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.Receivables Тогда
		//	Стр_SQL = "Select * FROM HOB_receivables.csv";
		//КонецЕсли;
		//rs.Open(Стр_SQL, Connection);
		
		Стр_SQL = "Select * FROM " + ТолькоИмяФайла;
		rs.Open(Стр_SQL, Connection);
			
		СоответствиеКолонок = Новый Соответствие;
		Для каждого ЭлементСтруктурыКолонок Из СтруктураКолонок Цикл
			СоответствиеКолонок.Вставить(ЭлементСтруктурыКолонок.ИмяПоля, ЭлементСтруктурыКолонок.ИмяКолонки);
		КонецЦикла;
		
		ТаблицаДанных = ИнициализироватьТаблицуДанных(СтруктураКолонок);
		
		ТекНомерСтроки = 0;
		
		rs.MoveFirst();
		
		Пока rs.EOF() = 0 Цикл
			
			ТекНомерСтроки = ТекНомерСтроки + 1;
			
			СтрокаДанных = ТаблицаДанных.Добавить();
			СтрокаДанных.СтрокаФайла = ТекНомерСтроки;
			
			
			Для каждого ЭлементСоответствия Из СоответствиеКолонок Цикл
				
				Попытка
					ТекЗначение = rs.Fields(ЭлементСоответствия.Значение).Value;
				Исключение
					ДанныеДляЗаполнения.Вставить("ОшибкаЗаполнения", ОписаниеОшибки());
					ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресВХранилище);
					Возврат;
				КонецПопытки;
					
				Если ТипЗнч(ТекЗначение) = ТипЗнч("Строка") Тогда
					СтрокаДанных[ЭлементСоответствия.Ключ] = СокрЛП(ТекЗначение);
					Если ЭлементСоответствия.Значение = "AU" Тогда 
						Пока СтрДлина(СтрокаДанных[ЭлементСоответствия.Ключ])<7 Цикл
							СтрокаДанных[ЭлементСоответствия.Ключ] = "0" + СтрокаДанных[ЭлементСоответствия.Ключ];
						КонецЦикла;
					КонецЕсли;
				ИначеЕсли ТипЗнч(СтрокаДанных[ЭлементСоответствия.Ключ]) =  ТипЗнч("Строка")Тогда
					СтрокаДанных[ЭлементСоответствия.Ключ] = Формат(ТекЗначение, "ЧРГ=; ЧН=0; ЧГ=0");
				Иначе
					СтрокаДанных[ЭлементСоответствия.Ключ] = ТекЗначение;
				КонецЕсли;
				
			КонецЦикла;
			
			rs.MoveNext();
			
		КонецЦикла;
		
		rs.Close();
		Connection.Close();
		
		Результат = ВыполнитьПроверкуНастроекСинхронизации(ТаблицаДанных);
		
		Если Результат Тогда
			СформироватьПроводкиDSS(ТаблицаДанных);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ВыполнитьПроверкуНастроекСинхронизации(ТаблицаДанных)
	
	Если ТипТранзакций = Перечисления.HOBTransactionType.Accrual Тогда
		Результат = ВыполнитьПроверкуНастроекСинхронизацииAccruals(ТаблицаДанных);
	//ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.JV Тогда
	//	ВыполнитьПроверкуНастроекСинхронизацииJV(ТаблицаДанных);
	ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.Receivables Тогда
		Результат = ВыполнитьПроверкуНастроекСинхронизацииReceivables(ТаблицаДанных);
	Иначе
		Результат = Ложь;
		ВызватьИсключение "Unknown type of transactions!";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыполнитьПроверкуНастроекСинхронизацииReceivables(ТаблицаДанных)
	
	Результат = Ложь;
	//ПериодНач = НачалоМесяца(Период);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаИсходныхДанных.Account,
	|	ТаблицаИсходныхДанных.Client,
	|	ТаблицаИсходныхДанных.INN,
	|	ТаблицаИсходныхДанных.CompanyCode,
	|	ТаблицаИсходныхДанных.CompanyDesc,
	|	ТаблицаИсходныхДанных.Currency,
	|	ТаблицаИсходныхДанных.LocationCode,
	|	ТаблицаИсходныхДанных.LocationDesc,
	|	ТаблицаИсходныхДанных.Amount,
	|	ТаблицаИсходныхДанных.BaseAmount,
	|	ТаблицаИсходныхДанных.AU,
	|	ТаблицаИсходныхДанных.AUType,
	|	ТаблицаИсходныхДанных.SubSubSegment,
	|	ТаблицаИсходныхДанных.Invoice,
	|	ТаблицаИсходныхДанных.InvoiceDate,
	|	ТаблицаИсходныхДанных.InvoiceNumber,
	|	ТаблицаИсходныхДанных.InvoiceCurrency,
	|	ТаблицаИсходныхДанных.InvoiceAmount,
	|	ТаблицаИсходныхДанных.InvoiceBilled,
	//|	ТаблицаИсходныхДанных.InvoicePassedForApproval,
	//|	ТаблицаИсходныхДанных.InvoicePassedForPayment,
	//|	ТаблицаИсходныхДанных.InvoicePassedForApprovalDate,
	//|	ТаблицаИсходныхДанных.InvoicePassedForPaymentDate,
	//|	ТаблицаИсходныхДанных.ExpectedDateOfPayment,
	|	ТаблицаИсходныхДанных.InvoiceAgreementCode,
	|	ТаблицаИсходныхДанных.InvoiceAgreement,
	//|	ТаблицаИсходныхДанных.Reverse,
	//|	ТаблицаИсходныхДанных.DocumentID,
	|	ТаблицаИсходныхДанных.InvoiceID
	//|	ТаблицаИсходныхДанных.TrID
	|ПОМЕСТИТЬ врТЗТаблицаДанных
	|ИЗ
	|	&ВнешняяТаблицаДанных КАК ТаблицаИсходныхДанных
	|	"
	;
	Запрос.УстановитьПараметр("ВнешняяТаблицаДанных", ТаблицаДанных);
	Запрос.Выполнить();
	
	ДанныеДляЗаполнения = Новый Структура();
	
//	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ КАК КоллизияОтработана,
		|	""Specify the 1C object"" КАК Описание,
		|	&ТипВнешнейСистемы КАК ТипСоответствия,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency) КАК ТипОбъектаВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ОбъектПриемника,
		|	врТЗТаблицаДанных.Currency КАК Идентификатор
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
		|				&Период,
		|				ТипСоответствия = &ТипВнешнейСистемы
		|					И ТипОбъектаВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency)) КАК НастройкаСинхронизацииCurrency
		|		ПО врТЗТаблицаДанных.Currency = НастройкаСинхронизацииCurrency.Идентификатор
		|ГДЕ
		|	НастройкаСинхронизацииCurrency.ОбъектПриемника ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Specify the 1C object"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency),
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
		|	врТЗТаблицаДанных.InvoiceCurrency
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
		|				&Период,
		|				ТипСоответствия = &ТипВнешнейСистемы
		|					И ТипОбъектаВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency)) КАК НастройкаСинхронизацииCurrency
		|		ПО врТЗТаблицаДанных.InvoiceCurrency = НастройкаСинхронизацииCurrency.Идентификатор
		|ГДЕ
		|	НастройкаСинхронизацииCurrency.ОбъектПриемника ЕСТЬ NULL 
		|	И врТЗТаблицаДанных.InvoiceCurrency <> """"
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Failed to find Account"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Account),
		|	ЗНАЧЕНИЕ(ПланСчетов.Lawson.ПустаяСсылка),
		|	врТЗТаблицаДанных.Account
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Lawson КАК Lawson
		|		ПО (НЕ Lawson.ПометкаУдаления)
		|			И врТЗТаблицаДанных.Account = Lawson.Код
		|ГДЕ
		|	Lawson.Ссылка ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Failed to find Company"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Company),
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
		|	врТЗТаблицаДанных.CompanyCode
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (НЕ Организации.ПометкаУдаления)
		|			И (Организации.Source = &ТипВнешнейСистемы)
		|			И врТЗТаблицаДанных.CompanyCode = Организации.Код
		|ГДЕ
		|	Организации.Ссылка ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Failed to find Sub-Sub-Segment by AU"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Segment),
		|	ЗНАЧЕНИЕ(Справочник.Сегменты.ПустаяСсылка),
		|	КостЦентры.Код
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
		|		ПО (НЕ КостЦентры.ПометкаУдаления)
		|			И врТЗТаблицаДанных.AU = КостЦентры.Код
		|ГДЕ
		|	КостЦентры.Сегмент = ЗНАЧЕНИЕ(Справочник.Сегменты.ПустаяСсылка)
		|	И врТЗТаблицаДанных.AUType = ""Lawson""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Failed to find Sub-Sub-Segment by AU"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Segment),
		|	ЗНАЧЕНИЕ(Справочник.Сегменты.ПустаяСсылка),
		|	врТЗТаблицаДанных.AU
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сегменты КАК Сегменты
		|		ПО (НЕ Сегменты.ПометкаУдаления)
		|			И (ПОДСТРОКА(врТЗТаблицаДанных.AU, 8, 3) = Сегменты.Код)
		|			И (врТЗТаблицаДанных.AUType <> ""Lawson"")
		|			И (врТЗТаблицаДанных.AUType = ""Oracle MI""
		|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
		|				ИЛИ врТЗТаблицаДанных.AUType = ""Oracle SII""
		|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
		|ГДЕ
		|	врТЗТаблицаДанных.AUType <> ""Lawson""
		|	И Сегменты.Ссылка ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Failed to find Location by AU"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Location),
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		|	КостЦентры.Код
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
		|		ПО (НЕ КостЦентры.ПометкаУдаления)
		|			И врТЗТаблицаДанных.AU = КостЦентры.Код
		|ГДЕ
		|	КостЦентры.ПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	И врТЗТаблицаДанных.AUType = ""Lawson""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Failed to find Location by AU"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Location),
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		|	врТЗТаблицаДанных.AU
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО (НЕ ПодразделенияОрганизаций.ПометкаУдаления)
		|			И (ПОДСТРОКА(врТЗТаблицаДанных.AU, 1, 6) = ПодразделенияОрганизаций.Код)
		|			И (врТЗТаблицаДанных.AUType = ""Oracle MI""
		|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
		|				ИЛИ врТЗТаблицаДанных.AUType = ""Oracle SII""
		|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
		|ГДЕ
		|	врТЗТаблицаДанных.AUType <> ""Lawson""
		|	И ПодразделенияОрганизаций.Ссылка ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛОЖЬ,
		|	""Failed to find Accounting Unit"",
		|	&ТипВнешнейСистемы,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.AccountingUnit),
		|	ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка),
		|	врТЗТаблицаДанных.AU
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
		|		ПО (НЕ КостЦентры.ПометкаУдаления)
		|			И врТЗТаблицаДанных.AU = КостЦентры.Код
		|			И (врТЗТаблицаДанных.AUType = ""Lawson"")
		|ГДЕ
		|	КостЦентры.Ссылка ЕСТЬ NULL 
		|	И врТЗТаблицаДанных.AUType = ""Lawson""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КостЦентры.Сегмент КАК Ссылка,
		|	ЕСТЬNULL(HFM_Technology.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)) КАК БазовыйЭлемент,
		|	КостЦентры.Сегмент.Код КАК Код
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Technology КАК HFM_Technology
		|			ПО КостЦентры.Сегмент.Код = HFM_Technology.Код
		|				И (НЕ HFM_Technology.ПометкаУдаления)
		|		ПО (НЕ КостЦентры.ПометкаУдаления)
		|			И врТЗТаблицаДанных.AU = КостЦентры.Код
		|ГДЕ
		|	КостЦентры.Сегмент.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)
		|	И врТЗТаблицаДанных.AUType = ""Lawson""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сегменты.Ссылка,
		|	ЕСТЬNULL(HFM_Technology.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)),
		|	Сегменты.Код
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сегменты КАК Сегменты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Technology КАК HFM_Technology
		|			ПО (НЕ HFM_Technology.ПометкаУдаления)
		|				И Сегменты.Код = HFM_Technology.Код
		|		ПО (НЕ Сегменты.ПометкаУдаления)
		|			И (ПОДСТРОКА(врТЗТаблицаДанных.AU, 8, 3) = Сегменты.Код)
		|			И (врТЗТаблицаДанных.AUType = ""Oracle MI""
		|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
		|				ИЛИ врТЗТаблицаДанных.AUType = ""Oracle SII""
		|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
		|ГДЕ
		|	врТЗТаблицаДанных.AUType <> ""Lawson""
		|	И Сегменты.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КостЦентры.ПодразделениеОрганизации.Ссылка КАК Ссылка,
		|	КостЦентры.ПодразделениеОрганизации.Код КАК Код,
		|	ЕСТЬNULL(HFM_Locations.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка)) КАК LocationПоSubGeomarket
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Locations КАК HFM_Locations
		|			ПО КостЦентры.ПодразделениеОрганизации.GeoMarket.Код = HFM_Locations.Код
		|				И (НЕ HFM_Locations.ПометкаУдаления)
		|		ПО (НЕ КостЦентры.ПометкаУдаления)
		|			И врТЗТаблицаДанных.AU = КостЦентры.Код
		|ГДЕ
		|	КостЦентры.ПодразделениеОрганизации.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка)
		|	И врТЗТаблицаДанных.AUType = ""Lawson""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияОрганизаций.Ссылка,
		|	ПодразделенияОрганизаций.Код,
		|	ЕСТЬNULL(HFM_Locations.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка))
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Locations КАК HFM_Locations
		|			ПО (НЕ HFM_Locations.ПометкаУдаления)
		|				И ПодразделенияОрганизаций.Код = HFM_Locations.Код
		|		ПО (НЕ ПодразделенияОрганизаций.ПометкаУдаления)
		|			И (ПОДСТРОКА(врТЗТаблицаДанных.AU, 1, 6) = ПодразделенияОрганизаций.Код)
		|			И (врТЗТаблицаДанных.AUType = ""Oracle MI""
		|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
		|				ИЛИ врТЗТаблицаДанных.AUType = ""Oracle SII""
		|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
		|ГДЕ
		|	врТЗТаблицаДанных.AUType <> ""Lawson""
		|	И ПодразделенияОрганизаций.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Lawson.Ссылка,
		|	Lawson.Код
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Lawson КАК Lawson
		|		ПО (НЕ Lawson.ПометкаУдаления)
		|			И врТЗТаблицаДанных.Account = Lawson.Код
		|ГДЕ
		|	Lawson.БазовыйЭлемент = ЗНАЧЕНИЕ(ПланСчетов.HFM_GL_Accounts.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Организации.Ссылка,
		|	Организации.Код
		|ИЗ
		|	врТЗТаблицаДанных КАК врТЗТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (НЕ Организации.ПометкаУдаления)
		|			И (Организации.Source = &ТипВнешнейСистемы)
		|			И врТЗТаблицаДанных.CompanyCode = Организации.Код
		|ГДЕ
		|	Организации.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Companies.ПустаяСсылка)";
	
	//Запрос.УстановитьПараметр("ДокументЗагрузки", СтруктураПараметров.Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Перечисления.ТипыСоответствий.HOBs);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаКоллизий1 = МассивРезультатов[0].Выгрузить();
	
	ВыборкаСегментов = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаСегментов.Следующий() Цикл
		
		Если ВыборкаСегментов.БазовыйЭлемент.Пустая() Тогда
			
			СтрокаКоллизии = ТаблицаКоллизий1.Добавить();
			СтрокаКоллизии.КоллизияОтработана = Ложь;
			СтрокаКоллизии.Описание = "Not specified base element";
			СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
			СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Segment;
			СтрокаКоллизии.ОбъектПриемника = ВыборкаСегментов.Ссылка;
			СтрокаКоллизии.Идентификатор = ВыборкаСегментов.Код;
			
		Иначе
			
			ТекОбъект = ВыборкаСегментов.Ссылка.ПолучитьОбъект();
			ТекОбъект.БазовыйЭлемент = ВыборкаСегментов.БазовыйЭлемент;
			ТекОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	// локации
	ВыборкаЛокаций = МассивРезультатов[2].Выбрать();
	
	Пока ВыборкаЛокаций.Следующий() Цикл
		
		Если НЕ ВыборкаЛокаций.LocationПоSubGeomarket.Пустая() Тогда
			
			ТекОбъект = ВыборкаЛокаций.Ссылка.ПолучитьОбъект();
			ТекОбъект.БазовыйЭлемент = ВыборкаЛокаций.LocationПоSubGeomarket;
			ТекОбъект.Записать();
			
		Иначе
			
			СтрокаКоллизии = ТаблицаКоллизий1.Добавить();
			СтрокаКоллизии.КоллизияОтработана = Ложь;
			СтрокаКоллизии.Описание = "Not specified base element";
			СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
			СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Location;
			СтрокаКоллизии.ОбъектПриемника = ВыборкаЛокаций.Ссылка;
			СтрокаКоллизии.Идентификатор = ВыборкаЛокаций.Код;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// счета
	ВыборкаСчетов = МассивРезультатов[3].Выбрать();
	
	Пока ВыборкаСчетов.Следующий() Цикл
		
		СтрокаКоллизии = ТаблицаКоллизий1.Добавить();
		СтрокаКоллизии.КоллизияОтработана = Ложь;
		СтрокаКоллизии.Описание = "Not specified base element";
		СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
		СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Account;
		СтрокаКоллизии.ОбъектПриемника = ВыборкаСчетов.Ссылка;
		СтрокаКоллизии.Идентификатор = ВыборкаСчетов.Код;
		
	КонецЦикла;
	
	// организации
	ВыборкаКомпаний = МассивРезультатов[4].Выбрать();
	
	Пока ВыборкаКомпаний.Следующий() Цикл
		
		СтрокаКоллизии = ТаблицаКоллизий1.Добавить();
		СтрокаКоллизии.КоллизияОтработана = Ложь;
		СтрокаКоллизии.Описание = "Not specified base element";
		СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
		СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Company;
		СтрокаКоллизии.ОбъектПриемника = ВыборкаКомпаний.Ссылка;
		СтрокаКоллизии.Идентификатор = ВыборкаКомпаний.Код;
		
	КонецЦикла;
	
	ДанныеДляЗаполнения.Вставить("ТаблицаКоллизий1", ТаблицаКоллизий1);
	ТаблицаКоллизий.Загрузить(ТаблицаКоллизий1);
	
	Если ТаблицаКоллизий.Количество() = 0 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыполнитьПроверкуНастроекСинхронизацииAccruals(ТаблицаДанных)
	
	Результат = Ложь;
	//ДанныеДляЗаполнения = Новый Структура();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	HOBAccrualsSourceData.TrDate,
	//	|	HOBAccrualsSourceData.TrNumber,
	//	|	HOBAccrualsSourceData.Document,
	//	|	HOBAccrualsSourceData.DocumentType,
	//	|	HOBAccrualsSourceData.Account,
	//	|	HOBAccrualsSourceData.Client,
	//	|	HOBAccrualsSourceData.INN,
	//	|	HOBAccrualsSourceData.SalesOrderAgreementCode,
	//	|	HOBAccrualsSourceData.SalesOrderAgreement,
	//	|	HOBAccrualsSourceData.SalesOrder,
	//	|	HOBAccrualsSourceData.SalesOrderNumber,
	//	|	HOBAccrualsSourceData.CompanyCode,
	//	|	HOBAccrualsSourceData.CompanyDesc,
	//	|	HOBAccrualsSourceData.Currency,
	//	|	HOBAccrualsSourceData.LocationCode,
	//	|	HOBAccrualsSourceData.LocationDesc,
	//	|	HOBAccrualsSourceData.Amount,
	//	|	HOBAccrualsSourceData.BaseAmount,
	//	|	HOBAccrualsSourceData.JobEndDate,
	//	|	HOBAccrualsSourceData.SalesOrderAmount,
	//	|	HOBAccrualsSourceData.ERPStatus,
	//	|	HOBAccrualsSourceData.SalesOrderCurrency,
	//	|	HOBAccrualsSourceData.SalesOrderExchangeRate,
	//	|	HOBAccrualsSourceData.SalesOrderApprovalDate,
	//	|	HOBAccrualsSourceData.SalesOrderApprovedBy,
	//	|	HOBAccrualsSourceData.AU,
	//	|	HOBAccrualsSourceData.AUType,
	//	|	HOBAccrualsSourceData.SubSubSegment,
	//	|	HOBAccrualsSourceData.SalesOrderDate,
	//	|	HOBAccrualsSourceData.Invoice,
	//	|	HOBAccrualsSourceData.InvoiceDate,
	//	|	HOBAccrualsSourceData.InvoiceNumber,
	//	|	HOBAccrualsSourceData.InvoiceCurrency,
	//	|	HOBAccrualsSourceData.InvoiceAmount,
	//	|	HOBAccrualsSourceData.InvoiceBilled,
	//	|	HOBAccrualsSourceData.InvoicePassedForApproval,
	//	|	HOBAccrualsSourceData.InvoicePassedForPayment,
	//	|	HOBAccrualsSourceData.InvoicePassedForApprovalDate,
	//	|	HOBAccrualsSourceData.InvoicePassedForPaymentDate,
	//	|	HOBAccrualsSourceData.ExpectedDateOfPayment,
	//	|	HOBAccrualsSourceData.InvoiceAgreementCode,
	//	|	HOBAccrualsSourceData.InvoiceAgreement,
	//	|	HOBAccrualsSourceData.Reverse,
	//	|	HOBAccrualsSourceData.DocumentID,
	//	|	HOBAccrualsSourceData.SalesOrderID,
	//	|	HOBAccrualsSourceData.InvoiceID,
	//	|	HOBAccrualsSourceData.TrID
	//	|ПОМЕСТИТЬ ВТ_HOBAccrualsSourceData
	//	|ИЗ
	//	|	РегистрСведений.HOBAccrualsSourceData КАК HOBAccrualsSourceData
	//	|ГДЕ
	//	|	HOBAccrualsSourceData.ДокументЗагрузки = &ДокументЗагрузки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ КАК КоллизияОтработана,
	//	|	""Specify the 1C object"" КАК Описание,
	//	|	&ТипВнешнейСистемы КАК ТипСоответствия,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency) КАК ТипОбъектаВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ОбъектПриемника,
	//	|	ВТ_HOBAccrualsSourceData.Currency КАК Идентификатор
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
	//	|				&Период,
	//	|				ТипСоответствия = &ТипВнешнейСистемы
	//	|					И ТипОбъектаВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency)) КАК НастройкаСинхронизацииCurrency
	//	|		ПО ВТ_HOBAccrualsSourceData.Currency = НастройкаСинхронизацииCurrency.Идентификатор
	//	|ГДЕ
	//	|	НастройкаСинхронизацииCurrency.ОбъектПриемника ЕСТЬ NULL 
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Specify the 1C object"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency),
	//	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	//	|	ВТ_HOBAccrualsSourceData.SalesOrderCurrency
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
	//	|				&Период,
	//	|				ТипСоответствия = &ТипВнешнейСистемы
	//	|					И ТипОбъектаВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency)) КАК НастройкаСинхронизацииCurrency
	//	|		ПО ВТ_HOBAccrualsSourceData.SalesOrderCurrency = НастройкаСинхронизацииCurrency.Идентификатор
	//	|ГДЕ
	//	|	НастройкаСинхронизацииCurrency.ОбъектПриемника ЕСТЬ NULL 
	//	|	И ВТ_HOBAccrualsSourceData.SalesOrderCurrency <> """"
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Specify the 1C object"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency),
	//	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	//	|	ВТ_HOBAccrualsSourceData.InvoiceCurrency
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
	//	|				&Период,
	//	|				ТипСоответствия = &ТипВнешнейСистемы
	//	|					И ТипОбъектаВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency)) КАК НастройкаСинхронизацииCurrency
	//	|		ПО ВТ_HOBAccrualsSourceData.InvoiceCurrency = НастройкаСинхронизацииCurrency.Идентификатор
	//	|ГДЕ
	//	|	НастройкаСинхронизацииCurrency.ОбъектПриемника ЕСТЬ NULL 
	//	|	И ВТ_HOBAccrualsSourceData.InvoiceCurrency <> """"
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Failed to find Account"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Account),
	//	|	ЗНАЧЕНИЕ(ПланСчетов.Lawson.ПустаяСсылка),
	//	|	ВТ_HOBAccrualsSourceData.Account
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Lawson КАК Lawson
	//	|		ПО (НЕ Lawson.ПометкаУдаления)
	//	|			И ВТ_HOBAccrualsSourceData.Account = Lawson.Код
	//	|ГДЕ
	//	|	Lawson.Ссылка ЕСТЬ NULL 
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Failed to find Company"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Company),
	//	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	//	|	ВТ_HOBAccrualsSourceData.CompanyCode
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	//	|		ПО (НЕ Организации.ПометкаУдаления)
	//	|			И (Организации.Source = &ТипВнешнейСистемы)
	//	|			И ВТ_HOBAccrualsSourceData.CompanyCode = Организации.Код
	//	|ГДЕ
	//	|	Организации.Ссылка ЕСТЬ NULL 
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Failed to find Sub-Sub-Segment by AU"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Segment),
	//	|	ЗНАЧЕНИЕ(Справочник.Сегменты.ПустаяСсылка),
	//	|	КостЦентры.Код
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
	//	|		ПО (НЕ КостЦентры.ПометкаУдаления)
	//	|			И ВТ_HOBAccrualsSourceData.AU = КостЦентры.Код
	//	|ГДЕ
	//	|	КостЦентры.Сегмент = ЗНАЧЕНИЕ(Справочник.Сегменты.ПустаяСсылка)
	//	|	И ВТ_HOBAccrualsSourceData.AUType = ""Lawson""
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Failed to find Sub-Sub-Segment by AU"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Segment),
	//	|	ЗНАЧЕНИЕ(Справочник.Сегменты.ПустаяСсылка),
	//	|	ВТ_HOBAccrualsSourceData.AU
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сегменты КАК Сегменты
	//	|		ПО (НЕ Сегменты.ПометкаУдаления)
	//	|			И (ПОДСТРОКА(ВТ_HOBAccrualsSourceData.AU, 8, 3) = Сегменты.Код)
	//	|			И (ВТ_HOBAccrualsSourceData.AUType <> ""Lawson"")
	//	|			И (ВТ_HOBAccrualsSourceData.AUType = ""Oracle MI""
	//	|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
	//	|				ИЛИ ВТ_HOBAccrualsSourceData.AUType = ""Oracle SII""
	//	|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
	//	|ГДЕ
	//	|	ВТ_HOBAccrualsSourceData.AUType <> ""Lawson""
	//	|	И Сегменты.Ссылка ЕСТЬ NULL 
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Failed to find Location by AU"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Location),
	//	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
	//	|	КостЦентры.Код
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
	//	|		ПО (НЕ КостЦентры.ПометкаУдаления)
	//	|			И ВТ_HOBAccrualsSourceData.AU = КостЦентры.Код
	//	|ГДЕ
	//	|	КостЦентры.ПодразделениеОрганизации = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//	|	И ВТ_HOBAccrualsSourceData.AUType = ""Lawson""
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Failed to find Location by AU"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Location),
	//	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
	//	|	ВТ_HOBAccrualsSourceData.AU
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	//	|		ПО (НЕ ПодразделенияОрганизаций.ПометкаУдаления)
	//	|			И (ПОДСТРОКА(ВТ_HOBAccrualsSourceData.AU, 1, 6) = ПодразделенияОрганизаций.Код)
	//	|			И (ВТ_HOBAccrualsSourceData.AUType = ""Oracle MI""
	//	|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
	//	|				ИЛИ ВТ_HOBAccrualsSourceData.AUType = ""Oracle SII""
	//	|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
	//	|ГДЕ
	//	|	ВТ_HOBAccrualsSourceData.AUType <> ""Lawson""
	//	|	И ПодразделенияОрганизаций.Ссылка ЕСТЬ NULL 
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ЛОЖЬ,
	//	|	""Failed to find Accounting Unit"",
	//	|	&ТипВнешнейСистемы,
	//	|	ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.AccountingUnit),
	//	|	ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка),
	//	|	ВТ_HOBAccrualsSourceData.AU
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
	//	|		ПО (НЕ КостЦентры.ПометкаУдаления)
	//	|			И ВТ_HOBAccrualsSourceData.AU = КостЦентры.Код
	//	|ГДЕ
	//	|	КостЦентры.Ссылка ЕСТЬ NULL 
	//	|	И ВТ_HOBAccrualsSourceData.AUType = ""Lawson""
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	КостЦентры.Сегмент КАК Ссылка,
	//	|	ЕСТЬNULL(HFM_Technology.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)) КАК БазовыйЭлемент,
	//	|	КостЦентры.Сегмент.Код КАК Код
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Technology КАК HFM_Technology
	//	|			ПО КостЦентры.Сегмент.Код = HFM_Technology.Код
	//	|				И (НЕ HFM_Technology.ПометкаУдаления)
	//	|		ПО (НЕ КостЦентры.ПометкаУдаления)
	//	|			И ВТ_HOBAccrualsSourceData.AU = КостЦентры.Код
	//	|ГДЕ
	//	|	КостЦентры.Сегмент.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)
	//	|	И ВТ_HOBAccrualsSourceData.AUType = ""Lawson""
	//	|
	//	|ОБЪЕДИНИТЬ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	Сегменты.Ссылка,
	//	|	ЕСТЬNULL(HFM_Technology.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)),
	//	|	Сегменты.Код
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сегменты КАК Сегменты
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Technology КАК HFM_Technology
	//	|			ПО (НЕ HFM_Technology.ПометкаУдаления)
	//	|				И Сегменты.Код = HFM_Technology.Код
	//	|		ПО (НЕ Сегменты.ПометкаУдаления)
	//	|			И (ПОДСТРОКА(ВТ_HOBAccrualsSourceData.AU, 8, 3) = Сегменты.Код)
	//	|			И (ВТ_HOBAccrualsSourceData.AUType = ""Oracle MI""
	//	|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
	//	|				ИЛИ ВТ_HOBAccrualsSourceData.AUType = ""Oracle SII""
	//	|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
	//	|ГДЕ
	//	|	ВТ_HOBAccrualsSourceData.AUType <> ""Lawson""
	//	|	И Сегменты.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Technology.ПустаяСсылка)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	КостЦентры.ПодразделениеОрганизации.Ссылка КАК Ссылка,
	//	|	КостЦентры.ПодразделениеОрганизации.Код КАК Код,
	//	|	ЕСТЬNULL(HFM_Locations.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка)) КАК LocationПоSubGeomarket
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Locations КАК HFM_Locations
	//	|			ПО КостЦентры.ПодразделениеОрганизации.GeoMarket.Код = HFM_Locations.Код
	//	|				И (НЕ HFM_Locations.ПометкаУдаления)
	//	|		ПО (НЕ КостЦентры.ПометкаУдаления)
	//	|			И ВТ_HOBAccrualsSourceData.AU = КостЦентры.Код
	//	|ГДЕ
	//	|	КостЦентры.ПодразделениеОрганизации.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка)
	//	|	И ВТ_HOBAccrualsSourceData.AUType = ""Lawson""
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПодразделенияОрганизаций.Ссылка,
	//	|	ПодразделенияОрганизаций.Код,
	//	|	ЕСТЬNULL(HFM_Locations.Ссылка, ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка))
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.HFM_Locations КАК HFM_Locations
	//	|			ПО (НЕ HFM_Locations.ПометкаУдаления)
	//	|				И ПодразделенияОрганизаций.Код = HFM_Locations.Код
	//	|		ПО (НЕ ПодразделенияОрганизаций.ПометкаУдаления)
	//	|			И (ПОДСТРОКА(ВТ_HOBAccrualsSourceData.AU, 1, 6) = ПодразделенияОрганизаций.Код)
	//	|			И (ВТ_HOBAccrualsSourceData.AUType = ""Oracle MI""
	//	|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
	//	|				ИЛИ ВТ_HOBAccrualsSourceData.AUType = ""Oracle SII""
	//	|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
	//	|ГДЕ
	//	|	ВТ_HOBAccrualsSourceData.AUType <> ""Lawson""
	//	|	И ПодразделенияОрганизаций.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Locations.ПустаяСсылка)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	Lawson.Ссылка,
	//	|	Lawson.Код
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Lawson КАК Lawson
	//	|		ПО (НЕ Lawson.ПометкаУдаления)
	//	|			И ВТ_HOBAccrualsSourceData.Account = Lawson.Код
	//	|ГДЕ
	//	|	Lawson.БазовыйЭлемент = ЗНАЧЕНИЕ(ПланСчетов.HFM_GL_Accounts.ПустаяСсылка)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	Организации.Ссылка,
	//	|	Организации.Код
	//	|ИЗ
	//	|	ВТ_HOBAccrualsSourceData КАК ВТ_HOBAccrualsSourceData
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	//	|		ПО (НЕ Организации.ПометкаУдаления)
	//	|			И (Организации.Source = &ТипВнешнейСистемы)
	//	|			И ВТ_HOBAccrualsSourceData.CompanyCode = Организации.Код
	//	|ГДЕ
	//	|	Организации.БазовыйЭлемент = ЗНАЧЕНИЕ(Справочник.HFM_Companies.ПустаяСсылка)";
	//
	//Запрос.УстановитьПараметр("ДокументЗагрузки", СтруктураПараметров.Ссылка);
	//Запрос.УстановитьПараметр("Период", СтруктураПараметров.Дата);
	//Запрос.УстановитьПараметр("ТипВнешнейСистемы", СтруктураПараметров.ТипВнешнейСистемы);
	//МассивРезультатов = Запрос.ВыполнитьПакет();
	//
	//ТаблицаКоллизий = МассивРезультатов[1].Выгрузить();
	//
	//ВыборкаСегментов = МассивРезультатов[2].Выбрать();
	//
	//Пока ВыборкаСегментов.Следующий() Цикл
	//	
	//	Если ВыборкаСегментов.БазовыйЭлемент.Пустая() Тогда
	//		
	//		СтрокаКоллизии = ТаблицаКоллизий.Добавить();
	//		СтрокаКоллизии.КоллизияОтработана = Ложь;
	//		СтрокаКоллизии.Описание = "Not specified base element";
	//		СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
	//		СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Segment;
	//		СтрокаКоллизии.ОбъектПриемника = ВыборкаСегментов.Ссылка;
	//		СтрокаКоллизии.Идентификатор = ВыборкаСегментов.Код;
	//		
	//	Иначе
	//		
	//		ТекОбъект = ВыборкаСегментов.Ссылка.ПолучитьОбъект();
	//		ТекОбъект.БазовыйЭлемент = ВыборкаСегментов.БазовыйЭлемент;
	//		ТекОбъект.Записать();
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//// локации
	//ВыборкаЛокаций = МассивРезультатов[3].Выбрать();
	//
	//Пока ВыборкаЛокаций.Следующий() Цикл
	//	
	//	Если НЕ ВыборкаЛокаций.LocationПоSubGeomarket.Пустая() Тогда
	//		
	//		ТекОбъект = ВыборкаЛокаций.Ссылка.ПолучитьОбъект();
	//		ТекОбъект.БазовыйЭлемент = ВыборкаЛокаций.LocationПоSubGeomarket;
	//		ТекОбъект.Записать();
	//		
	//	Иначе
	//		
	//		СтрокаКоллизии = ТаблицаКоллизий.Добавить();
	//		СтрокаКоллизии.КоллизияОтработана = Ложь;
	//		СтрокаКоллизии.Описание = "Not specified base element";
	//		СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
	//		СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Location;
	//		СтрокаКоллизии.ОбъектПриемника = ВыборкаЛокаций.Ссылка;
	//		СтрокаКоллизии.Идентификатор = ВыборкаЛокаций.Код;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//// счета
	//ВыборкаСчетов = МассивРезультатов[4].Выбрать();
	//
	//Пока ВыборкаСчетов.Следующий() Цикл
	//	
	//	СтрокаКоллизии = ТаблицаКоллизий.Добавить();
	//	СтрокаКоллизии.КоллизияОтработана = Ложь;
	//	СтрокаКоллизии.Описание = "Not specified base element";
	//	СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
	//	СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Account;
	//	СтрокаКоллизии.ОбъектПриемника = ВыборкаСчетов.Ссылка;
	//	СтрокаКоллизии.Идентификатор = ВыборкаСчетов.Код;
	//	
	//КонецЦикла;
	//
	//// организации
	//ВыборкаКомпаний = МассивРезультатов[5].Выбрать();
	//
	//Пока ВыборкаКомпаний.Следующий() Цикл
	//	
	//	СтрокаКоллизии = ТаблицаКоллизий.Добавить();
	//	СтрокаКоллизии.КоллизияОтработана = Ложь;
	//	СтрокаКоллизии.Описание = "Not specified base element";
	//	СтрокаКоллизии.ТипСоответствия = Перечисления.ТипыСоответствий.HOBs;
	//	СтрокаКоллизии.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Company;
	//	СтрокаКоллизии.ОбъектПриемника = ВыборкаКомпаний.Ссылка;
	//	СтрокаКоллизии.Идентификатор = ВыборкаКомпаний.Код;
	//	
	//КонецЦикла;
	//
	//ДанныеДляЗаполнения.Вставить("ТаблицаКоллизий", ТаблицаКоллизий);
	//
	//ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	//
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СформироватьПроводкиDSS(ТаблицаДанных)
	
	Если ТипТранзакций = Перечисления.HOBTransactionType.Accrual Тогда
		СформироватьПроводкиDSSAccruals(ТаблицаДанных);
	//ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.JV Тогда
	//	СформироватьПроводкиDSSJV(СтруктураПараметров, АдресХранилища);
	ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.Receivables Тогда
		СформироватьПроводкиDSSReceivables(ТаблицаДанных);
	Иначе
		ВызватьИсключение "Unknown type of transactions!";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПроводкиDSSAccruals(ТаблицаДанных)
КонецПроцедуры

&НаСервере
Процедура СформироватьПроводкиDSSReceivables(ТаблицаДанных)

	ПериодНач = НачалоМесяца(Период);
	//СтруктураПоискаBatch = Новый Структура("Source, Company, Client, Location, SubSubSegment, AU, Account, Currency");
	//СтруктураПоискаМемо = Новый Структура("ArInvoice, Client");
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаИсходныхДанных.Account,
	|	ТаблицаИсходныхДанных.Client,
	|	ТаблицаИсходныхДанных.INN,
	|	ТаблицаИсходныхДанных.CompanyCode,
	|	ТаблицаИсходныхДанных.CompanyDesc,
	|	ТаблицаИсходныхДанных.Currency,
	|	ТаблицаИсходныхДанных.LocationCode,
	|	ТаблицаИсходныхДанных.LocationDesc,
	|	ТаблицаИсходныхДанных.Amount,
	|	ТаблицаИсходныхДанных.BaseAmount,
	|	ТаблицаИсходныхДанных.AU,
	|	ТаблицаИсходныхДанных.AUType,
	|	ТаблицаИсходныхДанных.SubSubSegment,
	//|	ТаблицаИсходныхДанных.Reverse,
	//|	ТаблицаИсходныхДанных.DocumentID,
	|	ТаблицаИсходныхДанных.InvoiceID,
	//|	ТаблицаИсходныхДанных.TrID,
	|	ТаблицаИсходныхДанных.InvoiceCurrency,
	|	ТаблицаИсходныхДанных.InvoiceType,
	|	ТаблицаИсходныхДанных.Invoice,
	|	ТаблицаИсходныхДанных.InvoiceNumber,
	|	ТаблицаИсходныхДанных.InvoiceDate,
	|	ТаблицаИсходныхДанных.InvoiceAmount,
	|	ТаблицаИсходныхДанных.InvoiceAgreementCode,
	|	ТаблицаИсходныхДанных.InvoiceAgreement,
	|	ТаблицаИсходныхДанных.FiscalInvoiceNo,
	|	ТаблицаИсходныхДанных.FiscalInvoiceDate,
	|	ТаблицаИсходныхДанных.InvoiceBilled,
	//|	ТаблицаИсходныхДанных.InvoicePassedForApproval,
	//|	ТаблицаИсходныхДанных.InvoicePassedForPayment,
	//|	ТаблицаИсходныхДанных.InvoicePassedForApprovalDate,
	//|	ТаблицаИсходныхДанных.InvoicePassedForPaymentDate,
	//|	ТаблицаИсходныхДанных.ExpectedDateOfPayment,
	//|	ТаблицаИсходныхДанных.PaymentNumber,
	//|	ТаблицаИсходныхДанных.PaymentDate,
	|	ТаблицаИсходныхДанных.СтрокаФайла
	|ПОМЕСТИТЬ ВТ_ДанныеФайла
	|ИЗ
	|	&ВнешняяТаблицаДанных КАК ТаблицаИсходныхДанных
	|	"
	;
	Запрос.УстановитьПараметр("ВнешняяТаблицаДанных", ТаблицаДанных);
	Запрос.Выполнить();
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.Идентификатор КАК Идентификатор,
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.ОбъектПриемника
		|ПОМЕСТИТЬ ВТ_СоответствиеКлиентовCustomerNumber
		|ИЗ
		|	РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
		|			&Период,
		|			ТипСоответствия = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.HOBs)
		|				И ТипОбъектаВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Client)
		|				И Идентификатор В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДанныеФайла.INN
		|					ИЗ
		|						ВТ_ДанныеФайла КАК ВТ_ДанныеФайла)) КАК НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.Идентификатор КАК Идентификатор,
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.ОбъектПриемника
		|ПОМЕСТИТЬ ВТ_СоответствиеCurrency
		|ИЗ
		|	РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
		|			&Период,
		|			ТипСоответствия = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.HOBs)
		|				И ТипОбъектаВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовВнешнихСистем.Currency)
		|				И Идентификатор В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДанныеФайла.Currency
		|					ИЗ
		|						ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДанныеФайла.InvoiceCurrency
		|					ИЗ
		|						ВТ_ДанныеФайла КАК ВТ_ДанныеФайла)) КАК НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	INV.DocID,
		|	INV.Ссылка
		|ИЗ
		|	Документ.Invoice КАК INV
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ПО INV.DocID = ВТ_ДанныеФайла.InvoiceID
		|			И (НЕ INV.ПометкаУдаления)
		|			И (INV.Source = &ТипВнешнейСистемы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Cash.DocID,
		|	Cash.Ссылка
		|ИЗ
		|	Документ.CashBatch КАК Cash
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ПО Cash.DocID = ВТ_ДанныеФайла.InvoiceID
		|			И (НЕ Cash.ПометкаУдаления)
		|			И (Cash.Source = &ТипВнешнейСистемы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	BatchAllocation.DocID,
		|	BatchAllocation.Ссылка
		|ИЗ
		|	Документ.BatchAllocation КАК BatchAllocation
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ПО BatchAllocation.DocID = ВТ_ДанныеФайла.InvoiceID
		|			И (НЕ BatchAllocation.ПометкаУдаления)
		|			И (BatchAllocation.Source = &ТипВнешнейСистемы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Memo.DocID,
		|	Memo.Ссылка
		|ИЗ
		|	Документ.Memo КАК Memo
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ПО Memo.DocID = ВТ_ДанныеФайла.InvoiceID
		|			И (НЕ Memo.ПометкаУдаления)
		|			И (Memo.Source = &ТипВнешнейСистемы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	DataLoadingStages.GeoMarket,
		|	DataLoadingStages.StartLoading КАК ДатаНачалаЗагрузки,
		|	DataLoadingStages.ReconciledBalances КАК ДатаВыверенныхОстатков
		|ИЗ
		|	РегистрСведений.DataLoadingStages КАК DataLoadingStages
		|ГДЕ
		|	DataLoadingStages.Source = &ТипВнешнейСистемы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	ВТ_ДанныеФайла.TrDate КАК Period,
		|	Организации.Ссылка КАК Company,
		|	Lawson.Ссылка КАК Account,
		|	КостЦентры.ПодразделениеОрганизации КАК Location,
		|	КостЦентры.Сегмент КАК SubSubSegment,
		|	ВТ_СоответствиеCurrency.ОбъектПриемника КАК Currency,
		|	ВТ_СоответствиеКлиентовCustomerNumber.ОбъектПриемника КАК Client,
		|	ВТ_ДанныеФайла.Amount,
		|	ВТ_ДанныеФайла.BaseAmount,
		//|	ВТ_ДанныеФайла.DocumentID,
		//|	ВТ_ДанныеФайла.TrNumber,
		//|	ВТ_ДанныеФайла.Document КАК DocumentPresentation,
		//|	ВТ_ДанныеФайла.TrID,
		//|	ТранзакцияHOB.Ссылка КАК Транзакция,
		//|	ВТ_ДанныеФайла.Reverse,
		|	ВТ_ДанныеФайла.LocationCode КАК CREW,
		|	ВТ_ДанныеФайла.INN КАК CustomerNumber,
		|	ВТ_ДанныеФайла.CompanyCode,
		|	ВТ_ДанныеФайла.AU КАК AUCode,
		|	ВТ_ДанныеФайла.LocationCode,
		|	ВТ_ДанныеФайла.Account КАК AccountCode,
		|	КостЦентры.Ссылка КАК AU,
		|	КостЦентры.ПодразделениеОрганизации.БазовыйЭлемент.GeoMarket.Родитель КАК GeoMarketHFM,
		|	ВТ_СоответствиеCurrency1.ОбъектПриемника КАК InvoiceCurrency,
		//|	ВТ_ДанныеФайла.DocumentType,
		|	ВТ_ДанныеФайла.InvoiceType,
		|	ВТ_ДанныеФайла.InvoiceID,
		|	ВТ_ДанныеФайла.InvoiceNumber,
		|	ВТ_ДанныеФайла.InvoiceDate,
		|	ВТ_ДанныеФайла.InvoiceAmount,
		|	ВТ_ДанныеФайла.InvoiceAgreementCode,
		|	ВТ_ДанныеФайла.InvoiceAgreement,
		|	ВТ_ДанныеФайла.FiscalInvoiceNo,
		|	ВТ_ДанныеФайла.FiscalInvoiceDate,
		|	ВТ_ДанныеФайла.InvoiceBilled,
		//|	ВТ_ДанныеФайла.InvoicePassedForApproval,
		//|	ВТ_ДанныеФайла.InvoicePassedForPayment,
		//|	ВТ_ДанныеФайла.InvoicePassedForApprovalDate,
		//|	ВТ_ДанныеФайла.InvoicePassedForPaymentDate,
		//|	ВТ_ДанныеФайла.ExpectedDateOfPayment,
		//|	ВТ_ДанныеФайла.PaymentNumber,
		//|	ВТ_ДанныеФайла.PaymentDate,
		|	ВТ_ДанныеФайла.СтрокаФайла КАК СтрокаФайла
		|ИЗ
		|	ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (НЕ Организации.ПометкаУдаления)
		|			И (Организации.Source = &ТипВнешнейСистемы)
		|			И ВТ_ДанныеФайла.CompanyCode = Организации.Код
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Lawson КАК Lawson
		|		ПО (НЕ Lawson.ПометкаУдаления)
		|			И ВТ_ДанныеФайла.Account = Lawson.Код
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранзакцияHOB КАК ТранзакцияHOB
		//|		ПО (НЕ ТранзакцияHOB.ПометкаУдаления)
		//|			И ВТ_ДанныеФайла.TrID = ТранзакцияHOB.TrID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КостЦентры КАК КостЦентры
		|		ПО ВТ_ДанныеФайла.AU = КостЦентры.Код
		|			И (НЕ КостЦентры.ПометкаУдаления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоответствиеCurrency КАК ВТ_СоответствиеCurrency
		|		ПО ВТ_ДанныеФайла.Currency = ВТ_СоответствиеCurrency.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствиеКлиентовCustomerNumber КАК ВТ_СоответствиеКлиентовCustomerNumber
		|		ПО ВТ_ДанныеФайла.INN = ВТ_СоответствиеКлиентовCustomerNumber.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствиеCurrency КАК ВТ_СоответствиеCurrency1
		|		ПО ВТ_ДанныеФайла.InvoiceCurrency = ВТ_СоответствиеCurrency1.Идентификатор
		|ГДЕ
		|	ВТ_ДанныеФайла.AUType = ""Lawson""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		//|	ВТ_ДанныеФайла.TrDate,
		|	Организации.Ссылка,
		|	Lawson.Ссылка,
		|	ПодразделенияОрганизаций.Ссылка,
		|	Сегменты.Ссылка,
		|	ВТ_СоответствиеCurrency.ОбъектПриемника,
		|	ВТ_СоответствиеКлиентовCustomerNumber.ОбъектПриемника,
		|	ВТ_ДанныеФайла.Amount,
		|	ВТ_ДанныеФайла.BaseAmount,
		//|	ВТ_ДанныеФайла.DocumentID,
		//|	ВТ_ДанныеФайла.TrNumber,
		//|	ВТ_ДанныеФайла.Document,
		//|	ВТ_ДанныеФайла.TrID,
		//|	ТранзакцияHOB.Ссылка,
		//|	ВТ_ДанныеФайла.Reverse,
		|	ВТ_ДанныеФайла.LocationCode,
		|	ВТ_ДанныеФайла.INN,
		|	ВТ_ДанныеФайла.CompanyCode,
		|	ВТ_ДанныеФайла.AU,
		|	ВТ_ДанныеФайла.LocationCode,
		|	ВТ_ДанныеФайла.Account,
		|	ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка),
		|	ПодразделенияОрганизаций.БазовыйЭлемент.GeoMarket.Родитель,
		|	ВТ_СоответствиеCurrency1.ОбъектПриемника,
		//|	ВТ_ДанныеФайла.DocumentType,
		|	ВТ_ДанныеФайла.InvoiceType,
		|	ВТ_ДанныеФайла.InvoiceID,
		|	ВТ_ДанныеФайла.InvoiceNumber,
		|	ВТ_ДанныеФайла.InvoiceDate,
		|	ВТ_ДанныеФайла.InvoiceAmount,
		|	ВТ_ДанныеФайла.InvoiceAgreementCode,
		|	ВТ_ДанныеФайла.InvoiceAgreement,
		|	ВТ_ДанныеФайла.FiscalInvoiceNo,
		|	ВТ_ДанныеФайла.FiscalInvoiceDate,
		|	ВТ_ДанныеФайла.InvoiceBilled,
		//|	ВТ_ДанныеФайла.InvoicePassedForApproval,
		//|	ВТ_ДанныеФайла.InvoicePassedForPayment,
		//|	ВТ_ДанныеФайла.InvoicePassedForApprovalDate,
		//|	ВТ_ДанныеФайла.InvoicePassedForPaymentDate,
		//|	ВТ_ДанныеФайла.ExpectedDateOfPayment,
		//|	ВТ_ДанныеФайла.PaymentNumber,
		//|	ВТ_ДанныеФайла.PaymentDate,
		|	ВТ_ДанныеФайла.СтрокаФайла
		|ИЗ
		|	ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (НЕ Организации.ПометкаУдаления)
		|			И (Организации.Source = &ТипВнешнейСистемы)
		|			И ВТ_ДанныеФайла.CompanyCode = Организации.Код
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Lawson КАК Lawson
		|		ПО (НЕ Lawson.ПометкаУдаления)
		|			И ВТ_ДанныеФайла.Account = Lawson.Код
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранзакцияHOB КАК ТранзакцияHOB
		//|		ПО (НЕ ТранзакцияHOB.ПометкаУдаления)
		//|			И ВТ_ДанныеФайла.TrID = ТранзакцияHOB.TrID
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоответствиеCurrency КАК ВТ_СоответствиеCurrency
		|		ПО ВТ_ДанныеФайла.Currency = ВТ_СоответствиеCurrency.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствиеКлиентовCustomerNumber КАК ВТ_СоответствиеКлиентовCustomerNumber
		|		ПО ВТ_ДанныеФайла.INN = ВТ_СоответствиеКлиентовCustomerNumber.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствиеCurrency КАК ВТ_СоответствиеCurrency1
		|		ПО ВТ_ДанныеФайла.InvoiceCurrency = ВТ_СоответствиеCurrency1.Идентификатор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сегменты КАК Сегменты
		|		ПО (НЕ Сегменты.ПометкаУдаления)
		|			И (ПОДСТРОКА(ВТ_ДанныеФайла.AU, 8, 3) = Сегменты.Код)
		|			И (ВТ_ДанныеФайла.AUType = ""Oracle MI""
		|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
		|				ИЛИ ВТ_ДанныеФайла.AUType = ""Oracle SII""
		|					И Сегменты.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО (НЕ ПодразделенияОрганизаций.ПометкаУдаления)
		|			И (ПОДСТРОКА(ВТ_ДанныеФайла.AU, 1, 6) = ПодразделенияОрганизаций.Код)
		|			И (ВТ_ДанныеФайла.AUType = ""Oracle MI""
		|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleMI)
		|				ИЛИ ВТ_ДанныеФайла.AUType = ""Oracle SII""
		|					И ПодразделенияОрганизаций.Source = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.OracleSmith))
		|ГДЕ
		|	ВТ_ДанныеФайла.AUType <> ""Lawson""
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтрокаФайла";
	
	Запрос.УстановитьПараметр("Период", Период);
	//Запрос.УстановитьПараметр("ДокументЗагрузки", СтруктураПараметров.Ссылка);
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Перечисления.ТипыСоответствий.HOBs);
	
	НачатьТранзакцию();
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗафиксироватьТранзакцию();
	
	КэшИнвойсов = РезультатЗапроса[2].Выгрузить();
	КэшИнвойсов.Индексы.Добавить("DocID");
	
	КэшCashBatch = РезультатЗапроса[3].Выгрузить();
	КэшCashBatch.Индексы.Добавить("DocID");
	
	КэшBatchAllocation = РезультатЗапроса[4].Выгрузить();
	КэшBatchAllocation.Индексы.Добавить("DocID");
	
	КэшMemo = РезультатЗапроса[5].Выгрузить();
	КэшMemo.Индексы.Добавить("DocID");
	
	ТаблицаДаты = РезультатЗапроса[6].Выгрузить();
	ТаблицаДаты.Индексы.Добавить("GeoMarket");
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[7].Выбрать();
	
	НачатьТранзакцию();
	
	Отказ = Ложь;
	ТекстСообщенияОбОшибках = "";
	
	ARBalance = РегистрыСведений.ARBalance;
	НаборЗаписей = ARBalance.СоздатьНаборЗаписей();
	
	КэшПредставленийТипов = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		////Если ВыборкаДанные.TransType = "P" или ВыборкаДанные.TransType = "I" или ВыборкаДанные.TransType = "C" или ВыборкаДанные.TransType = "M" Тогда
			НаборЗаписей = ARBalance.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ПериодНач);
			НаборЗаписей.Отбор.Location.Установить(ВыборкаДетальныеЗаписи.Location);
			НаборЗаписей.Отбор.Client.Установить(ВыборкаДетальныеЗаписи.Client);
			НаборЗаписей.Отбор.Company.Установить(ВыборкаДетальныеЗаписи.Company);
			НаборЗаписей.Отбор.Source.Установить(Перечисления.ТипыСоответствий.HOBs);
			НаборЗаписей.Отбор.SubSubSegment.Установить(ВыборкаДетальныеЗаписи.SubSubSegment);
			
			HOBInvoiceType = ПолучитьТипДокумента(ВыборкаДетальныеЗаписи.InvoiceType, КэшПредставленийТипов);
			
			Если HOBInvoiceType = Перечисления.HOBDocumentTypes.АктОбОказанииПроизводственныхУслуг
				 или HOBInvoiceType = Перечисления.HOBDocumentTypes.КорректировкаРеализации
				 или HOBInvoiceType = Перечисления.HOBDocumentTypes.РеализацияТоваровУслуг
				 или HOBInvoiceType = Перечисления.HOBDocumentTypes.ПрочиеЗатраты Тогда
				 
				Инвойс = КэшИнвойсов.Найти(ВыборкаДетальныеЗаписи.InvoiceID, "DocID");
				Если Инвойс = Неопределено Тогда
					ПолеИнвойс =  ВыборкаДетальныеЗаписи.InvoiceID;
				Иначе
					ПолеИнвойс = Инвойс.Ссылка;
				КонецЕсли;
			ИначеЕсли HOBInvoiceType = Перечисления.HOBDocumentTypes.ПлетежноеПоручениеИсходящее
				 или HOBInvoiceType = Перечисления.HOBDocumentTypes.КорректировкаДолга Тогда
				Memo = КэшMemo.Найти(ВыборкаДетальныеЗаписи.InvoiceID, "DocID");
				Если Memo = Неопределено Тогда
					ПолеИнвойс =  ВыборкаДетальныеЗаписи.InvoiceID;
				Иначе
					ПолеИнвойс = Memo.Ссылка;
				КонецЕсли;
			ИначеЕсли HOBInvoiceType = Перечисления.HOBDocumentTypes.ПлатежноеПоручениеВходящее Тогда
				CashBatch = КэшCashBatch.Найти(ВыборкаДетальныеЗаписи.InvoiceID, "DocID");
				Если CashBatch = Неопределено Тогда
					ПолеИнвойс =  ВыборкаДетальныеЗаписи.InvoiceID;
				Иначе
					ПолеИнвойс = CashBatch.Ссылка;
				КонецЕсли;
			Иначе
				
				ТекОшибка = "Unexpected invoice type in string " + ВыборкаДетальныеЗаписи.СтрокаФайла ;
				Если СтрНайти(ТекстСообщенияОбОшибках, ТекОшибка) = 0 Тогда
					ТекстСообщенияОбОшибках = ТекстСообщенияОбОшибках + ТекОшибка + Символы.ПС;
				КонецЕсли;
				Отказ = Истина;
				
			КонецЕсли;
			
			НаборЗаписей.Отбор.Invoice.Установить(ПолеИнвойс);
			НаборЗаписей.Отбор.Account.Установить(ВыборкаДетальныеЗаписи.Account);
			НаборЗаписей.Отбор.Currency.Установить(ВыборкаДетальныеЗаписи.Currency);
			НаборЗаписей.Отбор.AU.Установить(ВыборкаДетальныеЗаписи.AU);
			НаборЗаписей.Прочитать();
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = ПериодНач;
			НоваяЗапись.Location = ВыборкаДетальныеЗаписи.Location;
			НоваяЗапись.Client = ВыборкаДетальныеЗаписи.Client;
			НоваяЗапись.Company = ВыборкаДетальныеЗаписи.Company;
			НоваяЗапись.Source = Перечисления.ТипыСоответствий.HOBs;
			НоваяЗапись.SubSubSegment = ВыборкаДетальныеЗаписи.SubSubSegment;
			НоваяЗапись.Invoice = ПолеИнвойс;
			НоваяЗапись.Account = ВыборкаДетальныеЗаписи.Account;
			НоваяЗапись.Currency = ВыборкаДетальныеЗаписи.Currency;
			НоваяЗапись.AU = ВыборкаДетальныеЗаписи.AU;
			НоваяЗапись.Amount = ВыборкаДетальныеЗаписи.Amount;
			
			НаборЗаписей.Записать();

	КонецЦикла;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		ВызватьИсключение ТекстСообщенияОбОшибках;
	КонецЕсли;

	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


&НаСервере
Функция ПолучитьТипДокумента(ПредставлениеТипа, КэшПредставленийТипов)
	
	ТипИзКэша = КэшПредставленийТипов[ПредставлениеТипа];
	
	Если ТипИзКэша <> Неопределено Тогда
		Возврат ТипИзКэша;
	КонецЕсли;
	
	Если ПредставлениеТипа = "Операция международная" ИЛИ ПредставлениеТипа = "Операция (бухгалтерский и налоговый учет)" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.Операция;
	ИначеЕсли ПредставлениеТипа = "Сторнирование произвольного документа" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.Сторно;
	ИначеЕсли ПредставлениеТипа = "Платежное поручение входящее" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.ПлатежноеПоручениеВходящее;
	ИначеЕсли ПредставлениеТипа = "Акт об оказании производственных услуг" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.АктОбОказанииПроизводственныхУслуг;
	ИначеЕсли ПредставлениеТипа = "Корректировка долга" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.КорректировкаДолга;
	ИначеЕсли ПредставлениеТипа = "Корректировка реализации" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.КорректировкаРеализации;
	ИначеЕсли ПредставлениеТипа = "Реализация товаров и услуг" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.РеализацияТоваровУслуг;
	ИначеЕсли ПредставлениеТипа = "Платежное поручение исходящее" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.ПлетежноеПоручениеИсходящее;
	ИначеЕсли ПредставлениеТипа = "Передача ОС" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.ПередачаОС;
	ИначеЕсли ПредставлениеТипа = "Прочие затраты" Тогда
		ЗначениеТипа = Перечисления.HOBDocumentTypes.ПрочиеЗатраты;
	КонецЕсли;
	
	КэшПредставленийТипов.Вставить(ПредставлениеТипа, ЗначениеТипа);
	
	Возврат ЗначениеТипа;
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ПрочитатьФайлНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруФайлаПоУмолчанию()
	
	ПерваяСтрокаДанных = 2;
	ИменаКолонокВПервойСтроке = Истина;
	ЗаполнитьСтруктуруКолонокПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруКолонокПоУмолчанию()
	
	СтруктураКолонок.Очистить();
	
	Если ТипТранзакций = Перечисления.HOBTransactionType.JV Тогда
		ЗаполнитьСтруктуруКолонокJVПоУмолчанию();
	//ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.Accrual Тогда
	//	ЗаполнитьСтруктуруКолонокAccrualsПоУмолчанию();
	ИначеЕсли ТипТранзакций = Перечисления.HOBTransactionType.Receivables Тогда
		ЗаполнитьСтруктуруКолонокReceivablesПоУмолчанию();
	КонецЕсли;
	
	ТипСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100));
	ТипЧисло = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2));
	ТипДата = Новый ОписаниеТипов("Дата");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруКолонокJVПоУмолчанию()
	
	// Period
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "TrDate";
	СтрокаТЗ.ИмяКолонки = "Period";
	СтрокаТЗ.Обязательная = Истина;
	
	// TrNumber
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "TrNumber";
	СтрокаТЗ.ИмяКолонки = "TrNumber";
	СтрокаТЗ.Обязательная = Истина;
	
	// Document
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Document";
	СтрокаТЗ.ИмяКолонки = "Document";
	СтрокаТЗ.Обязательная = Истина;
	
	// DocumentType
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "DocumentType";
	СтрокаТЗ.ИмяКолонки = "DocumentType";
	СтрокаТЗ.Обязательная = Истина;
	
	// Account
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Account";
	СтрокаТЗ.ИмяКолонки = "Account";
	СтрокаТЗ.Обязательная = Истина;
	
	// Client
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Client";
	СтрокаТЗ.ИмяКолонки = "Client";
	СтрокаТЗ.Обязательная = Истина;
	
	// INN
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "INN";
	СтрокаТЗ.ИмяКолонки = "INN";
	СтрокаТЗ.Обязательная = Истина;
	
	// CompanyCode
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "CompanyCode";
	СтрокаТЗ.ИмяКолонки = "CompanyCode";
	СтрокаТЗ.Обязательная = Истина;
	
	// CompanyDesc
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "CompanyDesc";
	СтрокаТЗ.ИмяКолонки = "CompanyDesc";
	СтрокаТЗ.Обязательная = Истина;
	
	// Currency
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Currency";
	СтрокаТЗ.ИмяКолонки = "Currency";
	СтрокаТЗ.Обязательная = Истина;
	
	// LocationCode
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "LocationCode";
	СтрокаТЗ.ИмяКолонки = "LocationCode";
	СтрокаТЗ.Обязательная = Истина;
	
	// LocationDesc
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "LocationDesc";
	СтрокаТЗ.ИмяКолонки = "LocationDesc";
	СтрокаТЗ.Обязательная = Истина;
	
	// Amount
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Amount";
	СтрокаТЗ.ИмяКолонки = "Amount";
	СтрокаТЗ.Обязательная = Истина;
	
	// BaseAmount
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "BaseAmount";
	СтрокаТЗ.ИмяКолонки = "BaseAmount";
	СтрокаТЗ.Обязательная = Истина;
	
	// AU
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "AU";
	СтрокаТЗ.ИмяКолонки = "AU";
	СтрокаТЗ.Обязательная = Истина;
	
	// AUType
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "AUType";
	СтрокаТЗ.ИмяКолонки = "AUType";
	СтрокаТЗ.Обязательная = Истина;
	
	// SubSubSegment
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "SubSubSegment";
	СтрокаТЗ.ИмяКолонки = "SubSubSegment";
	СтрокаТЗ.Обязательная = Истина;
	
	// Reverse
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Reverse";
	СтрокаТЗ.ИмяКолонки = "Reverse";
	СтрокаТЗ.Обязательная = Истина;
	
	// DocumentID
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "DocumentID";
	СтрокаТЗ.ИмяКолонки = "DocumentID";
	СтрокаТЗ.Обязательная = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруКолонокReceivablesПоУмолчанию()
	
	ТипСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100));
	ТипЧисло = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2));
	ТипДата = Новый ОписаниеТипов("Дата");
	
	//// Period
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "TrDate";
	//СтрокаТЗ.ИмяКолонки = "Period";
	//СтрокаТЗ.Обязательная = Истина;
	//СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	//// TrNumber
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "TrNumber";
	//СтрокаТЗ.ИмяКолонки = "TrNumber";
	//СтрокаТЗ.Обязательная = Истина;
	
	//// Document
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "Document";
	//СтрокаТЗ.ИмяКолонки = "Document";
	//СтрокаТЗ.Обязательная = Истина;
	
	//// DocumentType
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "DocumentType";
	//СтрокаТЗ.ИмяКолонки = "DocumentType";
	//СтрокаТЗ.Обязательная = Истина;
	
	// Account
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Account";
	СтрокаТЗ.ИмяКолонки = "Account";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// Client
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Client";
	СтрокаТЗ.ИмяКолонки = "Client";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// INN
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "INN";
	СтрокаТЗ.ИмяКолонки = "INN";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// CompanyCode
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "CompanyCode";
	СтрокаТЗ.ИмяКолонки = "CompanyCode";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипЧисло;
	
	// CompanyDesc
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "CompanyDesc";
	СтрокаТЗ.ИмяКолонки = "CompanyDesc";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// Currency
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Currency";
	СтрокаТЗ.ИмяКолонки = "Currency";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// LocationCode
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "LocationCode";
	СтрокаТЗ.ИмяКолонки = "LocationCode";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// LocationDesc
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "LocationDesc";
	СтрокаТЗ.ИмяКолонки = "LocationDesc";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// Amount
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Amount";
	СтрокаТЗ.ИмяКолонки = "Amount";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипЧисло;
	
	// BaseAmount
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "BaseAmount";
	СтрокаТЗ.ИмяКолонки = "BaseAmount";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипЧисло;
	
	// AU
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "AU";
	СтрокаТЗ.ИмяКолонки = "AU";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// AUType
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "AUType";
	СтрокаТЗ.ИмяКолонки = "AUType";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// SubSubSegment
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "SubSubSegment";
	СтрокаТЗ.ИмяКолонки = "SubSubSegment";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	//// Reverse
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "Reverse";
	//СтрокаТЗ.ИмяКолонки = "Reverse";
	//СтрокаТЗ.Обязательная = Истина;
	
	// Invoice
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "Invoice";
	СтрокаТЗ.ИмяКолонки = "Invoice";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	//
	// InvoiceType
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceType";
	СтрокаТЗ.ИмяКолонки = "InvoiceType";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// InvoiceNumber
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceNumber";
	СтрокаТЗ.ИмяКолонки = "InvoiceNumber";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// InvoiceDate
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceDate";
	СтрокаТЗ.ИмяКолонки = "InvoiceDate";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// InvoiceCurrency
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceCurrency";
	СтрокаТЗ.ИмяКолонки = "InvoiceCurrency";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// InvoiceAmount
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceAmount";
	СтрокаТЗ.ИмяКолонки = "InvoiceAmount";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// InvoiceAgreementCode
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceAgreementCode";
	СтрокаТЗ.ИмяКолонки = "InvoiceAgreementCode";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// InvoiceAgreement
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceAgreement";
	СтрокаТЗ.ИмяКолонки = "InvoiceAgreement";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// FiscalInvoiceNo
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "FiscalInvoiceNo";
	СтрокаТЗ.ИмяКолонки = "FiscalInvoiceNo";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// FiscalInvoiceDate
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "FiscalInvoiceDate";
	СтрокаТЗ.ИмяКолонки = "FiscalInvoiceDate";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	// InvoiceBilled
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceBilled";
	СтрокаТЗ.ИмяКолонки = "InvoiceBilled";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
	//// InvoicePassedForApproval
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "InvoicePassedForApproval";
	//СтрокаТЗ.ИмяКолонки = "InvoicePassedForApproval";
	//СтрокаТЗ.Обязательная = Истина;
	
	//// InvoicePassedForPayment
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "InvoicePassedForPayment";
	//СтрокаТЗ.ИмяКолонки = "InvoicePassedForPayment";
	//СтрокаТЗ.Обязательная = Истина;
	//
	//// InvoicePassedForApprovalDate
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "InvoicePassedForApprovalDate";
	//СтрокаТЗ.ИмяКолонки = "InvoicePassedForApprovalDate";
	//СтрокаТЗ.Обязательная = Истина;
	//
	//// InvoicePassedForPaymentDate
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "InvoicePassedForPaymentDate";
	//СтрокаТЗ.ИмяКолонки = "InvoicePassedForPaymentDate";
	//СтрокаТЗ.Обязательная = Истина;
	//
	//// ExpectedDateOfPayment
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "ExpectedDateOfPayment";
	//СтрокаТЗ.ИмяКолонки = "ExpectedDateOfPayment";
	//СтрокаТЗ.Обязательная = Истина;
	
	//// PaymentNumber
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "PaymentNumber";
	//СтрокаТЗ.ИмяКолонки = "PaymentNumber";
	//СтрокаТЗ.Обязательная = Истина;
	//
	//// PaymentDate
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "PaymentDate";
	//СтрокаТЗ.ИмяКолонки = "PaymentDate";
	//СтрокаТЗ.Обязательная = Истина;
	//
	//// DocumentID
	//СтрокаТЗ = СтруктураКолонок.Добавить();
	//СтрокаТЗ.ИмяПоля = "DocumentID";
	//СтрокаТЗ.ИмяКолонки = "DocumentID";
	//СтрокаТЗ.Обязательная = Истина;
	//
	// InvoiceID
	СтрокаТЗ = СтруктураКолонок.Добавить();
	СтрокаТЗ.ИмяПоля = "InvoiceID";
	СтрокаТЗ.ИмяКолонки = "InvoiceID";
	СтрокаТЗ.Обязательная = Истина;
	СтрокаТЗ.ТипКолонки = ТипСтрока;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЗаполнитьСтруктуруФайлаПоУмолчанию();
КонецПроцедуры

&НаСервере
Функция ИнициализироватьТаблицуДанных(СтруктураКолонок)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	Для каждого ТекСтрокаСтруктурыКолонок Из СтруктураКолонок Цикл
		ТаблицаДанных.Колонки.Добавить(ТекСтрокаСтруктурыКолонок.ИмяПоля,ТекСтрокаСтруктурыКолонок.ТипКолонки);
	КонецЦикла;
	
	ТаблицаДанных.Колонки.Добавить("СтрокаФайла", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	
	Возврат ТаблицаДанных;
	
КонецФункции

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Период = Дата(1,1,1) Тогда	
		ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(ТекущаяДата()), КонецМесяца(ТекущаяДата()));
	Иначе
		ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода", НачалоМесяца(Период), КонецМесяца(Период));
	КонецЕсли;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, ЭтаФорма.ПредставлениеПериода, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Период = РезультатВыбора.НачалоПериода;
КонецПроцедуры

