
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Client, Account, Currency"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.Client <> Client
			ИЛИ СтарыеЗначенияКлючей.Account <> Account
			ИЛИ СтарыеЗначенияКлючей.Currency <> Currency Тогда
			
			НЗ = РегистрыСведений.КлючиCashBatch.СоздатьНаборЗаписей();
			НЗ.Отбор.Client.Установить(СтарыеЗначенияКлючей.Client);
			НЗ.Отбор.Account.Установить(СтарыеЗначенияКлючей.Account);
			НЗ.Отбор.Currency.Установить(СтарыеЗначенияКлючей.Currency);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.Client.Установить(Client);
			НЗ.Отбор.Account.Установить(Account);
			НЗ.Отбор.Currency.Установить(Currency);
			ЗаписьНабора = НЗ.Добавить();
			ЗаписьНабора.Client = Client;
			ЗаписьНабора.Account = Account;
			ЗаписьНабора.Currency = Currency;
			ЗаписьНабора.CashBatch = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиCashBatch.СоздатьНаборЗаписей();
		НЗ.Отбор.Client.Установить(Client);
		НЗ.Отбор.Account.Установить(Account);
		НЗ.Отбор.Currency.Установить(Currency);
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.Client = Client;
		ЗаписьНабора.Account = Account;
		ЗаписьНабора.Currency = Currency;
		ЗаписьНабора.CashBatch = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	НЗ = РегистрыСведений.КлючиCashBatch.СоздатьНаборЗаписей();
	НЗ.Отбор.Client.Установить(Client);
	НЗ.Отбор.Account.Установить(Account);
	НЗ.Отбор.Currency.Установить(Currency);
	НЗ.Записать(Истина);
	
КонецПроцедуры
