
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"Source, Company, Client, GeoMarket, SubGeoMarket, Segment, SubSegment, SubSubSegment, AU, Account, Currency"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.Source <> Source ИЛИ СтарыеЗначенияКлючей.Company <> Company
			ИЛИ СтарыеЗначенияКлючей.Client <> Client ИЛИ СтарыеЗначенияКлючей.GeoMarket <> GeoMarket
			ИЛИ СтарыеЗначенияКлючей.SubGeoMarket <> SubGeoMarket ИЛИ СтарыеЗначенияКлючей.Segment <> Segment
			ИЛИ СтарыеЗначенияКлючей.SubSegment <> SubSegment ИЛИ СтарыеЗначенияКлючей.SubSubSegment <> SubSubSegment
			ИЛИ СтарыеЗначенияКлючей.AU <> AU ИЛИ СтарыеЗначенияКлючей.Account <> Account ИЛИ СтарыеЗначенияКлючей.Currency <> Currency Тогда
			
			НЗ = РегистрыСведений.КлючиCashBatch.СоздатьНаборЗаписей();
			НЗ.Отбор.Source.Установить(СтарыеЗначенияКлючей.Source);
			НЗ.Отбор.Company.Установить(СтарыеЗначенияКлючей.Company);
			НЗ.Отбор.Client.Установить(СтарыеЗначенияКлючей.Client);
			НЗ.Отбор.GeoMarket.Установить(СтарыеЗначенияКлючей.GeoMarket);
			НЗ.Отбор.SubGeoMarket.Установить(СтарыеЗначенияКлючей.SubGeoMarket);
			НЗ.Отбор.Segment.Установить(СтарыеЗначенияКлючей.Segment);
			НЗ.Отбор.SubSegment.Установить(СтарыеЗначенияКлючей.SubSegment);
			НЗ.Отбор.SubSubSegment.Установить(СтарыеЗначенияКлючей.SubSubSegment);
			НЗ.Отбор.AU.Установить(СтарыеЗначенияКлючей.AU);
			НЗ.Отбор.Account.Установить(СтарыеЗначенияКлючей.Account);
			НЗ.Отбор.Currency.Установить(СтарыеЗначенияКлючей.Currency);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.Source.Установить(Source);
			НЗ.Отбор.Company.Установить(Company);
			НЗ.Отбор.Client.Установить(Client);
			НЗ.Отбор.GeoMarket.Установить(GeoMarket);
			НЗ.Отбор.SubGeoMarket.Установить(SubGeoMarket);
			НЗ.Отбор.Segment.Установить(Segment);
			НЗ.Отбор.SubSegment.Установить(SubSegment);
			НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
			НЗ.Отбор.AU.Установить(AU);
			НЗ.Отбор.Account.Установить(Account);
			НЗ.Отбор.Currency.Установить(Currency);
			ЗаписьНабора = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
			ЗаписьНабора.CashBatch = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиCashBatch.СоздатьНаборЗаписей();
		НЗ.Отбор.Source.Установить(Source);
		НЗ.Отбор.Company.Установить(Company);
		НЗ.Отбор.Client.Установить(Client);
		НЗ.Отбор.GeoMarket.Установить(GeoMarket);
		НЗ.Отбор.SubGeoMarket.Установить(SubGeoMarket);
		НЗ.Отбор.Segment.Установить(Segment);
		НЗ.Отбор.SubSegment.Установить(SubSegment);
		НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
		НЗ.Отбор.AU.Установить(AU);
		НЗ.Отбор.Account.Установить(Account);
		НЗ.Отбор.Currency.Установить(Currency);
		ЗаписьНабора = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЭтотОбъект);
		ЗаписьНабора.CashBatch = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	НЗ = РегистрыСведений.КлючиCashBatch.СоздатьНаборЗаписей();
	НЗ.Отбор.Source.Установить(Source);
	НЗ.Отбор.Company.Установить(Company);
	НЗ.Отбор.Client.Установить(Client);
	НЗ.Отбор.GeoMarket.Установить(GeoMarket);
	НЗ.Отбор.SubGeoMarket.Установить(SubGeoMarket);
	НЗ.Отбор.Segment.Установить(Segment);
	НЗ.Отбор.SubSegment.Установить(SubSegment);
	НЗ.Отбор.SubSubSegment.Установить(SubSubSegment);
	НЗ.Отбор.AU.Установить(AU);
	НЗ.Отбор.Account.Установить(Account);
	НЗ.Отбор.Currency.Установить(Currency);
	НЗ.Записать(Истина);
	
КонецПроцедуры
