
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СоздатьНовыйОбъекты(Отказ);
	ОбработатьИзмененныеОбъекты(Отказ);
	
КонецПроцедуры

Процедура СоздатьНовыйОбъекты(Отказ)
	
	НЗ_ParentClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_ParentClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.ParentClients);
	НЗ_ParentClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_SalesClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_SalesClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.CRM);
	НЗ_SalesClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_BillingClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_BillingClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.Lawson);
	НЗ_BillingClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_ИерархияКонтрагентов = РегистрыСведений.ИерархияКонтрагентов.СоздатьНаборЗаписей();
	НЗ_ИерархияКонтрагентов.Отбор.Период.Установить(Дата);
	
	// новые parent clients
	Для каждого ТекСтрокаТЧ Из НовыеParentClients Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		НовыйКонтагент.Записать();
		
		НЗ_ParentClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.Description);
		НЗ_ParentClients.Очистить();
		НоваяЗапись = НЗ_ParentClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.ParentClients;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.Description;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_ParentClients.Записать();
		
	КонецЦикла;
	
	// новые Sales клиенты
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, НовыеSalesКлиенты.ВыгрузитьКолонку("ParentClient"));
	
	Для каждого ТекСтрокаТЧ Из НовыеSalesКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		НовыйКонтагент.Записать();
		
		НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.CRMID);
		НЗ_SalesClients.Очистить();
		НоваяЗапись = НЗ_SalesClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.CRMID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_SalesClients.Записать();
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		ГоловнойКонтрагент = ГоловныеКонтрагенты[ТекСтрокаТЧ.ParentClient];
		Если ГоловнойКонтрагент = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by description '" + ТекСтрокаТЧ.ParentClient + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		НЗ_ИерархияКонтрагентов.Записать();
		
	КонецЦикла;
	
	// новые Billing клиенты
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, НовыеBillingКлиенты.ВыгрузитьКолонку("ParentClient"));
	
	Для каждого ТекСтрокаТЧ Из НовыеBillingКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		НовыйКонтагент.Записать();
		
		НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.CRMID);
		НЗ_SalesClients.Очистить();
		НоваяЗапись = НЗ_SalesClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.CRMID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_SalesClients.Записать();
		
		НЗ_BillingClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.BillingID);
		НЗ_BillingClients.Очистить();
		НоваяЗапись = НЗ_BillingClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.BillingID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_BillingClients.Записать();
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		ГоловнойКонтрагент = ГоловныеКонтрагенты[ТекСтрокаТЧ.ParentClient];
		Если ГоловнойКонтрагент = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by description '" + ТекСтрокаТЧ.ParentClient + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		НЗ_ИерархияКонтрагентов.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзмененныеОбъекты(Отказ)
	
	НЗ_SalesClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_SalesClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.CRM);
	НЗ_SalesClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_BillingClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_BillingClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.Lawson);
	НЗ_BillingClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_ИерархияКонтрагентов = РегистрыСведений.ИерархияКонтрагентов.СоздатьНаборЗаписей();
	НЗ_ИерархияКонтрагентов.Отбор.Период.Установить(Дата);
	
	Для каждого ТекСтрокаТЧ Из ИзмененныеCRMID Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewCRMID);
		НЗ_SalesClients.Очистить();
		НоваяЗапись = НЗ_SalesClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewCRMID;
		НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
		НЗ_SalesClients.Записать();
		
	КонецЦикла;
	
	Для каждого ТекСтрокаТЧ Из ИзмененныеBillingID Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НЗ_BillingClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewOldBillingID);
		НЗ_BillingClients.Очистить();
		НоваяЗапись = НЗ_BillingClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewOldBillingID;
		НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
		НЗ_BillingClients.Записать();
		
	КонецЦикла;
	
	// для пустых новых головных контрагентов попробуем найти их по идентификаторам
	НайденныеСтроки = ИзмененныеParentClients.НайтиСтроки(Новый Структура("Применить, NewParentClient", Истина, Справочники.Контрагенты.ПустаяСсылка()));
	МассивИдентификаторов = Новый Массив;
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивИдентификаторов.Добавить(НайденнаяСтрока.NewParentClientDescription);
	КонецЦикла;
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, МассивИдентификаторов);
	
	Для каждого ТекСтрокаТЧ Из ИзмененныеParentClients Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаТЧ.NewParentClient.Пустая() Тогда
			// попытаемся найти по идентификатору
			NewParentClient = ГоловныеКонтрагенты[ТекСтрокаТЧ.NewParentClientDescription];
		Иначе
			NewParentClient = ТекСтрокаТЧ.NewParentClient;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(NewParentClient) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find new parent client for '" + ТекСтрокаТЧ.Client + "'",,,, Отказ);
		КонецЕсли;
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(ТекСтрокаТЧ.Client);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = ТекСтрокаТЧ.Client;
		НоваяЗапись.ГоловнойКонтрагент = NewParentClient;
		НЗ_ИерархияКонтрагентов.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьГоловныхКонтрагентов(Период, МассивИдентификаторов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.Идентификатор,
		|	НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних.ОбъектПриемника
		|ИЗ
		|	РегистрСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СрезПоследних(
		|			&Период,
		|			ТипСоответствия = ЗНАЧЕНИЕ(Перечисление.ТипыСоответствий.ParentClients)
		|				И Идентификатор В (&МассивИдентификаторов)) КАК НастройкаСинхронизацииОбъектовСВнешнимиСистемамиСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Идентификатор, Выборка.ОбъектПриемника);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Проведен Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to save posted document");
	КонецЕсли;
	
КонецПроцедуры
