
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СоздатьНовыйОбъекты(Отказ);
	ОбработатьИзмененныеОбъекты(Отказ);
	ОбработатьИзменныеРеквизиты(Отказ);
	ДеактивироватьОтсутствующихКлиентов(Отказ);
	
КонецПроцедуры

Процедура СоздатьНовыйОбъекты(Отказ)
	
	//НЗ_ParentClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	//НЗ_ParentClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.ParentClients);
	//НЗ_ParentClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	//НЗ_SalesClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	//НЗ_SalesClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.CRM);
	//НЗ_SalesClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_LawsonClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_LawsonClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.Lawson);
	НЗ_LawsonClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_MIClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_MIClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleMI);
	НЗ_MIClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_SmithClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_SmithClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleSmith);
	НЗ_SmithClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_ИерархияКонтрагентов = РегистрыСведений.ИерархияКонтрагентов.СоздатьНаборЗаписей();
	НЗ_ИерархияКонтрагентов.Отбор.Период.Установить(Дата);
	
	НЗ_ДублиBillingID = РегистрыСведений.ДублиBillingID.СоздатьНаборЗаписей();
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	// новые parent clients
	СозданныеParentClients = Новый Соответствие;
	Для каждого ТекСтрокаТЧ Из НовыеParentClients Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
		//НовыйКонтагент.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		НовыйКонтагент.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.ОжидаетАктивации;
		НовыйКонтагент.ParentClient = Истина;
		НовыйКонтагент.Записать();
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.СозданиеParentClient;
		//СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.УдалитьCRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
		СозданныеParentClients.Вставить(ТекСтрокаТЧ.Description, НовыйКонтагент.Ссылка);
		
	КонецЦикла;
	
	// новые Sales клиенты
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, НовыеSalesКлиенты.ВыгрузитьКолонку("ParentClientDescription"));
	
	Для каждого ТекСтрокаТЧ Из НовыеSalesКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		//Если СозданныеParentClients[ТекСтрокаТЧ.CRMID] = Неопределено Тогда
			
			НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйКонтагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
			НовыйКонтагент.CRMID = ТекСтрокаТЧ.CRMID;
			НовыйКонтагент.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.ОжидаетАктивации;
			НовыйКонтагент.CreditRating = ТекСтрокаТЧ.CreditRating;
			НовыйКонтагент.Записать();
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.СозданиеSalesClient;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		//Иначе
		//	
		//	НовыйКонтагентСсылка = СозданныеParentClients[ТекСтрокаТЧ.CRMID];
		//	НовыйКонтагент = НовыйКонтагентСсылка.ПолучитьОбъект();
		//	НовыйКонтагент.CreditRating = ТекСтрокаТЧ.CreditRating;
		//	НовыйКонтагент.Записать();
		//	
		//	// логирование события
		//	СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
		//	СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		//	СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//	СтруктураЗаписиЛогов.Текст = "Update credit rating";
		//	ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		//	
		//КонецЕсли;
		
		//НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.CRMID);
		//НЗ_SalesClients.Очистить();
		//НоваяЗапись = НЗ_SalesClients.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
		//НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		//НоваяЗапись.Идентификатор = ТекСтрокаТЧ.CRMID;
		//НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		//НЗ_SalesClients.Записать();
		
		ПустойID = "#empty#" + ТекСтрокаТЧ.CRMID;
		
		// Lawson
		НЗ_LawsonClients.Отбор.Идентификатор.Установить(ПустойID);
		НЗ_LawsonClients.Очистить();
		НоваяЗапись = НЗ_LawsonClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ПустойID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_LawsonClients.Записать(Ложь);
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
		// MI
		НЗ_MIClients.Отбор.Идентификатор.Установить(ПустойID);
		НЗ_MIClients.Очистить();
		НоваяЗапись = НЗ_MIClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ПустойID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_MIClients.Записать(Ложь);
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		СтруктураЗаписиЛогов.Текст = "Update MI ID";
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		// SMITH
		НЗ_SmithClients.Отбор.Идентификатор.Установить(ПустойID);
		НЗ_SmithClients.Очистить();
		НоваяЗапись = НЗ_SmithClients.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
		НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		НоваяЗапись.Идентификатор = ПустойID;
		НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		НЗ_SmithClients.Записать(Ложь);
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		ГоловнойКонтрагент = ГоловныеКонтрагенты[ТекСтрокаТЧ.ParentClientDescription];
		Если ГоловнойКонтрагент = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by ID '" + ТекСтрокаТЧ.ParentClientDescription + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		НЗ_ИерархияКонтрагентов.Записать();
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеParentClient;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		СтруктураЗаписиЛогов.Текст = "Update parent client. Value: " + ГоловнойКонтрагент;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
	// новые Billing клиенты
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, НовыеBillingКлиенты.ВыгрузитьКолонку("ParentClientDescription"));
	
	Для каждого ТекСтрокаТЧ Из НовыеBillingКлиенты Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		//Если СозданныеParentClients[ТекСтрокаТЧ.CRMID] = Неопределено Тогда
			
			НовыйКонтагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйКонтагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НовыйКонтагент.Наименование = ТекСтрокаТЧ.Description;
			НовыйКонтагент.CRMID = ТекСтрокаТЧ.CRMID;
			НовыйКонтагент.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.ОжидаетАктивации;
			НовыйКонтагент.CreditRating = ТекСтрокаТЧ.CreditRating;
			НовыйКонтагент.Записать();
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.СозданиеBillingClient;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		//Иначе
		//	
		//	НовыйКонтагентСсылка = СозданныеParentClients[ТекСтрокаТЧ.CRMID];
		//	НовыйКонтагент = НовыйКонтагентСсылка.ПолучитьОбъект();
		//	НовыйКонтагент.CreditRating = ТекСтрокаТЧ.CreditRating;
		//	НовыйКонтагент.Записать();
		//	
		//	// логирование события
		//	СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
		//	СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		//	СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		//	СтруктураЗаписиЛогов.Текст = "Update credit rating";
		//	ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		//	
		//КонецЕсли;
		
		//НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.CRMID);
		//НЗ_SalesClients.Очистить();
		//НоваяЗапись = НЗ_SalesClients.Добавить();
		//НоваяЗапись.Период = Дата;
		//НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
		//НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		//НоваяЗапись.Идентификатор = ТекСтрокаТЧ.CRMID;
		//НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
		//НЗ_SalesClients.Записать();
		
		// Lawson
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.LawsonID
			, Перечисления.ТипыСоответствий.Lawson
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если Не ПустаяСтрока(ТекСтрокаТЧ.LawsonID) И НЕ ОбъектЕстьВРегистре Тогда
			
			НЗ_LawsonClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.LawsonID);
			НЗ_LawsonClients.Очистить();
			НоваяЗапись = НЗ_LawsonClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.LawsonID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_LawsonClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ПустаяСтрока(ТекСтрокаТЧ.LawsonID) И Не ОбъектЕстьВРегистре Тогда
			
			ПустойID = "#empty#" + ТекСтрокаТЧ.CRMID;
			
			НЗ_LawsonClients.Отбор.Идентификатор.Установить(ПустойID);
			НЗ_LawsonClients.Очистить();
			НоваяЗапись = НЗ_LawsonClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ПустойID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_LawsonClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(НовыйКонтагент.Ссылка);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = НовыйКонтагент.Ссылка;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Double Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// MI
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.MIID
			, Перечисления.ТипыСоответствий.OracleMI
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
		
		Если Не ПустаяСтрока(ТекСтрокаТЧ.MIID) И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_MIClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.MIID);
			НЗ_MIClients.Очистить();
			НоваяЗапись = НЗ_MIClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.MIID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_MIClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ПустаяСтрока(ТекСтрокаТЧ.MIID) И НЕ ОбъектЕстьВРегистре Тогда
			
			ПустойID = "#empty#" + ТекСтрокаТЧ.CRMID;
			
			НЗ_MIClients.Отбор.Идентификатор.Установить(ПустойID);
			НЗ_MIClients.Очистить();
			НоваяЗапись = НЗ_MIClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ПустойID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_MIClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(НовыйКонтагент.Ссылка);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = НовыйКонтагент.Ссылка;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Double MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// SMITH
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.SMITHID
			, Перечисления.ТипыСоответствий.OracleSmith
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
		
		Если Не ПустаяСтрока(ТекСтрокаТЧ.SMITHID) И Не ОбъектЕстьВРегистре Тогда
				
			НЗ_SmithClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.SMITHID);
			НЗ_SmithClients.Очистить();
			НоваяЗапись = НЗ_SmithClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.SMITHID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_SmithClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ПустаяСтрока(ТекСтрокаТЧ.SMITHID) И Не ОбъектЕстьВРегистре Тогда
			
			ПустойID = "#empty#" + ТекСтрокаТЧ.CRMID;
			
			НЗ_SmithClients.Отбор.Идентификатор.Установить(ПустойID);
			НЗ_SmithClients.Очистить();
			НоваяЗапись = НЗ_SmithClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ПустойID;
			НоваяЗапись.ОбъектПриемника = НовыйКонтагент.Ссылка;
			НЗ_SmithClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(НовыйКонтагент.Ссылка);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = НовыйКонтагент.Ссылка;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
			СтруктураЗаписиЛогов.Текст = "Double SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(НовыйКонтагент.Ссылка);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = НовыйКонтагент.Ссылка;
		ГоловнойКонтрагент = ГоловныеКонтрагенты[ТекСтрокаТЧ.ParentClientDescription];
		Если ГоловнойКонтрагент = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find parent client by ID '" + ТекСтрокаТЧ.ParentClientDescription + "'",,,,Отказ);
		КонецЕсли;
		НоваяЗапись.ГоловнойКонтрагент = ГоловнойКонтрагент;
		НЗ_ИерархияКонтрагентов.Записать();
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеParentClient;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = НовыйКонтагент.Ссылка;
		СтруктураЗаписиЛогов.Текст = "Update parent client. Value: " + ГоловнойКонтрагент;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзмененныеОбъекты(Отказ)
	
	//НЗ_SalesClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	//НЗ_SalesClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.CRM);
	//НЗ_SalesClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_LawsonClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_LawsonClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.Lawson);
	НЗ_LawsonClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_MIClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_MIClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleMI);
	НЗ_MIClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_SmithClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_SmithClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.OracleSmith);
	НЗ_SmithClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_ИерархияКонтрагентов = РегистрыСведений.ИерархияКонтрагентов.СоздатьНаборЗаписей();
	НЗ_ИерархияКонтрагентов.Отбор.Период.Установить(Дата);
	
	НЗ_ДублиBillingID = РегистрыСведений.ДублиBillingID.СоздатьНаборЗаписей();
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	//Для каждого ТекСтрокаТЧ Из ИзмененныеCRMID Цикл
	//	
	//	Если Не ТекСтрокаТЧ.Применить Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НЗ_SalesClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewCRMID);
	//	НЗ_SalesClients.Очистить();
	//	НоваяЗапись = НЗ_SalesClients.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.CRM;
	//	НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
	//	НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewCRMID;
	//	НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
	//	НЗ_SalesClients.Записать();
	//	
	//КонецЦикла;
	
	Для каждого ТекСтрокаТЧ Из ИзмененныеBillingID Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		// Lawson
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.NewLawsonID
			, Перечисления.ТипыСоответствий.Lawson
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если ТекСтрокаТЧ.NewLawsonID <> ТекСтрокаТЧ.OldLawsonID И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_LawsonClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewLawsonID);
			НЗ_LawsonClients.Очистить();
			НоваяЗапись = НЗ_LawsonClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.Lawson;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewLawsonID;
			НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
			НЗ_LawsonClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(ТекСтрокаТЧ.Client);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = ТекСтрокаТЧ.Client;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Double Lawson ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// MI
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.NewMIID
			, Перечисления.ТипыСоответствий.OracleMI
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если ТекСтрокаТЧ.NewMIID <> ТекСтрокаТЧ.OldMIID И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_MIClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewMIID);
			НЗ_MIClients.Очистить();
			НоваяЗапись = НЗ_MIClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleMI;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewMIID;
			НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
			НЗ_MIClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(ТекСтрокаТЧ.Client);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = ТекСтрокаТЧ.Client;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Double MI ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
		// Smith
		ОбъектЕстьВРегистре = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.ОбъектЕстьВРегистреСУчетомПериода(Дата, ТекСтрокаТЧ.NewSmithID
			, Перечисления.ТипыСоответствий.OracleSmith
			, Перечисления.ТипыОбъектовВнешнихСистем.Client);
			
		Если ТекСтрокаТЧ.NewSmithID <> ТекСтрокаТЧ.OldSmithID И НЕ ОбъектЕстьВРегистре Тогда
				
			НЗ_SmithClients.Отбор.Идентификатор.Установить(ТекСтрокаТЧ.NewSmithID);
			НЗ_SmithClients.Очистить();
			НоваяЗапись = НЗ_SmithClients.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ТипСоответствия = Перечисления.ТипыСоответствий.OracleSmith;
			НоваяЗапись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			НоваяЗапись.Идентификатор = ТекСтрокаТЧ.NewSmithID;
			НоваяЗапись.ОбъектПриемника = ТекСтрокаТЧ.Client;
			НЗ_SmithClients.Записать(Ложь);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеBillingID;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		ИначеЕсли ОбъектЕстьВРегистре Тогда
			
			НЗ_ДублиBillingID.Очистить();
			НЗ_ДублиBillingID.Отбор.Client.Установить(ТекСтрокаТЧ.Client);
			НоваяЗапись = НЗ_ДублиBillingID.Добавить();
			НоваяЗапись.Client = ТекСтрокаТЧ.Client;
			НЗ_ДублиBillingID.Записать(Истина);
			
			// логирование события
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ОтказОтОбработки;
			СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Double SMITH ID";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// для пустых новых головных контрагентов попробуем найти их по идентификаторам
	НайденныеСтроки = ИзмененныеParentClients.НайтиСтроки(Новый Структура("Применить, NewParentClient", Истина, Справочники.Контрагенты.ПустаяСсылка()));
	МассивИдентификаторов = Новый Массив;
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивИдентификаторов.Добавить(НайденнаяСтрока.NewParentClientDescription);
	КонецЦикла;
	ГоловныеКонтрагенты = ПолучитьГоловныхКонтрагентов(Дата, МассивИдентификаторов);
	
	Для каждого ТекСтрокаТЧ Из ИзмененныеParentClients Цикл
		
		Если Не ТекСтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаТЧ.NewParentClient.Пустая() Тогда
			// попытаемся найти по идентификатору
			NewParentClient = ГоловныеКонтрагенты[ТекСтрокаТЧ.NewParentClientDescription];
		Иначе
			NewParentClient = ТекСтрокаТЧ.NewParentClient;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(NewParentClient) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to find new parent client for '" + ТекСтрокаТЧ.Client + "'",,,, Отказ);
		КонецЕсли;
		
		НЗ_ИерархияКонтрагентов.Отбор.Контрагент.Установить(ТекСтрокаТЧ.Client);
		НЗ_ИерархияКонтрагентов.Очистить();
		НоваяЗапись = НЗ_ИерархияКонтрагентов.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Контрагент = ТекСтрокаТЧ.Client;
		НоваяЗапись.ГоловнойКонтрагент = NewParentClient;
		НЗ_ИерархияКонтрагентов.Записать();
		
		// логирование события
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеParentClient;
		СтруктураЗаписиЛогов.CRMID = ТекСтрокаТЧ.CRMID;
		СтруктураЗаписиЛогов.Client = ТекСтрокаТЧ.Client;
		СтруктураЗаписиЛогов.Текст = "Update parent client. New value: " + NewParentClient;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзменныеРеквизиты(Отказ)
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТЧ Из ИзмененныеРеквизиты Цикл
		
		Если Не СтрокаТЧ.Применить Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОбъект = СтрокаТЧ.Client.ПолучитьОбъект();
		ТекОбъект.Наименование = СтрокаТЧ.NewDescription;
		ТекОбъект.CreditRating = СтрокаТЧ.NewCreditRating;
		ТекОбъект.Записать();
		
		// логирование события
		Если СтрокаТЧ.OldDescription <> СтрокаТЧ.NewDescription Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update description";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
		Если СтрокаТЧ.OldCreditRating <> СтрокаТЧ.NewCreditRating Тогда
			СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ИзменениеРеквизитов;
			СтруктураЗаписиЛогов.CRMID = СтрокаТЧ.CRMID;
			СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
			СтруктураЗаписиЛогов.Текст = "Update credit rating";
			ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДеактивироватьОтсутствующихКлиентов(Отказ)
	
	СтруктураЗаписиЛогов = Новый Структура("ДокументЗагрузки, ДатаСобытия, СобытиеЛогирования, Пользователь, CRMID, Client, Текст");
	СтруктураЗаписиЛогов.ДокументЗагрузки = Ссылка;
	СтруктураЗаписиЛогов.ДатаСобытия = ТекущаяДата();
	СтруктураЗаписиЛогов.Пользователь = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТЧ Из КлиентыДляДективации Цикл
		
		ТекОбъект = СтрокаТЧ.Client.ПолучитьОбъект();
		ТекОбъект.СостояниеАктивности = Перечисления.СостоянияАктивностиКонтрагентов.Неактивен;
		ТекОбъект.ДатаДеактивации = Дата;
		ТекОбъект.Записать();
		
		СтруктураЗаписиЛогов.СобытиеЛогирования = Перечисления.СобытияЛогированияCRMAccountsExtractLoading.ДеактивацияКлиента;
		СтруктураЗаписиЛогов.CRMID = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Client, "CRMID");
		СтруктураЗаписиЛогов.Client = СтрокаТЧ.Client;
		ЗалогироватьСобытие(СтруктураЗаписиЛогов);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьГоловныхКонтрагентов(Период, МассивИдентификаторов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК ОбъектПриемника,
		|	Контрагенты.Наименование КАК Идентификатор
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.Наименование В(&МассивИдентификаторов)
		|	И Контрагенты.ParentClient";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Идентификатор, Выборка.ОбъектПриемника);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Если Проведен Тогда
	//	Отказ = Истина;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Failed to save posted document");
	//КонецЕсли;
	
КонецПроцедуры

Процедура ЗалогироватьСобытие(СтруктураЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.ЛогиЗагрузкиCRMAccountsExtract.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	МенеджерЗаписи.ИдентификаторСобытия = Новый УникальныйИдентификатор();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры