
&НаКлиенте
Процедура Печать(Команда)
	
	ИдентификаторПечатнойФормы = "ПечатнаяФорма";
	НазваниеПечатнойФормы = НСтр("ru='Collection target unbilled details'");
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета         = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент     = ПреобразоватьРезультатОтчета();
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьРезультатОтчета()
	
	СкопироватьРезультатОтчета();
	
	Для НомерСтроки = 6 По РезультатКопия.ВысотаТаблицы Цикл
		РезультатКопия.Область(НомерСтроки, 11).Текст = "пврп";
	КонецЦикла;
	
	Возврат РезультатКопия;
	
КонецФункции

&НаСервере
Процедура СкопироватьРезультатОтчета()
	РезультатКопия = Результат;
КонецПроцедуры


