
&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	Если Запись.Настройка.Пустая() Тогда
		
		Запись.Значение = Неопределено;
		
	Иначе
		
		// { RGS VShamin 11.12.2014 16:37:08 - OPS-0000248
		//Если Не Запись.Настройка.ТипЗначения.СодержитТип(ТипЗнч(Запись.Значение)) Тогда	
		Если Не НастройкаПриИзмененииНаСервере(Запись.Настройка) Тогда				

			//Запись.Значение = Запись.Настройка.ТипЗначения.ПривестиЗначение();
			Запись.Значение = НастройкаПриИзмененииПривестиЗначениеНаСервере(Запись.Настройка);
		// } RGS VShamin 11.12.2014 16:37:12 - OPS-0000248			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// { RGS VShamin 11.12.2014 16:35:09 - OPS-0000248
&НаСервере
Функция НастройкаПриИзмененииНаСервере(Настройка)

	 Возврат Настройка.ТипЗначения.СодержитТип(ТипЗнч(Запись.Значение));

КонецФункции // } RGS VShamin 11.12.2014 16:35:13 - OPS-0000248
 
// { RGS VShamin 11.12.2014 16:35:09 - OPS-0000248
&НаСервере
Функция НастройкаПриИзмененииПривестиЗначениеНаСервере(Настройка)

	 Возврат Настройка.ТипЗначения.ПривестиЗначение();

КонецФункции // } RGS VShamin 11.12.2014 16:35:13 - OPS-0000248

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОЗаписиНового(ВладелецФормы);
КонецПроцедуры
 
