
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		ЭтоResponsibleAR = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьНабора.Получатель, "ResponsibleAR");
		Если ЭтоResponsibleAR И ЗаписьНабора.Уровень <> Справочники.EscalationLevels.Level1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Responsible AR is only available for Level 1", , , , Отказ);
		КонецЕсли;
		Если Не Отказ И ЭтоResponsibleAR Тогда
			РегистрыСведений.ОчередьОбновленияSalesOrderResponsibles.Добавить(ЗаписьНабора.Source, ЗаписьНабора.Идентификатор1, ЗаписьНабора.Идентификатор2);
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ И Замещение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПолучателиУведомленийUnbilled.Source,
			|	ПолучателиУведомленийUnbilled.Идентификатор1,
			|	ПолучателиУведомленийUnbilled.Идентификатор2
			|ИЗ
			|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
			|ГДЕ
			|	ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR
			|	И ПолучателиУведомленийUnbilled.Source = &Source
			|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
			|	И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2
			//|	И ПолучателиУведомленийUnbilled.Уровень = ЗНАЧЕНИЕ(Справочник.EscalationLevels.Level1)
			|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
			|	И ПолучателиУведомленийUnbilled.Получатель = &Получатель";
			
		Если ЭтотОбъект.Отбор.Source.Использование Тогда
			Запрос.УстановитьПараметр("Source", ЭтотОбъект.Отбор.Source.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Source = &Source", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Идентификатор1.Использование Тогда
			Запрос.УстановитьПараметр("Идентификатор1", ЭтотОбъект.Отбор.Идентификатор1.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Идентификатор2.Использование Тогда
			Запрос.УстановитьПараметр("Идентификатор2", ЭтотОбъект.Отбор.Идентификатор2.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Получатель.Использование Тогда
			Запрос.УстановитьПараметр("Получатель", ЭтотОбъект.Отбор.Получатель.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Получатель = &Получатель", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Уровень.Использование Тогда
			Запрос.УстановитьПараметр("Уровень", ЭтотОбъект.Отбор.Уровень.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Уровень = &Уровень", "");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			РегистрыСведений.ОчередьОбновленияSalesOrderResponsibles.Добавить(ВыборкаДетальныеЗаписи.Source, ВыборкаДетальныеЗаписи.Идентификатор1, ВыборкаДетальныеЗаписи.Идентификатор2);
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	//Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
	//	
	//	Если ЗаписьНабора.Уровень <> Справочники.EscalationLevels.Level1 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолучателиУведомленийUnbilled.Получатель) КАК КоличествоОтветственных
	//		|ИЗ
	//		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
	//		|ГДЕ
	//		|	ПолучателиУведомленийUnbilled.Source = &Source
	//		|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
	//		|	И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2
	//		|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
	//		|	И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR";
	//	
	//	Запрос.УстановитьПараметр("Source", ЗаписьНабора.Source);
	//	Запрос.УстановитьПараметр("Идентификатор1", ЗаписьНабора.Идентификатор1);
	//	Запрос.УстановитьПараметр("Идентификатор2", ЗаписьНабора.Идентификатор2);
	//	Запрос.УстановитьПараметр("Уровень", ЗаписьНабора.Уровень);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		
	//		Если ВыборкаДетальныеЗаписи.КоличествоОтветственных > 1 Тогда
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("You can not specify more than one responsible!", , , , Отказ);
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры
