Функция СформироватьТаблицуИсточникДанных(ПериодОтчета, КоллекцияОтборов) Экспорт
	
	ТекущийПериодОтчета = КонецМесяца(ПериодОтчета);
	ДатаТекущихОстатков = ТекущийПериодОтчета + 1;
	
	ПредыдущийПериодОтчета = КонецМесяца(ДобавитьМесяц(ТекущийПериодОтчета, -1));
	ДатаПредыдущихОстатков = ПредыдущийПериодОтчета + 1;
	
	ПараметрыДанных = Новый Соответствие;
	ПараметрыДанных.Вставить("Период", ТекущийПериодОтчета);
	ПараметрыДанных.Вставить("ДатаОстатков", ДатаТекущихОстатков);
	ПараметрыДанных.Вставить("ИмяИсточникаДанных", "РезультатЗаТекущийМесяц");
	
	РезультатЗаТекущийМесяц = Отчеты.BadDebtsБазовый.СформироватьBadDebtReport(ПараметрыДанных, КоллекцияОтборов);
	
	ПараметрыДанных.Вставить("Период", ПредыдущийПериодОтчета);
	ПараметрыДанных.Вставить("ДатаОстатков", ДатаПредыдущихОстатков);
	ПараметрыДанных.Вставить("ИмяИсточникаДанных", "РезультатЗаПредыдущийМесяц");
	
	РезультатЗаПредыдущийМесяц = Отчеты.BadDebtsБазовый.СформироватьBadDebtReport(ПараметрыДанных, КоллекцияОтборов);
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗНаТекущийПериод.AccountБазовыйЭлемент КАК HFMAccount,
	               |	ТЗНаТекущийПериод.Source КАК Source,
	               |	ТЗНаТекущийПериод.Company КАК Company,
	               |	ТЗНаТекущийПериод.Account КАК Account,
	               |	ТЗНаТекущийПериод.AU КАК AU,
	               |	ТЗНаТекущийПериод.LocationБазовыйЭлементGeomarketManagementGeomarket КАК Geomarket,
	               |	ТЗНаТекущийПериод.LocationБазовыйЭлементGeoMarket КАК SubGeoMarket,
	               |	ТЗНаТекущийПериод.SubSubSegmentБазовыйЭлементРодительРодитель КАК Segment,
	               |	ТЗНаТекущийПериод.ClientID КАК CustomerID,
	               |	ТЗНаТекущийПериод.Client КАК Customer,
	               |	ТЗНаТекущийПериод.ClientCRMID КАК CustomerCRMID,
	               |	ТЗНаТекущийПериод.Currency КАК Currency,
	               |	ТЗНаТекущийПериод.LegalEntity КАК LegalEntity,
	               |	ТЗНаТекущийПериод.BDType КАК BDType,
	               |	ТЗНаТекущийПериод.AmountОстаток КАК CMBalance,
	               |	ТЗНаТекущийПериод.USDAmountОстаток КАК USDCMBalance
	               |ПОМЕСТИТЬ ВТ_ДанныеЗаТекущийМесяц
	               |ИЗ
	               |	&ТЗНаТекущийПериод КАК ТЗНаТекущийПериод
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗНаПредыдущийПериод.AccountБазовыйЭлемент КАК HFMAccount_Пред,
	               |	ТЗНаПредыдущийПериод.Source КАК Source_Пред,
	               |	ТЗНаПредыдущийПериод.Company КАК Company_Пред,
	               |	ТЗНаПредыдущийПериод.Account КАК Account_Пред,
	               |	ТЗНаПредыдущийПериод.AU КАК AU_Пред,
	               |	ТЗНаПредыдущийПериод.LocationБазовыйЭлементGeomarketManagementGeomarket КАК Geomarket_Пред,
	               |	ТЗНаПредыдущийПериод.LocationБазовыйЭлементGeoMarket КАК SubGeoMarket_Пред,
	               |	ТЗНаПредыдущийПериод.SubSubSegmentБазовыйЭлементРодительРодитель КАК Segment_Пред,
	               |	ТЗНаПредыдущийПериод.ClientID КАК CustomerID_Пред,
	               |	ТЗНаПредыдущийПериод.Client КАК Customer_Пред,
	               |	ТЗНаПредыдущийПериод.ClientCRMID КАК CustomerCRMID_Пред,
	               |	ТЗНаПредыдущийПериод.Currency КАК Currency_Пред,
	               |	ТЗНаПредыдущийПериод.LegalEntity КАК LegalEntity_Пред,
	               |	ТЗНаПредыдущийПериод.BDType КАК BDType_Пред,
	               |	ТЗНаПредыдущийПериод.AmountОстаток КАК CMBalance_Пред,
	               |	ТЗНаПредыдущийПериод.USDAmountОстаток КАК USDCMBalance_Пред
	               |ПОМЕСТИТЬ ВТ_ДанныеЗаПредыдущийМесяц
	               |ИЗ
	               |	&ТЗНаПредыдущийПериод КАК ТЗНаПредыдущийПериод
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеЗаТекущийМесяц.HFMAccount КАК HFMAccount,
	               |	ВТ_ДанныеЗаТекущийМесяц.Source КАК Source,
	               |	ВТ_ДанныеЗаТекущийМесяц.Company КАК Company,
	               |	ВТ_ДанныеЗаТекущийМесяц.Account КАК Account,
	               |	ВТ_ДанныеЗаТекущийМесяц.AU КАК AU,
	               |	ВТ_ДанныеЗаТекущийМесяц.Geomarket КАК Geomarket,
	               |	ВТ_ДанныеЗаТекущийМесяц.SubGeoMarket КАК SubGeoMarket,
	               |	ВТ_ДанныеЗаТекущийМесяц.Segment КАК Segment,
	               |	ВТ_ДанныеЗаТекущийМесяц.CustomerID КАК CustomerID,
	               |	ВТ_ДанныеЗаТекущийМесяц.Customer КАК Customer,
	               |	ВТ_ДанныеЗаТекущийМесяц.CustomerCRMID КАК CustomerCRMID,
	               |	ВТ_ДанныеЗаТекущийМесяц.Currency КАК Currency,
	               |	ВТ_ДанныеЗаТекущийМесяц.LegalEntity КАК LegalEntity,
	               |	ВТ_ДанныеЗаТекущийМесяц.BDType КАК BDType,
	               |	СУММА(ВТ_ДанныеЗаТекущийМесяц.CMBalance) КАК CMBalance,
	               |	СУММА(ВТ_ДанныеЗаТекущийМесяц.USDCMBalance) КАК USDCMBalance
	               |ПОМЕСТИТЬ ДанныеЗаТекущийМесяцГруппировка
	               |ИЗ
	               |	ВТ_ДанныеЗаТекущийМесяц КАК ВТ_ДанныеЗаТекущийМесяц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеЗаТекущийМесяц.HFMAccount,
	               |	ВТ_ДанныеЗаТекущийМесяц.Source,
	               |	ВТ_ДанныеЗаТекущийМесяц.Company,
	               |	ВТ_ДанныеЗаТекущийМесяц.Account,
	               |	ВТ_ДанныеЗаТекущийМесяц.AU,
	               |	ВТ_ДанныеЗаТекущийМесяц.Geomarket,
	               |	ВТ_ДанныеЗаТекущийМесяц.SubGeoMarket,
	               |	ВТ_ДанныеЗаТекущийМесяц.Segment,
	               |	ВТ_ДанныеЗаТекущийМесяц.CustomerID,
	               |	ВТ_ДанныеЗаТекущийМесяц.Customer,
	               |	ВТ_ДанныеЗаТекущийМесяц.CustomerCRMID,
	               |	ВТ_ДанныеЗаТекущийМесяц.Currency,
	               |	ВТ_ДанныеЗаТекущийМесяц.LegalEntity,
	               |	ВТ_ДанныеЗаТекущийМесяц.BDType
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеЗаПредыдущийМесяц.HFMAccount_Пред КАК HFMAccount_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Source_Пред КАК Source_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Company_Пред КАК Company_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Account_Пред КАК Account_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.AU_Пред КАК AU_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Geomarket_Пред КАК Geomarket_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.SubGeoMarket_Пред КАК SubGeoMarket_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Segment_Пред КАК Segment_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.CustomerID_Пред КАК CustomerID_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Customer_Пред КАК Customer_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.CustomerCRMID_Пред КАК CustomerCRMID_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Currency_Пред КАК Currency_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.LegalEntity_Пред КАК LegalEntity_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.BDType_Пред КАК BDType_Пред,
	               |	СУММА(ВТ_ДанныеЗаПредыдущийМесяц.CMBalance_Пред) КАК CMBalance_Пред,
	               |	СУММА(ВТ_ДанныеЗаПредыдущийМесяц.USDCMBalance_Пред) КАК USDCMBalance_Пред
	               |ПОМЕСТИТЬ ДанныеЗаПредыдущийМесяцГруппировка
	               |ИЗ
	               |	ВТ_ДанныеЗаПредыдущийМесяц КАК ВТ_ДанныеЗаПредыдущийМесяц
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеЗаПредыдущийМесяц.HFMAccount_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Source_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Company_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Account_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.AU_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Geomarket_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.SubGeoMarket_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Segment_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.CustomerID_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Customer_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.CustomerCRMID_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.Currency_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.LegalEntity_Пред,
	               |	ВТ_ДанныеЗаПредыдущийМесяц.BDType_Пред
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.HFMAccount, ДанныеЗаПредыдущийМесяцГруппировка.HFMAccount_Пред) КАК HFMAccount,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.Source, ДанныеЗаПредыдущийМесяцГруппировка.Source_Пред) КАК Source,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.Company, ДанныеЗаПредыдущийМесяцГруппировка.Company_Пред) КАК Company,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.Account, ДанныеЗаПредыдущийМесяцГруппировка.Account_Пред) КАК Account,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.AU, ДанныеЗаПредыдущийМесяцГруппировка.AU_Пред) КАК AU,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.Geomarket, ДанныеЗаПредыдущийМесяцГруппировка.Geomarket_Пред) КАК Geomarket,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.SubGeoMarket, ДанныеЗаПредыдущийМесяцГруппировка.SubGeoMarket_Пред) КАК SubGeoMarket,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.Segment, ДанныеЗаПредыдущийМесяцГруппировка.Segment_Пред) КАК Segment,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.CustomerID, ДанныеЗаПредыдущийМесяцГруппировка.CustomerID_Пред) КАК CustomerCode,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.Customer, ДанныеЗаПредыдущийМесяцГруппировка.Customer_Пред) КАК CustomerName,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.CustomerCRMID, ДанныеЗаПредыдущийМесяцГруппировка.CustomerCRMID_Пред) КАК CustomerCRMID,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.Currency, ДанныеЗаПредыдущийМесяцГруппировка.Currency_Пред) КАК Currency,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.LegalEntity, ДанныеЗаПредыдущийМесяцГруппировка.LegalEntity_Пред) КАК LegalEntity,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.BDType, ДанныеЗаПредыдущийМесяцГруппировка.BDType_Пред) КАК BDType,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.CMBalance, 0) КАК CMBalance,
	               |	ЕСТЬNULL(ДанныеЗаТекущийМесяцГруппировка.USDCMBalance, 0) КАК USDCMBalance,
	               |	ЕСТЬNULL(ДанныеЗаПредыдущийМесяцГруппировка.CMBalance_Пред, 0) КАК PMBalance,
	               |	ЕСТЬNULL(ДанныеЗаПредыдущийМесяцГруппировка.USDCMBalance_Пред, 0) КАК USDPMBalance
	               |ИЗ
	               |	ДанныеЗаТекущийМесяцГруппировка КАК ДанныеЗаТекущийМесяцГруппировка
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеЗаПредыдущийМесяцГруппировка КАК ДанныеЗаПредыдущийМесяцГруппировка
	               |		ПО ДанныеЗаТекущийМесяцГруппировка.HFMAccount = ДанныеЗаПредыдущийМесяцГруппировка.HFMAccount_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.Account = ДанныеЗаПредыдущийМесяцГруппировка.Account_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.Source = ДанныеЗаПредыдущийМесяцГруппировка.Source_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.Company = ДанныеЗаПредыдущийМесяцГруппировка.Company_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.AU = ДанныеЗаПредыдущийМесяцГруппировка.AU_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.Geomarket = ДанныеЗаПредыдущийМесяцГруппировка.Geomarket_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.SubGeoMarket = ДанныеЗаПредыдущийМесяцГруппировка.SubGeoMarket_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.Segment = ДанныеЗаПредыдущийМесяцГруппировка.Segment_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.CustomerID = ДанныеЗаПредыдущийМесяцГруппировка.CustomerID_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.Customer = ДанныеЗаПредыдущийМесяцГруппировка.Customer_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.CustomerCRMID = ДанныеЗаПредыдущийМесяцГруппировка.CustomerCRMID_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.Currency = ДанныеЗаПредыдущийМесяцГруппировка.Currency_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.LegalEntity = ДанныеЗаПредыдущийМесяцГруппировка.LegalEntity_Пред
	               |			И ДанныеЗаТекущийМесяцГруппировка.BDType = ДанныеЗаПредыдущийМесяцГруппировка.BDType_Пред";
	Запрос.УстановитьПараметр("ТЗНаТекущийПериод", РезультатЗаТекущийМесяц);
	Запрос.УстановитьПараметр("ТЗНаПредыдущийПериод", РезультатЗаПредыдущийМесяц);
	
	ТЗ_ИсточникОтчета = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ_ИсточникОтчета;
	
КонецФункции