
Процедура ПриЗаписи(Отказ, Замещение)
	
	СписокКлиентов = ЭтотОбъект.ВыгрузитьКолонку("Client");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Collectors.GeoMarket) КАК КоличествоЗаписейПоКлиенту,
		|	Collectors.Client,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Collectors.GeoMarket = ЗНАЧЕНИЕ(Справочник.HFM_Geomarkets.ПустаяСсылка)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЕстьПустойГеомаркет
		|ИЗ
		|	РегистрСведений.Collectors КАК Collectors
		|ГДЕ
		|	Collectors.Client В(&Clients)
		|
		|СГРУППИРОВАТЬ ПО
		|	Collectors.Client";
	
	Запрос.УстановитьПараметр("Clients", СписокКлиентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.КоличествоЗаписейПоКлиенту > 1 И ВыборкаДетальныеЗаписи.ЕстьПустойГеомаркет Тогда
			Отказ = Истина;
			Сообщить("Error writing. Select Geomarket for each collector.");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
