
&НаКлиенте
Процедура SubSegmentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Прежде, чем выбирать саб сегмент - нужно выбрать сегмент
	Если НЕ ЗначениеЗаполнено(Объект.Segment) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Segment"" is empty!",
			, "Segment", "Объект");
			
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура SubSubSegmentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Прежде, чем выбирать саб саб сегмент нужно выбрать саб сегмент
	Если НЕ ЗначениеЗаполнено(Объект.SubSegment) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Sub segment"" is empty!",
			, "SubSegment", "Объект");
			
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
