
&НаКлиенте
Процедура ДоступностьШаблонаПриИзменении(Элемент)
	Если ДоступностьШаблона = "0" Тогда
		Объект.Владелец = rgsНастройкаКонфигурации.ЗначениеНастройки("CommonTemplateOwner");
	Иначе
		Объект.Владелец = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Владелец = rgsНастройкаКонфигурации.ЗначениеНастройки("CommonTemplateOwner") Тогда
		ДоступностьШаблона = "0";
	Иначе
		ДоступностьШаблона = "1";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура DisputeПриИзменении(Элемент)
	Объект.Наименование = Элемент.ТекстРедактирования;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Элементы.ДоступностьШаблона.ТолькоПросмотр = (Объект.Владелец = rgsНастройкаКонфигурации.ЗначениеНастройки("CommonTemplateOwner"));
	
КонецПроцедуры
