
&НаКлиенте
Процедура ДоступностьШаблонаПриИзменении(Элемент)
	Если ДоступностьШаблона = "0" Тогда
		Объект.Владелец = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	Иначе
		Объект.Владелец = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Владелец = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		ДоступностьШаблона = "0";
	Иначе
		ДоступностьШаблона = "1";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура DisputeПриИзменении(Элемент)
	Объект.Наименование = Элемент.ТекстРедактирования;
КонецПроцедуры