
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлючАктуальнойЗаписи(ПараметрКоманды));
	ОткрытьФорму("РегистрСведений.CRMAccountsExtractSourceData.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючАктуальнойЗаписи(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRMAccountsExtractSourceData.ДокументЗагрузки,
		|	CRMAccountsExtractSourceData.СтрокаФайла
		|ИЗ
		|	РегистрСведений.CRMAccountsExtractSourceData КАК CRMAccountsExtractSourceData
		|ГДЕ
		|	CRMAccountsExtractSourceData.AccountId = &AccountId
		|
		|УПОРЯДОЧИТЬ ПО
		|	CRMAccountsExtractSourceData.ДокументЗагрузки.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("AccountId", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "CRMID"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат РегистрыСведений.CRMAccountsExtractSourceData.СоздатьКлючЗаписи(Новый Структура("ДокументЗагрузки, СтрокаФайла"
		, ВыборкаДетальныеЗаписи.ДокументЗагрузки, ВыборкаДетальныеЗаписи.СтрокаФайла));
	
КонецФункции

