#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	ДозаполнитьРеквизиты();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьРеквизиты(Отказ);
	
КонецПроцедуры

Процедура ДозаполнитьРеквизиты()
	
	Код = СокрЛП(Код);
	Наименование = СокрЛП(Наименование);
	
КонецПроцедуры

Процедура ПроверитьРеквизиты(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Code"" is empty!",
			ЭтотОбъект, "Код", , Отказ);
		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		// У элемента (саб саб сегмента) должен быть заполнен родитель (саб сегмент)
		// { RGS TAlmazova 13.07.2016 15:13:17 - отмена проверки на заполнение саб сегмента
		//Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		//	
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//		"""Sub segment"" is empty!",
		//		ЭтотОбъект, "Родитель", , Отказ);
		//	
		//Иначе
		Если  ЗначениеЗаполнено(Родитель) Тогда
		// } RGS TAlmazova 13.07.2016 15:13:39 - отмена проверки на заполнение саб сегмента
				
		// В родителе (саб сегменте) должен быть указан родитель (сегмент)
			РодительСабСегмента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Родитель");
			Если НЕ ЗначениеЗаполнено(РодительСабСегмента) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					"""Segment"" of sub-segment is empty!",
					ЭтотОбъект, "Родитель", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
