
Функция ПолучитьРеквизитыТранзакции(Документ) Экспорт
	
	ЗначенияРеквизитовТранзакции = Новый Структура("Source, ТранзакцияCompany, ТранзакцияLocation, ТранзакцияAccount, ТранзакцияSubSubSegment, ТранзакцияCurrency, ТранзакцияAU, ТранзакцияClient , ТранзакцияLegalEntity, ТранзакцияAmount, ТранзакцияBaseAmount, ТранзакцияПометкаУдаления, ТранзакцияДата");
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПроводкаDSS") Тогда
		ЗначенияРеквизитовDSS = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Company, Location, AccountLawson, SubSubSegment, Currency, AU, КонтрагентLawson , LegalEntity, BaseAmount, TranAmount, AccountingPeriod");
		ЗначенияРеквизитовТранзакции.ТранзакцияПометкаУдаления = Документ.ПометкаУдаления;
		ЗначенияРеквизитовТранзакции.Source = Перечисления.ТипыСоответствий.Lawson;
		ЗначенияРеквизитовТранзакции.ТранзакцияClient = ЗначенияРеквизитовDSS.КонтрагентLawson;
		ЗначенияРеквизитовТранзакции.ТранзакцияAccount = ЗначенияРеквизитовDSS.AccountLawson;
		ЗначенияРеквизитовТранзакции.ТранзакцияCompany = ЗначенияРеквизитовDSS.Company;
		ЗначенияРеквизитовТранзакции.ТранзакцияLocation = ЗначенияРеквизитовDSS.Location;
		ЗначенияРеквизитовТранзакции.ТранзакцияSubSubSegment = ЗначенияРеквизитовDSS.SubSubSegment;
		ЗначенияРеквизитовТранзакции.ТранзакцияCurrency = ЗначенияРеквизитовDSS.Currency ;
		ЗначенияРеквизитовТранзакции.ТранзакцияAU = ЗначенияРеквизитовDSS.AU;
		ЗначенияРеквизитовТранзакции.ТранзакцияLegalEntity = ЗначенияРеквизитовDSS.LegalEntity;
		ЗначенияРеквизитовТранзакции.ТранзакцияAmount = ЗначенияРеквизитовDSS.TranAmount;
		ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount = ЗначенияРеквизитовDSS.BaseAmount;
		ЗначенияРеквизитовТранзакции.ТранзакцияДата = ЗначенияРеквизитовDSS.AccountingPeriod;
		Возврат ЗначенияРеквизитовТранзакции;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ТранзакцияHOB") Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Company, Location, Account, SubSubSegment, Currency, AU, Client , LegalEntity, Amount, BaseAmount, Дата");
		ЗначенияРеквизитовТранзакции.ТранзакцияПометкаУдаления = Документ.ПометкаУдаления;
		ЗначенияРеквизитовТранзакции.Source = Перечисления.ТипыСоответствий.HOBs;
		ЗначенияРеквизитовТранзакции.ТранзакцияClient = ЗначенияРеквизитов.Client;
		ЗначенияРеквизитовТранзакции.ТранзакцияAccount = ЗначенияРеквизитов.Account;
		ЗначенияРеквизитовТранзакции.ТранзакцияCompany = ЗначенияРеквизитов.Company;
		ЗначенияРеквизитовТранзакции.ТранзакцияLocation = ЗначенияРеквизитов.Location;
		ЗначенияРеквизитовТранзакции.ТранзакцияSubSubSegment = ЗначенияРеквизитов.SubSubSegment;
		ЗначенияРеквизитовТранзакции.ТранзакцияCurrency = ЗначенияРеквизитов.Currency ;
		ЗначенияРеквизитовТранзакции.ТранзакцияAU = ЗначенияРеквизитов.AU;
		ЗначенияРеквизитовТранзакции.ТранзакцияLegalEntity = ЗначенияРеквизитов.LegalEntity;
		ЗначенияРеквизитовТранзакции.ТранзакцияAmount = ЗначенияРеквизитов.Amount;
		ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount = ЗначенияРеквизитов.BaseAmount;
		ЗначенияРеквизитовТранзакции.ТранзакцияДата = ЗначенияРеквизитов.Дата;
		Возврат ЗначенияРеквизитовТранзакции;
	Иначе
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Source, Company,  AU, Location, Account, SubSubSegment, Currency, Client , LegalEntity, Amount, BaseAmount, Дата");
		ЗначенияРеквизитовТранзакции.ТранзакцияПометкаУдаления = Документ.ПометкаУдаления;
		ЗначенияРеквизитовТранзакции.Source = ЗначенияРеквизитов.Source;
		ЗначенияРеквизитовТранзакции.ТранзакцияClient = ЗначенияРеквизитов.Client;
		ЗначенияРеквизитовТранзакции.ТранзакцияAccount = ЗначенияРеквизитов.Account;
		ЗначенияРеквизитовТранзакции.ТранзакцияCompany = ЗначенияРеквизитов.Company;
		ЗначенияРеквизитовТранзакции.ТранзакцияAU = ЗначенияРеквизитов.AU;
		ЗначенияРеквизитовТранзакции.ТранзакцияLocation = ЗначенияРеквизитов.Location;
		ЗначенияРеквизитовТранзакции.ТранзакцияSubSubSegment = ЗначенияРеквизитов.SubSubSegment;
		ЗначенияРеквизитовТранзакции.ТранзакцияCurrency = ЗначенияРеквизитов.Currency ;
		ЗначенияРеквизитовТранзакции.ТранзакцияLegalEntity = ЗначенияРеквизитов.LegalEntity;
		ЗначенияРеквизитовТранзакции.ТранзакцияAmount = ЗначенияРеквизитов.Amount;
		ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount = ЗначенияРеквизитов.BaseAmount;
		ЗначенияРеквизитовТранзакции.ТранзакцияДата = ЗначенияРеквизитов.Дата;
		Возврат ЗначенияРеквизитовТранзакции;
	КонецЕсли;
		
КонецФункции
