#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СтарыеЗначенияКлючей", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Номер, Company,Source"));
	КонецЕсли;
	
	Если Source = Перечисления.ТипыСоответствий.HOBs Тогда
		Если ЭтоНовый() Тогда
			УстановитьНовыйНомер("HB");
		КонецЕсли;
		РеквизитыИнвойса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Company,LegalEntity");
		Если НЕ РегистрыСведений.ДатыDIRИзГИС.ЗаписьЕстьВРегистре(РеквизитыИнвойса) Тогда
			Даты = Новый Соответствие();
			Даты.Вставить("JobEndDate", ?(ЗначениеЗаполнено(ФактическаяДатаРеализации),ФактическаяДатаРеализации,Дата));
			РегистрыСведений.DIR.ЗаписатьДаты(Ссылка, Даты);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОбменДанными.Загрузка Тогда
		
		Если ЗначениеЗаполнено(TriggerDate) И ЗначениеЗаполнено(Contract.PTDaysFrom) И ЗначениеЗаполнено(Contract.СрокОплаты) Тогда
			
			DueDateFrom = TriggerDate + Contract.PTDaysFrom * 86400;
			DueDateTo = TriggerDate + Contract.СрокОплаты * 86400;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("СтарыеЗначенияКлючей") Тогда
		
		СтарыеЗначенияКлючей = ДополнительныеСвойства.СтарыеЗначенияКлючей;
		Если СтарыеЗначенияКлючей.Номер <> Номер
			ИЛИ СтарыеЗначенияКлючей.Company <> Company Тогда
			
			НЗ = РегистрыСведений.КлючиИнвойсов.СоздатьНаборЗаписей();
			НЗ.Отбор.ArInvoice.Установить(СтарыеЗначенияКлючей.Номер);
			НЗ.Отбор.Company.Установить(СтарыеЗначенияКлючей.Company);
			НЗ.Отбор.Source.Установить(СтарыеЗначенияКлючей.Source);
			НЗ.Записать(Истина);
			
			НЗ.Отбор.ArInvoice.Установить(Номер);
			НЗ.Отбор.Company.Установить(Company);
			НЗ.Отбор.Source.Установить(Source);
			ЗаписьНабора = НЗ.Добавить();
			ЗаписьНабора.ArInvoice = Номер;
			ЗаписьНабора.Company = Company;
			ЗаписьНабора.Source = Source;
			ЗаписьНабора.Invoice = Ссылка;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		
		НЗ = РегистрыСведений.КлючиИнвойсов.СоздатьНаборЗаписей();
		НЗ.Отбор.ArInvoice.Установить(Номер);
		НЗ.Отбор.Company.Установить(Company);
		НЗ.Отбор.Source.Установить(Source);
		ЗаписьНабора = НЗ.Добавить();
		ЗаписьНабора.ArInvoice = Номер;
		ЗаписьНабора.Company = Company;
		ЗаписьНабора.Source = Source;
		ЗаписьНабора.Invoice = Ссылка;
		НЗ.Записать(Истина);
		
	КонецЕсли;
	
	Если Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
		Даты = Новый Соответствие();
		Даты.Вставить("JobEndDate", ФактическаяДатаРеализации);
		РегистрыСведений.DIR.ЗаписатьДаты(Ссылка, Даты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	НЗ = РегистрыСведений.КлючиИнвойсов.СоздатьНаборЗаписей();
	НЗ.Отбор.ArInvoice.Установить(Номер);
	НЗ.Отбор.Company.Установить(Company);
	НЗ.Отбор.Source.Установить(Source);
	НЗ.Записать(Истина);
	
КонецПроцедуры

#КонецЕсли