
#Область СлужебныеПроцедурыИФункции

// Определение цветов выделения результатов проверки контрагентов.
//
// Возвращаемое значение:
//  Структура - Имена ключей - это названия цветов, которые необходимо определить.
//
Функция ЦветаРезультатовПроверки() Экспорт
	
	Возврат ПроверкаКонтрагентов.ЦветаРезультатовПроверки();
	
КонецФункции

// Свойства справочника контрагенты.
// Предназначена для определения имени справочника, имени реквизитов ИНН и КПП.
//
// Возвращаемое значение:
//  Соответствие - Соответствие с ключами Имя, ИНН и КПП справочника контрагенты.
//
Функция СвойстваСправочниковКонтрагенты() Экспорт
	
	Возврат ПроверкаКонтрагентовВызовСервера.СвойстваСправочниковКонтрагенты();
	
КонецФункции

#КонецОбласти