#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область PowerBI

// Описание
// Выполняет выгрузку данных в Power BI
// Параметры:
// 	Ссылка - Ссылка на данные, которые нужно выгрузить
// 	Операция - вид операции с данными
// Возвращаемое значение:
// 	Структура - включает поля Результат, Сообщение.
Функция ВыгрузитьДанныеДляPowerBI(Ссылка, Операция, ПараметрыЛогирования) Экспорт
	
	СтруктураРезультата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	ТекОбъект = PowerBIРегламенты.ПолучитьОбъектИзВнешнегоИсточника("dbo_LegalEntiites", Операция, Ссылка, ПараметрыЛогирования);
	
	ЗаполнитьОбъект(ТекОбъект, Ссылка);
	
	PowerBIРегламенты.ЗаписатьОбъектВоВнешнийИсточник(ТекОбъект, ПараметрыЛогирования, СтруктураРезультата);
	
	Если НЕ ЗначениеЗаполнено(СтруктураРезультата.Сообщение) Тогда
		СтруктураРезультата.Результат = Истина;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура ЗаполнитьОбъект(Объект, Ссылка)

	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Код, ПометкаУдаления, Наименование, Владелец, Source");
	
	Объект.DeletionMark = СтруктураРеквизитов.ПометкаУдаления;
	Объект.Description = СтруктураРеквизитов.Наименование;
	Объект.Code = СтруктураРеквизитов.Код;
	БазовыйЭлемент = Неопределено;
	Если ЗначениеЗаполнено(СтруктураРеквизитов.Владелец) Тогда
		БазовыйЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитов.Владелец, "БазовыйЭлемент");
	КонецЕсли;
	Если ЗначениеЗаполнено(БазовыйЭлемент) Тогда
		Объект.OwnerID = Строка(БазовыйЭлемент.УникальныйИдентификатор());
	Иначе
		Объект.OwnerID = NULL;
	КонецЕсли;
	Объект.Source = Строка(СтруктураРеквизитов.Source);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли