
&НаСервере
Процедура ЗаписатьПараметрыВИДНаСервере()
	ПараметрыВИД = Новый Структура;
	ПараметрыВИД.Вставить("АутентификацияОС", Ложь);
	ПараметрыВИД.Вставить("АутентификацияСтандартная", Истина);
	ПараметрыВИД.Вставить("ИмяПользователя", "dbuser1c");
	ПараметрыВИД.Вставить("Пароль", "rgs4dm1n@root$");
	ПараметрыВИД.Вставить("СтрокаСоединения", "DRIVER={SQL Native Client};SERVER=RU0021APP04;DATABASE=ERM_GP");
	ПараметрыВИД.Вставить("СУБД", "MSSQLServer");
	
	Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Обработка.PushARDataToGetPaid");
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, ПараметрыВИД, "ПараметрыВИД");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПараметрыВИД(Команда)
	ЗаписатьПараметрыВИДНаСервере();
КонецПроцедуры
