
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
		
		Если Не Объект.Ссылка.Пустая() Тогда
			
			СтруктураВложений = Новый Структура;
			ТекстHTML = Взаимодействия.ОбработатьТекстHTMLДляФорматированногоДокумента(
				Объект.Ссылка, Объект.Body, СтруктураВложений);
			ТекстПисьмаФорматированныйДокумент.УстановитьHTML(ТекстHTML, СтруктураВложений);
			
		КонецЕсли;
		
	Иначе
		
		ТекстПисьмаФорматированныйДокумент.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока(Объект.Body));
		
	КонецЕсли;
	
КонецПроцедуры
