
Процедура УстановитьЗначение(Реквизит, Значение) Экспорт

	// Процедура устанавливает новое значение для переданного реквизита.
	// Если новое значение совпадает со старым, то флаг модифицированности не взводится.
	//
	// Параметры
	//  Реквизит  – Произвольный – Реквизит, для которого надо установить новое значение
	//  Значение  – Произвольный – Новое значение для реквизита
	//
	
	Если Реквизит <> Значение Тогда
		Реквизит = Значение;
	КонецЕсли;

КонецПроцедуры // УстановитьЗначение(Реквизит, Значение)
