
&НаСервере
Процедура СформироватьКорректировкиТранзакцийНаСервере()
	
	НачатьТранзакцию();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТранзакции Из ТаблицаТранзакций Цикл
		
		Если Не СтрокаТранзакции.Apply Тогда
			Продолжить;
		КонецЕсли;
		
		КорректировкаТразакции = Документы.КорректировкаТранзакции.СоздатьДокумент();
		КорректировкаТразакции.Дата = ТекущаяДата();
		КорректировкаТразакции.ДокументОснование = СтрокаТранзакции.Ссылка;
		ЗаполнитьЗначенияСвойств(КорректировкаТразакции, СтрокаТранзакции, "Company,Account,Currency,AU,LegalEntity");
		СтрокаТабЧасти = КорректировкаТразакции.ДетализацияПоКлиенту.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, СтрокаТранзакции);
		СтрокаТабЧасти.Client = НовыйКлинет;
		КорректировкаТразакции.Комментарий = "The document was created using Group creation of Transaction adjustment for changes client""";
		КорректировкаТразакции.Ответственный = ТекущийПользователь;
		КорректировкаТразакции.Записать(РежимЗаписиДокумента.Запись);
		
		ТекДок = КорректировкаТразакции.Ссылка.ПолучитьОбъект();
		Попытка
			ТекДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не удалось записать """ + ТекДок + """! ");
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Transaction adjustments created!");
	
	ЗафиксироватьТранзакцию();
	
	ОтобразитьТранзакцииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКорректировкиТранзакций(Команда)
	СформироватьКорректировкиТранзакцийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаТранзакций Цикл
		Если Элементы.ТаблицаТранзакций.ПроверитьСтроку(СтрокаТаблицы.ПолучитьИдентификатор()) Тогда
			СтрокаТаблицы.Apply = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТаблицы Из ТаблицаТранзакций Цикл
		СтрокаТаблицы.Apply = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьТранзакцииНаСервере()
	
	Если Source = Перечисления.ТипыСоответствий.HOBs Тогда
		ТЗ_Транзакций = ПолучитьТранзакцииHOBs();
	ИначеЕсли Source = Перечисления.ТипыСоответствий.Lawson Тогда
		ТЗ_Транзакций = ПолучитьТранзакцииLawson();
	ИначеЕсли Source = Перечисления.ТипыСоответствий.OracleMI ИЛИ Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
		ТЗ_Транзакций = ПолучитьТранзакцииOracle();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТЗ_Транзакций, "ТаблицаТранзакций");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТранзакцииHOBs()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Apply,
		|	ТранзакцияHOB.Номер,
		|	ТранзакцияHOB.Account,
		|	ТранзакцияHOB.Amount,
		|	ТранзакцияHOB.BaseAmount,
		|	ТранзакцияHOB.Client,
		|	ТранзакцияHOB.Company,
		|	ТранзакцияHOB.Currency,
		|	ТранзакцияHOB.CustomerNumber,
		|	"""" КАК CreatedByName,
		|	"""" КАК Description,
		|	ТранзакцияHOB.AU,
		|	ТранзакцияHOB.LegalEntity,
		|	ТранзакцияHOB.Ссылка
		|ИЗ
		|	Документ.ТранзакцияHOB КАК ТранзакцияHOB
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаТранзакции КАК КорректировкаТранзакции
		|		ПО ТранзакцияHOB.Ссылка = КорректировкаТранзакции.ДокументОснование
		|			И (НЕ КорректировкаТранзакции.ПометкаУдаления)
		|ГДЕ
		|	ТранзакцияHOB.Проведен
		|	И ТранзакцияHOB.Дата <= &ДатаОкончания
		|	И ТранзакцияHOB.Дата >= &ДатаНачала
		|	&УсловиеСчета
		|	И ВЫБОР
		|			КОГДА &Company = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТранзакцияHOB.Company = &Company
		|		КОНЕЦ
		|	И ТранзакцияHOB.Client.Предопределенный
		|	И ВЫБОР
		|			КОГДА &AU = ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТранзакцияHOB.AU = &AU
		|		КОНЕЦ
		|	И КорректировкаТранзакции.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("AU", AU);
	Запрос.УстановитьПараметр("Company", Company);
	Запрос.УстановитьПараметр("Source", Source);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	Если ТипСчета = Перечисления.ТипСчета.AR Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И НЕ ТранзакцияHOB.Account.Код ПОДОБНО ""4%""");
	ИначеЕсли ТипСчета = Перечисления.ТипСчета.Revenue Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И ТранзакцияHOB.Account.Код ПОДОБНО ""4%""");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьТранзакцииLawson()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Apply,
		|	ПроводкаDSS.Номер,
		|	ПроводкаDSS.Company,
		|	ПроводкаDSS.Currency,
		|	ПроводкаDSS.Description,
		|	ПроводкаDSS.CustomerNumber,
		|	"""" КАК CreatedByName,
		|	ПроводкаDSS.AU,
		|	ПроводкаDSS.LegalEntity,
		|	ПроводкаDSS.AccountLawson КАК Account,
		|	ПроводкаDSS.КонтрагентLawson КАК Client,
		|	ПроводкаDSS.TranAmount КАК Amount,
		|	ПроводкаDSS.BaseAmount,
		|	ПроводкаDSS.Ссылка
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаТранзакции КАК КорректировкаТранзакции
		|		ПО ПроводкаDSS.Ссылка = КорректировкаТранзакции.ДокументОснование
		|			И (НЕ КорректировкаТранзакции.ПометкаУдаления)
		|ГДЕ
		|	ПроводкаDSS.Проведен
		|	И ПроводкаDSS.DateLawson <= &ДатаОкончания
		|	И ПроводкаDSS.DateLawson >= &ДатаНачала
		|	&УсловиеСчета
		|	И ВЫБОР
		|			КОГДА &Company = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПроводкаDSS.Company = &Company
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &AU = ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПроводкаDSS.AU = &AU
		|		КОНЕЦ
		|	И ПроводкаDSS.КонтрагентLawson.Предопределенный
		|	И КорректировкаТранзакции.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("AU", AU);
	Запрос.УстановитьПараметр("Company", Company);
	Запрос.УстановитьПараметр("Source", Source);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	Если ТипСчета = Перечисления.ТипСчета.AR Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И НЕ ПроводкаDSS.AccountLawson.Код ПОДОБНО ""4%""");
	ИначеЕсли ТипСчета = Перечисления.ТипСчета.Revenue Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И ПроводкаDSS.AccountLawson.Код ПОДОБНО ""4%""");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьТранзакцииOracle()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Apply,
		|	ТранзакцияOracle.Номер,
		|	ТранзакцияOracle.Account,
		|	ТранзакцияOracle.Amount,
		|	ТранзакцияOracle.BaseAmount,
		|	ТранзакцияOracle.Client,
		|	ТранзакцияOracle.Company,
		|	ТранзакцияOracle.Currency,
		|	ТранзакцияOracle.Description,
		|	ТранзакцияOracle.CustomerNumber,
		|	ТранзакцияOracle.CreatedByName,
		|	ТранзакцияOracle.AU,
		|	ТранзакцияOracle.LegalEntity,
		|	ТранзакцияOracle.Ссылка
		|ИЗ
		|	Документ.ТранзакцияOracle КАК ТранзакцияOracle
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаТранзакции КАК КорректировкаТранзакции
		|		ПО ТранзакцияOracle.Ссылка = КорректировкаТранзакции.ДокументОснование
		|			И (НЕ КорректировкаТранзакции.ПометкаУдаления)
		|ГДЕ
		|	ТранзакцияOracle.Проведен
		|	И ТранзакцияOracle.Дата <= &ДатаОкончания
		|	И ТранзакцияOracle.Дата >= &ДатаНачала
		|	&УсловиеСчета
//		|	И (&Company = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ИЛИ ТранзакцияOracle.Company = &Company)
//		|	И (&Client = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ИЛИ ТранзакцияOracle.Client = &Client)
//		|	И (&CustomerNumber = """" ИЛИ ТранзакцияOracle.CustomerNumber = &CustomerNumber)
//		|	И (&Currency = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ИЛИ ТранзакцияOracle.Currency = &Currency)
//		|	И (&LegalEntity = ЗНАЧЕНИЕ(Справочник.LegalEntiites.ПустаяСсылка) ИЛИ ТранзакцияOracle.LegalEntity = &LegalEntity)
//		|	И (&Account = Неопределено ИЛИ ТранзакцияOracle.Account = &Account)
		|	И ТранзакцияOracle.Client.Предопределенный
		|	И ТранзакцияOracle.Source = &Source
		|	И ВЫБОР
		|			КОГДА &AU = ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТранзакцияOracle.AU = &AU
		|		КОНЕЦ
		|	И КорректировкаТранзакции.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("AU", AU);
	Запрос.УстановитьПараметр("Company", Company);
	Запрос.УстановитьПараметр("Source", Source);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Client", Client);
	Запрос.УстановитьПараметр("CustomerNumber", CustomerNumber);
	Запрос.УстановитьПараметр("Currency", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Account", Account);
	Запрос.УстановитьПараметр("LegalEntity", LegalEntity);
	
	Если ТипСчета = Перечисления.ТипСчета.AR Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И НЕ ТранзакцияOracle.Account.Код ПОДОБНО ""4%""");
	ИначеЕсли ТипСчета = Перечисления.ТипСчета.Revenue Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "И ТранзакцияOracle.Account.Код ПОДОБНО ""4%""");
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСчета", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьТранзакции(Команда)
	ОтобразитьТранзакцииНаСервере();
КонецПроцедуры
