Функция РеквизитыДоговораСтрокой(Номер, Дата) Экспорт
	
	// 123 от 08.12.1999
	
	Слова = Новый Массив;
	Если ЗначениеЗаполнено(Номер) Тогда
		Слова.Добавить(СокрЛП(Номер));
	КонецЕсли;
	Если ЗначениеЗаполнено(Дата) Тогда
		Слова.Добавить(СтрШаблон(НСтр("ru = 'от %1'"), Формат(Дата, "ДЛФ=D")));
	КонецЕсли;
	
	Возврат СтрСоединить(Слова, " ");
	
КонецФункции

Функция НаименованиеПоУмолчаниюБезРеквизитов() Экспорт
	
	// Такое наименование по умолчанию используется только тогда, когда договор нужно сохранить, но дата и номер договора неизвестны.
	// При интерактивном вводе договора наименование по умолчанию устанавливается исходя из номера и даты - см. РеквизитыДоговораСтрокой().
	
	Возврат НСтр("ru = 'Основной договор'");
	
КонецФункции
