#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ДатаПервойПроводкиПоДокументу(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДатыПервыхПроводокПоInvoicedDebts.ДатаПроводки
		|ИЗ
		|	РегистрСведений.ДатыПервыхПроводокПоInvoicedDebts КАК ДатыПервыхПроводокПоInvoicedDebts
		|ГДЕ
		|	ДатыПервыхПроводокПоInvoicedDebts.Invoice = &Invoice";
	
	Запрос.УстановитьПараметр("Invoice", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ДатаПроводки;
	
КонецФункции

Процедура ОчиститьЗаписьПоПроводке(Документ, Проводка) Экспорт
	
	НЗ = РегистрыСведений.ДатыПервыхПроводокПоInvoicedDebts.СоздатьНаборЗаписей();
	НЗ.Отбор.Invoice.Установить(Документ);
	НЗ.Прочитать();
	
	Если НЗ.Количество() = 0 ИЛИ НЗ[0].Проводка <> Проводка Тогда
		Возврат;
	КонецЕсли;
	
	НЗ.Очистить();
	НЗ.Записать(Истина);
	
КонецПроцедуры


#КонецЕсли
