////////////////////////////////////////////////////////////////////////////////
///ФУНКЦИИ, ПРОЦЕДУРЫ БСБ ОБЩЕГО НАЗНАЧЕНИЯ
////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьЗначениеНастройки(Знач Настройка, ВызыватьИсключение = Истина) Экспорт
	
	НастройкаЭтоСтрока = Истина;
	Если ТипЗнч(Настройка) = Тип("Строка") Тогда
		
		СтрокиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Настройка, ".");
		ИмяНастройки = СтрокиИмени[СтрокиИмени.Количество() - 1];
		
		Настройка = ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиКонфигурации." + ИмяНастройки);
		
	Иначе
		
		ИмяНастройки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолучитьПолноеИмяПредопределенногоЗначения(Настройка), ".")[2];
		НастройкаЭтоСтрока = Ложь;
		
	КонецЕсли;
	
	НайденноеЗначение = ПолучитьЗначениеСохраненнойНастройки(Настройка);
				
	Если НайденноеЗначение = Неопределено И ВызыватьИсключение Тогда
		СтрокаИсключения = "Невозможно получить значение настройки " + """" + ИмяНастройки + """" + ".
			| Значение настройки не установлено!";
		ВызватьИсключение СтрокаИсключения;
	КонецЕсли;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьПредопределенноеЗначениеПоИмени(ИмяЗначения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиКонфигурации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	ПланВидовХарактеристик.НастройкиКонфигурации КАК НастройкиКонфигурации
	                      |ГДЕ
	                      |	НастройкиКонфигурации.Ссылка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиКонфигурации." + ИмяЗначения + ")");
						  
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		СтрокаИсключения = "Не найдено предопределенное значение по имени " + """" + ИмяЗначения + """" + " для плана вида характеристи ""Настройки конфигурации""";
		ВызватьИсключение СтрокаИсключения;
		
	КонецЕсли;
	
	Возврат Результат.Выбрать()[0].Ссылка;
	
КонецФункции

Функция ПолучитьЗначениеСохраненнойНастройки(Настройка)
	
	НайденноеЗначение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СохраненныеНастройкиКонфигурации.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.СохраненныеНастройкиКонфигурации КАК СохраненныеНастройкиКонфигурации
	               |ГДЕ
	               |	СохраненныеНастройкиКонфигурации.Настройка = &Настройка";
	Запрос.УстановитьПараметр("Настройка", Настройка);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		НайденноеЗначение = Результат.Выгрузить()[0].Значение;
		
	КонецЕсли;
	
	Возврат НайденноеЗначение;
			
	
КонецФункции
