#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ПометкаУдаления Тогда
	
		Дата = НачалоДня(Дата);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗакрытиеМесяца.Ссылка
			|ИЗ
			|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
			|ГДЕ
			|	НЕ ЗакрытиеМесяца.ПометкаУдаления
			|	И ЗакрытиеМесяца.Дата = &Дата
			|	И ЗакрытиеМесяца.ВидОперации = &ВидОперации
			|	И ЗакрытиеМесяца.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
		Если ВыборкаДетальныеЗаписи.Количество() <> 0 Тогда
			ВыборкаДетальныеЗаписи.Следующий();
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("In this period there already exists a document: " + ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
		
		Ответственный = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("АдресФайлаВХранилище") Тогда
		
		АдресФайлаВХранилище = ДополнительныеСвойства.АдресФайлаВХранилище;
		ДополнительныеСвойства.Удалить("АдресФайлаВХранилище");
		
		Отказ = РГСофт.СоздатьПрисоединенныйФайлЗагрузки(ИмяФайла, Ссылка, АдресФайлаВХранилище, "Reconciliation with HFM");
		
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли


